#pragma once
#include <Windows.h>
#include <iostream>

enum eUserActType
{
	act_idle							= 3,
	act_moving							= 5,
	act_attacking						= 7,
	act_dashing							= 12,
	act_usingacts						= 18,
	act_usingabikeidle					= 21,
	act_using_bike_walking_straight		= 22,
	act_using_bike_walking_right		= 23,
	act_using_bike_walking_left			= 24
};


enum eEntityTypes
{
	tgt_monster,	   //target_index
	tgt_othercharacter,//char idx do alvo
	tgt_mycharacter,   //meu char idx
	tgt_warp,   //idx do warp
	tgt_npcobjects = 5, //se for npc object o charIdx será o id do npc
	tgt_dummytraining = 6 //se for npc object o charIdx será o id do npc
};

#pragma pack(push,1)
struct EntityData
{
	__int16 mmapIndex;
	__int8 worldIdx;
	__int8 entityType;

	unsigned __int32 GetCharIdx()
	{
		return *(unsigned __int32*)this;
	}
};

struct SKILL_DATA
{
	int var_00000;                                   //  0x00000
	int var_00004;                                   //  0x00004
	int var_00008;                                   //  0x00008
	int var_0000C;                                   //  0x0000C
	int var_00010;                                   //  0x00010
	int var_00014;                                   //  0x00014
	int var_00018;                                   //  0x00018
	int var_0001C;                                   //  0x0001C
	int var_00020;                                   //  0x00020
	int var_00024;                                   //  0x00024
	int var_00028;                                   //  0x00028
	int var_0002C;                                   //  0x0002C
	int var_00030;                                   //  0x00030
	int var_00034;                                   //  0x00034
	int var_00038;                                   //  0x00038
	int var_0003C;                                   //  0x0003C
	int var_00040;                                   //  0x00040
	int var_00044;                                   //  0x00044
	int var_00048;                                   //  0x00048
	int var_0004C;                                   //  0x0004C
	int var_00050;                                   //  0x00050
	int var_00054;                                   //  0x00054
	int var_00058;                                   //  0x00058
	int var_0005C;                                   //  0x0005C
	int var_00060;                                   //  0x00060
	int var_00064;                                   //  0x00064
	int var_00068;                                   //  0x00068
	int var_0006C;                                   //  0x0006C
	int var_00070;                                   //  0x00070
	int var_00074;                                   //  0x00074
	int var_00078;                                   //  0x00078
	int var_0007C;                                   //  0x0007C
	int var_00080;                                   //  0x00080
	int var_00084;                                   //  0x00084
	int var_00088;                                   //  0x00088
	int var_0008C;                                   //  0x0008C
	int var_00090;                                   //  0x00090
	int var_00094;                                   //  0x00094
	int var_00098;                                   //  0x00098
	int var_0009C;                                   //  0x0009C
	int var_000A0;                                   //  0x000A0
	int value_ref;                                   //  0x000A4
	int var_000A8;                                   //  0x000A8
	int var_000AC;                                   //  0x000AC
	int var_000B0;                                   //  0x000B0
	int iSkillIdx;                                   //  0x000B4
	int iGroup;										 //  0x000B8
	int iItensity;                                   //  0x000BC
	int var_000C0;                                   //  0x000C0
	unsigned short cooltimeIdx;                      //  0x000C4
	unsigned short var_000C6;                        //  0x000C6
	int var_000C8;                                   //  0x000C8
	int var_000CC;                                   //  0x000CC
	int var_000D0;                                   //  0x000D0
	int durCoef[2];									 //  0x000D4
	int var_000DC;                                   //  0x000DC
	int var_000E0;                                   //  0x000E0
	int var_000E4;                                   //  0x000E4
	int var_000E8;                                   //  0x000E8
	int target;										 //  0x000EC
	int max_target;                                  //  0x000F0
	int reach;                                       //  0x000F4
	int anicode;                                     //  0x000F8
	int iFxcode_on;                                  //  0x000FC
	int iFxcode_keep;                                //  0x00100
	int expCoef[2];                                  //  0x00104
	int var_0010C;                                   //  0x0010C
	int var_00110;                                   //  0x00110
	int var_00114;                                   //  0x00114
	int var_00118;                                   //  0x00118
	int mpCoef[2];                                   //  0x0011C
	int var_00124;                                   //  0x00124
	int var_00128;                                   //  0x00128
	int var_0012C;                                   //  0x0012C
	int var_00130;                                   //  0x00130
	int var_00134;                                   //  0x00134
	int var_00138;                                   //  0x00138
	int var_0013C;                                   //  0x0013C
	int var_00140;                                   //  0x00140
	int var_00144;                                   //  0x00144
	int var_00148;                                   //  0x00148
	int var_0014C;                                   //  0x0014C
	int usecase;                                     //  0x00150
	int var_00154;                                   //  0x00154
	int var_00158;                                   //  0x00158
	int var_0015C;                                   //  0x0015C
	int iTerm;										 //  0x00160
	int iBlendlimit;                                 //  0x00164
	int iHit_frame;                                  //  0x00168
	int iFiring_frame;                               //  0x0016C
	int iAni_f;                                      //  0x00170
	int iLocal_f;                                    //  0x00174
	int var_00178;                                   //  0x00178
	int var_0017C;                                   //  0x0017C
	int var_00180;                                   //  0x00180
};

struct SKILL_COOLTIME_DATA
{
	WORD var_0x00;
	WORD cooltimeIndex;
	int var_0x04;
	double lastUse;
	double skillDuration;
	void* ptr1;
	void* ptr2;
	int var_0x20;
	int var_0x24;
};

struct TREEDATA
{
	TREEDATA* current;
	TREEDATA* next;
	TREEDATA* previous;
	bool isFirst;
	bool isLast;
	SKILL_COOLTIME_DATA data;


	TREEDATA* GetNextNode(TREEDATA* treeData)
	{
		TREEDATA* currentNode; // antigo result
		TREEDATA* nextNode; // antigo v2

		currentNode = treeData;
		nextNode = treeData->current;
		if (!treeData->current->isLast)
		{
			do
			{
				currentNode = nextNode;
				nextNode = nextNode->current;
			} while (!nextNode->isLast);
		}
		return currentNode;
	}

	TREEDATA* FixTree()
	{
		TREEDATA* treeData		= 0;
		TREEDATA* currentNode	= 0; 
		TREEDATA* nextNode		= 0; 

		currentNode = current;

		if (current->previous->isLast)
		{
			for (nextNode = currentNode->next; !nextNode->isLast && currentNode == nextNode->previous; nextNode = nextNode->next)
			{
				current = nextNode;
				currentNode = nextNode;
			}
		}
		else
		{
			nextNode = (TREEDATA*)GetNextNode(current->previous);
		}

		current = nextNode;

		return treeData;
	}

	void RemoveObject(TREEDATA* object)
	{

	}
};

class SKILLMANAGER
{
public:
	TREEDATA*	tree_skillCooldown;
	int			_nodeCount;

	TREEDATA* FindSkillByCooldownIdx(unsigned short cooltimeIdx)
	{
		TREEDATA* nextTree		= tree_skillCooldown->next;
		TREEDATA* result		= nullptr;

		while (!nextTree->isLast)
		{
			printf("Index: %d\n", nextTree->data.cooltimeIndex);


			if (nextTree->data.cooltimeIndex == cooltimeIdx)
			{
				result = nextTree;
				break;
			}
			else
			{
				nextTree	= nextTree->previous;
			}
		}
		return result;
	}

	//apenas backup da função de cima
	TREEDATA* FindSkillByCooldownIdx_Backup(unsigned short cooltimeIdx)
	{
		TREEDATA* beginTree = tree_skillCooldown;
		TREEDATA* nextTree = tree_skillCooldown->next;

		while (!nextTree->isLast)
		{
			if (nextTree->data.cooltimeIndex >= cooltimeIdx)
			{
				beginTree = nextTree;
				nextTree = nextTree->current;
			}
			else
			{
				nextTree = nextTree->previous;
			}
		}
		return beginTree;
	}


	void ClearSkillCooldown(int skillIdx);



	//essa func tem a remove node ->     //auto result = ((DWORD*(__thiscall*)(DWORD, WORD*))0x005EFCA9)(*(DWORD*)0x00CD9688, &test);


};

class USERDATACONTEXT_EXT
{
public:
	virtual void Function_00004();	//  0x00004
	virtual void Function_00008();	//  0x00008
	virtual void Function_0000C();	//  0x0000C
	virtual void Function_00010();	//  0x00010
	virtual void Function_00014();	//  0x00014
	virtual void Function_00018();	//  0x00018
	virtual void Function_0001C();	//  0x0001C
	virtual void Function_00020();	//  0x00020
	virtual void Function_00024();	//  0x00024
	virtual void Function_00028();	//  0x00028
	virtual void Function_0002C();	//  0x0002C
	virtual void Function_00030();	//  0x00030
	virtual void Function_00034();	//  0x00034
	virtual void Function_00038();	//  0x00038
	virtual void Function_0003C();	//  0x0003C
	virtual void Function_00040();	//  0x00040
	virtual void Function_00044();	//  0x00044
	virtual void Function_00048();	//  0x00048
	virtual void Function_0004C();	//  0x0004C
	virtual void Function_00050();	//  0x00050
	virtual void Function_00054();	//  0x00054
	virtual void Function_00058();	//  0x00058
	virtual void OnUseHabilities(USERDATACONTEXT_EXT* pUserDataCtx, SKILL_DATA* pSkillData);	//  0x0005C
	virtual void Function_00060();	//  0x00060
	virtual void Function_00064();	//  0x00064
	virtual void Function_00068();	//  0x00068
	virtual void Function_0006C();	//  0x0006C
	virtual void Function_00070();	//  0x00070
	virtual void Function_00074();	//  0x00074
	virtual void Function_00078();	//  0x00078
	virtual void Function_0007C();	//  0x0007C


	//functions
	int GetCurrentSkill();
	void SetCurrentSkill(int skillIdx);

	SKILL_DATA* GetSkillPtr(int skillIdx);

	//0 para não DG
	int GetDungeonIdx();

	void ExecuteSkill(int slotIdx);
	INT64 GetGameTime();

	int var_00004;	//  0x00004
	int var_00008;	//  0x00008
	int var_0000C;	//  0x0000C
	int var_00010;	//  0x00010
	int var_00014;	//  0x00014
	int var_00018;	//  0x00018
	int var_0001C;	//  0x0001C
	int var_00020;	//  0x00020
	int var_00024;	//  0x00024
	int var_00028;	//  0x00028
	int var_0002C;	//  0x0002C
	int var_00030;	//  0x00030
	int var_00034;	//  0x00034
	int var_00038;	//  0x00038
	int var_0003C;	//  0x0003C
	int var_00040;	//  0x00040
	int var_00044;	//  0x00044
	int var_00048;	//  0x00048
	int var_0004C;	//  0x0004C
	int var_00050;	//  0x00050
	int var_00054;	//  0x00054
	int var_00058;	//  0x00058
	int var_0005C;	//  0x0005C
	int var_00060;	//  0x00060
	int var_00064;	//  0x00064
	int var_00068;	//  0x00068
	int var_0006C;	//  0x0006C
	int var_00070;	//  0x00070
	int var_00074;	//  0x00074
	int var_00078;	//  0x00078
	int var_0007C;	//  0x0007C
	int var_00080;	//  0x00080
	int var_00084;	//  0x00084
	int var_00088;	//  0x00088
	int var_0008C;	//  0x0008C
	int var_00090;	//  0x00090
	int var_00094;	//  0x00094
	double elapsedTime;	//  0x00098
	float otherTime;	//  0x000A0
	int var_000A4;	//  0x000A4
	int var_000A8;	//  0x000A8
	int var_000AC;	//  0x000AC
	int var_000B0;	//  0x000B0
	int var_000B4;	//  0x000B4
	int var_000B8;	//  0x000B8
	int var_000BC;	//  0x000BC
	int var_000C0;	//  0x000C0
	int var_000C4;	//  0x000C4
	int var_000C8;	//  0x000C8
	int var_000CC;	//  0x000CC
	int var_000D0;	//  0x000D0
	int var_000D4;	//  0x000D4
	int var_000D8;	//  0x000D8
	int var_000DC;	//  0x000DC
	int var_000E0;	//  0x000E0
	int var_000E4;	//  0x000E4
	int var_000E8;	//  0x000E8
	int var_000EC;	//  0x000EC
	int var_000F0;	//  0x000F0
	int var_000F4;	//  0x000F4
	int var_000F8;	//  0x000F8
	int var_000FC;	//  0x000FC
	int var_00100;	//  0x00100
	int var_00104;	//  0x00104
	int var_00108;	//  0x00108
	int var_0010C;	//  0x0010C
	int var_00110;	//  0x00110
	int var_00114;	//  0x00114
	int var_00118;	//  0x00118
	int var_0011C;	//  0x0011C
	int var_00120;	//  0x00120
	int var_00124;	//  0x00124
	int var_00128;	//  0x00128
	int var_0012C;	//  0x0012C
	int var_00130;	//  0x00130
	int var_00134;	//  0x00134
	int var_00138;	//  0x00138
	int var_0013C;	//  0x0013C
	int var_00140;	//  0x00140
	int var_00144;	//  0x00144
	int var_00148;	//  0x00148
	int var_0014C;	//  0x0014C
	int var_00150;	//  0x00150
	int var_00154;	//  0x00154
	int var_00158;	//  0x00158
	int var_0015C;	//  0x0015C
	int var_00160;	//  0x00160
	int var_00164;	//  0x00164
	int var_00168;	//  0x00168
	int var_0016C;	//  0x0016C
	int var_00170;	//  0x00170
	int var_00174;	//  0x00174
	int var_00178;	//  0x00178
	int var_0017C;	//  0x0017C
	int var_00180;	//  0x00180
	int var_00184;	//  0x00184
	int var_00188;	//  0x00188
	int var_0018C;	//  0x0018C
	int var_00190;	//  0x00190
	int var_00194;	//  0x00194
	int var_00198;	//  0x00198
	int var_0019C;	//  0x0019C
	int var_001A0;	//  0x001A0
	int var_001A4;	//  0x001A4
	int var_001A8;	//  0x001A8
	int var_001AC;	//  0x001AC
	int var_001B0;	//  0x001B0
	int var_001B4;	//  0x001B4
	int var_001B8;	//  0x001B8
	int var_001BC;	//  0x001BC
	int var_001C0;	//  0x001C0
	int var_001C4;	//  0x001C4
	int var_001C8;	//  0x001C8
	int var_001CC;	//  0x001CC
	int var_001D0;	//  0x001D0
	int var_001D4;	//  0x001D4
	int var_001D8;	//  0x001D8
	int var_001DC;	//  0x001DC
	int var_001E0;	//  0x001E0
	int var_001E4;	//  0x001E4
	int var_001E8;	//  0x001E8
	int var_001EC;	//  0x001EC
	int var_001F0;	//  0x001F0
	int var_001F4;	//  0x001F4
	int var_001F8;	//  0x001F8
	int var_001FC;	//  0x001FC
	int var_00200;	//  0x00200
	int var_00204;	//  0x00204
	int var_00208;	//  0x00208
	int var_0020C;	//  0x0020C
	int var_00210;	//  0x00210
	int var_00214;	//  0x00214
	int var_00218;	//  0x00218
	int var_0021C;	//  0x0021C
	int var_00220;	//  0x00220
	int var_00224;	//  0x00224
	int var_00228;	//  0x00228
	int var_0022C;	//  0x0022C
	int var_00230;	//  0x00230
	int var_00234;	//  0x00234
	int var_00238;	//  0x00238
	int var_0023C;	//  0x0023C
	int var_00240;	//  0x00240
	int var_00244;	//  0x00244
	int var_00248;	//  0x00248
	int var_0024C;	//  0x0024C
	int var_00250;	//  0x00250
	int var_00254;	//  0x00254
	int var_00258;	//  0x00258
	int var_0025C;	//  0x0025C
	int var_00260;	//  0x00260
	int var_00264;	//  0x00264
	int var_00268;	//  0x00268
	int var_0026C;	//  0x0026C
	int var_00270;	//  0x00270
	int var_00274;	//  0x00274
	int var_00278;	//  0x00278
	int var_0027C;	//  0x0027C
	int var_00280;	//  0x00280
	int var_00284;	//  0x00284
	int var_00288;	//  0x00288
	int var_0028C;	//  0x0028C
	int var_00290;	//  0x00290
	int var_00294;	//  0x00294
	int var_00298;	//  0x00298
	int var_0029C;	//  0x0029C
	int var_002A0;	//  0x002A0
	int var_002A4;	//  0x002A4
	int var_002A8;	//  0x002A8
	int var_002AC;	//  0x002AC
	int var_002B0;	//  0x002B0
	int var_002B4;	//  0x002B4
	int var_002B8;	//  0x002B8
	int var_002BC;	//  0x002BC
	int var_002C0;	//  0x002C0
	int var_002C4;	//  0x002C4
	int var_002C8;	//  0x002C8
	int var_002CC;	//  0x002CC
	int var_002D0;	//  0x002D0
	int var_002D4;	//  0x002D4
	int var_002D8;	//  0x002D8
	int var_002DC;	//  0x002DC
	int var_002E0;	//  0x002E0
	eUserActType actionType;	//  0x002E4 
	int var_002E8;	//  0x002E8
	int var_002EC;	//  0x002EC
	int var_002F0;	//  0x002F0
	int var_002F4;	//  0x002F4
	int var_002F8;	//  0x002F8
	int var_002FC;	//  0x002FC
	int var_00300;	//  0x00300
	int var_00304;	//  0x00304
	int var_00308;	//  0x00308
	int var_0030C;	//  0x0030C
	int var_00310;	//  0x00310
	int var_00314;	//  0x00314
	int var_00318;	//  0x00318
	int var_0031C;	//  0x0031C
	int var_00320;	//  0x00320
	int var_00324;	//  0x00324
	int var_00328;	//  0x00328
	int var_0032C;	//  0x0032C
	int var_00330;	//  0x00330
	int var_00334;	//  0x00334
	int var_00338;	//  0x00338
	int var_0033C;	//  0x0033C
	int var_00340;	//  0x00340
	int var_00344;	//  0x00344
	int var_00348;	//  0x00348
	int var_0034C;	//  0x0034C
	int var_00350;	//  0x00350
	int var_00354;	//  0x00354
	int var_00358;	//  0x00358
	int var_0035C;	//  0x0035C
	int var_00360;	//  0x00360
	int var_00364;	//  0x00364
	int var_00368;	//  0x00368
	int var_0036C;	//  0x0036C
	int var_00370;	//  0x00370
	int var_00374;	//  0x00374
	int var_00378;	//  0x00378
	int var_0037C;	//  0x0037C
	int var_00380;	//  0x00380
	int var_00384;	//  0x00384
	int var_00388;	//  0x00388
	int var_0038C;	//  0x0038C
	int var_00390;	//  0x00390
	int characterIdx;	//  0x00394
	int var_00398;	//  0x00398
	int var_0039C;	//  0x0039C
	int var_003A0;	//  0x003A0
	int var_003A4;	//  0x003A4
	int var_003A8;	//  0x003A8
	int var_003AC;	//  0x003AC
	int var_003B0;	//  0x003B0
	int var_003B4;	//  0x003B4
	int var_003B8;	//  0x003B8
	int var_003BC;	//  0x003BC
	int var_003C0;	//  0x003C0
	int var_003C4;	//  0x003C4
	int var_003C8;	//  0x003C8
	int var_003CC;	//  0x003CC
	int var_003D0;	//  0x003D0
	int var_003D4;	//  0x003D4
	int var_003D8;	//  0x003D8
	int var_003DC;	//  0x003DC
	int var_003E0;	//  0x003E0
	int var_003E4;	//  0x003E4
	int var_003E8;	//  0x003E8
	int var_003EC;	//  0x003EC
	int var_003F0;	//  0x003F0
	int var_003F4;	//  0x003F4
	int var_003F8;	//  0x003F8
	int var_003FC;	//  0x003FC
	int var_00400;	//  0x00400
	int var_00404;	//  0x00404
	int var_00408;	//  0x00408
	int var_0040C;	//  0x0040C
	int var_00410;	//  0x00410
	int var_00414;	//  0x00414
	int var_00418;	//  0x00418
	int var_0041C;	//  0x0041C
	int var_00420;	//  0x00420
	int var_00424;	//  0x00424
	int var_00428;	//  0x00428
	int var_0042C;	//  0x0042C
	int var_00430;	//  0x00430
	int var_00434;	//  0x00434
	int var_00438;	//  0x00438
	int var_0043C;	//  0x0043C
	int var_00440;	//  0x00440
	int var_00444;	//  0x00444
	int var_00448;	//  0x00448
	int var_0044C;	//  0x0044C
	int var_00450;	//  0x00450
	int var_00454;	//  0x00454
	int var_00458;	//  0x00458
	int var_0045C;	//  0x0045C
	int var_00460;	//  0x00460
	int var_00464;	//  0x00464
	int var_00468;	//  0x00468
	int var_0046C;	//  0x0046C
	int var_00470;	//  0x00470
	int var_00474;	//  0x00474
	int var_00478;	//  0x00478
	int isAttacking;	//  0x0047C
	int var_00480;	//  0x00480
	int var_00484;	//  0x00484
	int var_00488;	//  0x00488
	int var_0048C;	//  0x0048C
	int var_00490;	//  0x00490
	int var_00494;	//  0x00494
	int var_00498;	//  0x00498
	int var_0049C;	//  0x0049C
	int var_004A0;	//  0x004A0
	int iNation;	//  0x004A4
	int var_004A8;	//  0x004A8
	int var_004AC;	//  0x004AC
	int var_004B0;	//  0x004B0
	int var_004B4;	//  0x004B4
	int var_004B8;	//  0x004B8
	int var_004BC;	//  0x004BC
	int var_004C0;	//  0x004C0
	int var_004C4;	//  0x004C4
	int var_004C8;	//  0x004C8
	int var_004CC;	//  0x004CC
	int var_004D0;	//  0x004D0
	int var_004D4;	//  0x004D4
	int var_004D8;	//  0x004D8
	int var_004DC;	//  0x004DC
	int var_004E0;	//  0x004E0
	int var_004E4;	//  0x004E4
	int var_004E8;	//  0x004E8
	int var_004EC;	//  0x004EC
	int var_004F0;	//  0x004F0
	int var_004F4;	//  0x004F4
	int var_004F8;	//  0x004F8
	int var_004FC;	//  0x004FC
	int var_00500;	//  0x00500
	int var_00504;	//  0x00504
	int var_00508;	//  0x00508
	int var_0050C;	//  0x0050C
	int var_00510;	//  0x00510
	int var_00514;	//  0x00514
	int var_00518;	//  0x00518
	int var_0051C;	//  0x0051C
	int var_00520;	//  0x00520
	int var_00524;	//  0x00524
	int var_00528;	//  0x00528
	int var_0052C;	//  0x0052C
	int var_00530;	//  0x00530
	int var_00534;	//  0x00534
	int var_00538;	//  0x00538
	int var_0053C;	//  0x0053C
	int var_00540;	//  0x00540
	int var_00544;	//  0x00544
	int var_00548;	//  0x00548
	int var_0054C;	//  0x0054C
	int var_00550;	//  0x00550
	int var_00554;	//  0x00554
	int var_00558;	//  0x00558
	int var_0055C;	//  0x0055C
	int var_00560;	//  0x00560
	int var_00564;	//  0x00564
	int var_00568;	//  0x00568
	int var_0056C;	//  0x0056C
	int var_00570;	//  0x00570
	int var_00574;	//  0x00574
	int var_00578;	//  0x00578
	int var_0057C;	//  0x0057C
	int var_00580;	//  0x00580
	int var_00584;	//  0x00584
	int var_00588;	//  0x00588
	int var_0058C;	//  0x0058C
	int var_00590;	//  0x00590
	int var_00594;	//  0x00594
	int var_00598;	//  0x00598
	int var_0059C;	//  0x0059C
	int var_005A0;	//  0x005A0
	int var_005A4;	//  0x005A4
	int var_005A8;	//  0x005A8
	int var_005AC;	//  0x005AC
	int var_005B0;	//  0x005B0
	int var_005B4;	//  0x005B4
	int var_005B8;	//  0x005B8
	int var_005BC;	//  0x005BC
	int var_005C0;	//  0x005C0
	int var_005C4;	//  0x005C4
	int var_005C8;	//  0x005C8
	int var_005CC;	//  0x005CC
	int var_005D0;	//  0x005D0
	int var_005D4;	//  0x005D4
	int var_005D8;	//  0x005D8
	int var_005DC;	//  0x005DC
	int var_005E0;	//  0x005E0
	int var_005E4;	//  0x005E4
	int var_005E8;	//  0x005E8
	int var_005EC;	//  0x005EC
	int var_005F0;	//  0x005F0
	int var_005F4;	//  0x005F4
	int var_005F8;	//  0x005F8
	int var_005FC;	//  0x005FC
	int var_00600;	//  0x00600
	int var_00604;	//  0x00604
	int var_00608;	//  0x00608
	int var_0060C;	//  0x0060C
	int var_00610;	//  0x00610
	int var_00614;	//  0x00614
	int var_00618;	//  0x00618
	int var_0061C;	//  0x0061C
	int var_00620;	//  0x00620
	int var_00624;	//  0x00624
	int var_00628;	//  0x00628
	int var_0062C;	//  0x0062C
	int var_00630;	//  0x00630
	int var_00634;	//  0x00634
	int var_00638;	//  0x00638
	int var_0063C;	//  0x0063C
	int var_00640;	//  0x00640
	int var_00644;	//  0x00644
	int var_00648;	//  0x00648
	int var_0064C;	//  0x0064C
	int var_00650;	//  0x00650
	int var_00654;	//  0x00654
	int var_00658;	//  0x00658
	int var_0065C;	//  0x0065C
	int var_00660;	//  0x00660
	int var_00664;	//  0x00664
	int var_00668;	//  0x00668
	int var_0066C;	//  0x0066C
	int var_00670;	//  0x00670
	int var_00674;	//  0x00674
	int var_00678;	//  0x00678
	int var_0067C;	//  0x0067C
	int var_00680;	//  0x00680
	int var_00684;	//  0x00684
	int var_00688;	//  0x00688
	int var_0068C;	//  0x0068C
	int var_00690;	//  0x00690
	int var_00694;	//  0x00694
	int var_00698;	//  0x00698
	int var_0069C;	//  0x0069C
	int var_006A0;	//  0x006A0
	int var_006A4;	//  0x006A4
	int var_006A8;	//  0x006A8
	int var_006AC;	//  0x006AC
	int var_006B0;	//  0x006B0
	int var_006B4;	//  0x006B4
	int var_006B8;	//  0x006B8
	int var_006BC;	//  0x006BC
	int var_006C0;	//  0x006C0
	int var_006C4;	//  0x006C4
	int var_006C8;	//  0x006C8
	int var_006CC;	//  0x006CC
	int var_006D0;	//  0x006D0
	int var_006D4;	//  0x006D4
	int var_006D8;	//  0x006D8
	int var_006DC;	//  0x006DC
	int var_006E0;	//  0x006E0
	int var_006E4;	//  0x006E4
	int var_006E8;	//  0x006E8
	int var_006EC;	//  0x006EC
	int var_006F0;	//  0x006F0
	int var_006F4;	//  0x006F4
	int var_006F8;	//  0x006F8
	int var_006FC;	//  0x006FC
	int var_00700;	//  0x00700
	int var_00704;	//  0x00704
	int var_00708;	//  0x00708
	int var_0070C;	//  0x0070C
	int var_00710;	//  0x00710
	int var_00714;	//  0x00714
	int var_00718;	//  0x00718
	int var_0071C;	//  0x0071C
	int var_00720;	//  0x00720
	int var_00724;	//  0x00724
	int var_00728;	//  0x00728
	int var_0072C;	//  0x0072C
	int var_00730;	//  0x00730
	int var_00734;	//  0x00734
	int var_00738;	//  0x00738
	int var_0073C;	//  0x0073C
	int var_00740;	//  0x00740
	int var_00744;	//  0x00744
	int var_00748;	//  0x00748
	int var_0074C;	//  0x0074C
	int var_00750;	//  0x00750
	int var_00754;	//  0x00754
	int var_00758;	//  0x00758
	int var_0075C;	//  0x0075C
	int var_00760;	//  0x00760
	int var_00764;	//  0x00764
	int var_00768;	//  0x00768
	int var_0076C;	//  0x0076C
	int var_00770;	//  0x00770
	int var_00774;	//  0x00774
	int var_00778;	//  0x00778
	int var_0077C;	//  0x0077C
	int var_00780;	//  0x00780
	int var_00784;	//  0x00784
	int var_00788;	//  0x00788
	int var_0078C;	//  0x0078C
	int var_00790;	//  0x00790
	int var_00794;	//  0x00794
	int var_00798;	//  0x00798
	int var_0079C;	//  0x0079C
	int var_007A0;	//  0x007A0
	int var_007A4;	//  0x007A4
	int var_007A8;	//  0x007A8
	int var_007AC;	//  0x007AC
	int var_007B0;	//  0x007B0
	int var_007B4;	//  0x007B4
	int var_007B8;	//  0x007B8
	int var_007BC;	//  0x007BC
	int var_007C0;	//  0x007C0
	int var_007C4;	//  0x007C4
	int var_007C8;	//  0x007C8
	int var_007CC;	//  0x007CC
	int var_007D0;	//  0x007D0
	int var_007D4;	//  0x007D4
	int var_007D8;	//  0x007D8
	int var_007DC;	//  0x007DC
	int var_007E0;	//  0x007E0
	int var_007E4;	//  0x007E4
	int var_007E8;	//  0x007E8
	int var_007EC;	//  0x007EC
	int var_007F0;	//  0x007F0
	int var_007F4;	//  0x007F4
	int var_007F8;	//  0x007F8
	int var_007FC;	//  0x007FC
	int var_00800;	//  0x00800
	int var_00804;	//  0x00804
	int var_00808;	//  0x00808
	int var_0080C;	//  0x0080C
	int var_00810;	//  0x00810
	int var_00814;	//  0x00814
	int var_00818;	//  0x00818
	int var_0081C;	//  0x0081C
	int var_00820;	//  0x00820
	int var_00824;	//  0x00824
	int var_00828;	//  0x00828
	int var_0082C;	//  0x0082C
	int var_00830;	//  0x00830
	int var_00834;	//  0x00834
	int var_00838;	//  0x00838
	int var_0083C;	//  0x0083C
	int var_00840;	//  0x00840
	int var_00844;	//  0x00844
	int var_00848;	//  0x00848
	int var_0084C;	//  0x0084C
	int var_00850;	//  0x00850
	int var_00854;	//  0x00854
	int var_00858;	//  0x00858
	int var_0085C;	//  0x0085C
	int var_00860;	//  0x00860
	int var_00864;	//  0x00864
	int var_00868;	//  0x00868
	int var_0086C;	//  0x0086C
	int var_00870;	//  0x00870
	int var_00874;	//  0x00874
	int var_00878;	//  0x00878
	int var_0087C;	//  0x0087C
	int var_00880;	//  0x00880
	int var_00884;	//  0x00884
	int var_00888;	//  0x00888
	int var_0088C;	//  0x0088C
	int var_00890;	//  0x00890
	int var_00894;	//  0x00894
	int var_00898;	//  0x00898
	int var_0089C;	//  0x0089C
	int var_008A0;	//  0x008A0
	int var_008A4;	//  0x008A4
	int var_008A8;	//  0x008A8
	int var_008AC;	//  0x008AC
	int var_008B0;	//  0x008B0
	int var_008B4;	//  0x008B4
	int var_008B8;	//  0x008B8
	int var_008BC;	//  0x008BC
	int var_008C0;	//  0x008C0
	int var_008C4;	//  0x008C4
	int var_008C8;	//  0x008C8
	int var_008CC;	//  0x008CC
	int var_008D0;	//  0x008D0
	int var_008D4;	//  0x008D4
	int var_008D8;	//  0x008D8
	int var_008DC;	//  0x008DC
	int var_008E0;	//  0x008E0
	int var_008E4;	//  0x008E4
	int var_008E8;	//  0x008E8
	int var_008EC;	//  0x008EC
	int var_008F0;	//  0x008F0
	int var_008F4;	//  0x008F4
	int var_008F8;	//  0x008F8
	int var_008FC;	//  0x008FC
	int var_00900;	//  0x00900
	int var_00904;	//  0x00904
	int var_00908;	//  0x00908
	int var_0090C;	//  0x0090C
	int var_00910;	//  0x00910
	int var_00914;	//  0x00914
	int var_00918;	//  0x00918
	int var_0091C;	//  0x0091C
	int var_00920;	//  0x00920
	int var_00924;	//  0x00924
	int var_00928;	//  0x00928
	int var_0092C;	//  0x0092C
	int var_00930;	//  0x00930
	int var_00934;	//  0x00934
	int var_00938;	//  0x00938
	int var_0093C;	//  0x0093C
	int var_00940;	//  0x00940
	int var_00944;	//  0x00944
	int var_00948;	//  0x00948
	int var_0094C;	//  0x0094C
	int var_00950;	//  0x00950
	int var_00954;	//  0x00954
	int var_00958;	//  0x00958
	int var_0095C;	//  0x0095C
	int var_00960;	//  0x00960
	int var_00964;	//  0x00964
	int var_00968;	//  0x00968
	int var_0096C;	//  0x0096C
	int var_00970;	//  0x00970
	int var_00974;	//  0x00974
	int var_00978;	//  0x00978
	int var_0097C;	//  0x0097C
	int var_00980;	//  0x00980
	int var_00984;	//  0x00984
	int var_00988;	//  0x00988
	int var_0098C;	//  0x0098C
	int var_00990;	//  0x00990
	int var_00994;	//  0x00994
	int var_00998;	//  0x00998
	int var_0099C;	//  0x0099C
	int var_009A0;	//  0x009A0
	int var_009A4;	//  0x009A4
	int var_009A8;	//  0x009A8
	int var_009AC;	//  0x009AC
	int var_009B0;	//  0x009B0
	int var_009B4;	//  0x009B4
	int var_009B8;	//  0x009B8
	int var_009BC;	//  0x009BC
	int var_009C0;	//  0x009C0
	int var_009C4;	//  0x009C4
	int var_009C8;	//  0x009C8
	int var_009CC;	//  0x009CC
	int var_009D0;	//  0x009D0
	int var_009D4;	//  0x009D4
	int var_009D8;	//  0x009D8
	int var_009DC;	//  0x009DC
	int var_009E0;	//  0x009E0
	int var_009E4;	//  0x009E4
	int var_009E8;	//  0x009E8
	int var_009EC;	//  0x009EC
	int var_009F0;	//  0x009F0
	int var_009F4;	//  0x009F4
	int var_009F8;	//  0x009F8
	int var_009FC;	//  0x009FC
	int var_00A00;	//  0x00A00
	int var_00A04;	//  0x00A04
	int var_00A08;	//  0x00A08
	int var_00A0C;	//  0x00A0C
	int var_00A10;	//  0x00A10
	int var_00A14;	//  0x00A14
	int var_00A18;	//  0x00A18
	int var_00A1C;	//  0x00A1C
	int var_00A20;	//  0x00A20
	int var_00A24;	//  0x00A24
	int var_00A28;	//  0x00A28
	int var_00A2C;	//  0x00A2C
	int var_00A30;	//  0x00A30
	int var_00A34;	//  0x00A34
	int var_00A38;	//  0x00A38
	int var_00A3C;	//  0x00A3C
	int var_00A40;	//  0x00A40
	int var_00A44;	//  0x00A44
	int var_00A48;	//  0x00A48
	int var_00A4C;	//  0x00A4C
	int var_00A50;	//  0x00A50
	int var_00A54;	//  0x00A54
	int var_00A58;	//  0x00A58
	int var_00A5C;	//  0x00A5C
	int var_00A60;	//  0x00A60
	int var_00A64;	//  0x00A64
	int var_00A68;	//  0x00A68
	int var_00A6C;	//  0x00A6C
	int var_00A70;	//  0x00A70
	int var_00A74;	//  0x00A74
	int var_00A78;	//  0x00A78
	int var_00A7C;	//  0x00A7C
	int var_00A80;	//  0x00A80
	int var_00A84;	//  0x00A84
	int var_00A88;	//  0x00A88
	int var_00A8C;	//  0x00A8C
	int var_00A90;	//  0x00A90
	int var_00A94;	//  0x00A94
	int var_00A98;	//  0x00A98
	int var_00A9C;	//  0x00A9C
	int var_00AA0;	//  0x00AA0
	int var_00AA4;	//  0x00AA4
	int var_00AA8;	//  0x00AA8
	int var_00AAC;	//  0x00AAC
	int var_00AB0;	//  0x00AB0
	int var_00AB4;	//  0x00AB4
	int var_00AB8;	//  0x00AB8
	int var_00ABC;	//  0x00ABC
	int var_00AC0;	//  0x00AC0
	int var_00AC4;	//  0x00AC4
	int var_00AC8;	//  0x00AC8
	int var_00ACC;	//  0x00ACC
	int var_00AD0;	//  0x00AD0
	int var_00AD4;	//  0x00AD4
	int var_00AD8;	//  0x00AD8
	int var_00ADC;	//  0x00ADC
	int var_00AE0;	//  0x00AE0
	int var_00AE4;	//  0x00AE4
	int var_00AE8;	//  0x00AE8
	int var_00AEC;	//  0x00AEC
	int var_00AF0;	//  0x00AF0
	int var_00AF4;	//  0x00AF4
	int currentUsedSkill;	//  0x00AF8
	int var_00AFC;	//  0x00AFC
	int var_00B00;	//  0x00B00
	int var_00B04;	//  0x00B04
	int var_00B08;	//  0x00B08
	int var_00B0C;	//  0x00B0C
	int var_00B10;	//  0x00B10
	int var_00B14;	//  0x00B14
	int var_00B18;	//  0x00B18
	int var_00B1C;	//  0x00B1C
	int var_00B20;	//  0x00B20
	int var_00B24;	//  0x00B24
	int var_00B28;	//  0x00B28
	int var_00B2C;	//  0x00B2C
	int var_00B30;	//  0x00B30
	int var_00B34;	//  0x00B34
	int var_00B38;	//  0x00B38
	int var_00B3C;	//  0x00B3C
	int var_00B40;	//  0x00B40
	int var_00B44;	//  0x00B44
	int var_00B48;	//  0x00B48
	int var_00B4C;	//  0x00B4C
	int var_00B50;	//  0x00B50
	int var_00B54;	//  0x00B54
	int var_00B58;	//  0x00B58
	int var_00B5C;	//  0x00B5C
	int var_00B60;	//  0x00B60
	int var_00B64;	//  0x00B64
	int var_00B68;	//  0x00B68
	int var_00B6C;	//  0x00B6C
	int var_00B70;	//  0x00B70
	int var_00B74;	//  0x00B74
	int var_00B78;	//  0x00B78
	int var_00B7C;	//  0x00B7C
	int var_00B80;	//  0x00B80
	int var_00B84;	//  0x00B84
	int var_00B88;	//  0x00B88
	int var_00B8C;	//  0x00B8C
	int var_00B90;	//  0x00B90
	int var_00B94;	//  0x00B94
	int var_00B98;	//  0x00B98
	int var_00B9C;	//  0x00B9C
	int var_00BA0;	//  0x00BA0
	int var_00BA4;	//  0x00BA4
	int var_00BA8;	//  0x00BA8
	int var_00BAC;	//  0x00BAC
	int var_00BB0;	//  0x00BB0
	int var_00BB4;	//  0x00BB4
	int var_00BB8;	//  0x00BB8
	int var_00BBC;	//  0x00BBC
	int var_00BC0;	//  0x00BC0
	int var_00BC4;	//  0x00BC4
	int var_00BC8;	//  0x00BC8
	int var_00BCC;	//  0x00BCC
	int var_00BD0;	//  0x00BD0
	int var_00BD4;	//  0x00BD4
	int var_00BD8;	//  0x00BD8
	int var_00BDC;	//  0x00BDC
	int var_00BE0;	//  0x00BE0
	int var_00BE4;	//  0x00BE4
	int var_00BE8;	//  0x00BE8
	int var_00BEC;	//  0x00BEC
	int var_00BF0;	//  0x00BF0
	int var_00BF4;	//  0x00BF4
	int var_00BF8;	//  0x00BF8
	int var_00BFC;	//  0x00BFC
	int var_00C00;	//  0x00C00
	int var_00C04;	//  0x00C04
	int var_00C08;	//  0x00C08
	int var_00C0C;	//  0x00C0C
	int var_00C10;	//  0x00C10
	int var_00C14;	//  0x00C14
	int var_00C18;	//  0x00C18
	int var_00C1C;	//  0x00C1C
	int var_00C20;	//  0x00C20
	int var_00C24;	//  0x00C24
	int var_00C28;	//  0x00C28
	int var_00C2C;	//  0x00C2C
	int var_00C30;	//  0x00C30
	int var_00C34;	//  0x00C34
	int var_00C38;	//  0x00C38
	int var_00C3C;	//  0x00C3C
	int var_00C40;	//  0x00C40
	int var_00C44;	//  0x00C44
	int var_00C48;	//  0x00C48
	int var_00C4C;	//  0x00C4C
	int var_00C50;	//  0x00C50
	int var_00C54;	//  0x00C54
	int var_00C58;	//  0x00C58
	int var_00C5C;	//  0x00C5C
	int var_00C60;	//  0x00C60
	int var_00C64;	//  0x00C64
	double BattleModeComboTime;	//  0x00C68
	int var_00C70;	//  0x00C70
	int var_00C74;	//  0x00C74
	int var_00C78;	//  0x00C78
	int var_00C7C;	//  0x00C7C
	int var_00C80;	//  0x00C80
	int var_00C84;	//  0x00C84
	int var_00C88;	//  0x00C88
	int var_00C8C;	//  0x00C8C
	int var_00C90;	//  0x00C90
	int var_00C94;	//  0x00C94
	int var_00C98;	//  0x00C98
	int var_00C9C;	//  0x00C9C
	int var_00CA0;	//  0x00CA0
	int var_00CA4;	//  0x00CA4
	int var_00CA8;	//  0x00CA8
	int var_00CAC;	//  0x00CAC
	int var_00CB0;	//  0x00CB0
	int var_00CB4;	//  0x00CB4
	int var_00CB8;	//  0x00CB8
	int var_00CBC;	//  0x00CBC
	int var_00CC0;	//  0x00CC0
	int var_00CC4;	//  0x00CC4
	int var_00CC8;	//  0x00CC8
	int var_00CCC;	//  0x00CCC
	int var_00CD0;	//  0x00CD0
	int var_00CD4;	//  0x00CD4
	int var_00CD8;	//  0x00CD8
	int var_00CDC;	//  0x00CDC
	int var_00CE0;	//  0x00CE0
	int var_00CE4;	//  0x00CE4
	int var_00CE8;	//  0x00CE8
	int var_00CEC;	//  0x00CEC
	int var_00CF0;	//  0x00CF0
	int var_00CF4;	//  0x00CF4
	int var_00CF8;	//  0x00CF8
	int var_00CFC;	//  0x00CFC
	int var_00D00;	//  0x00D00
	int var_00D04;	//  0x00D04
	int var_00D08;	//  0x00D08
	int var_00D0C;	//  0x00D0C
	int var_00D10;	//  0x00D10
	int var_00D14;	//  0x00D14
	int var_00D18;	//  0x00D18
	int var_00D1C;	//  0x00D1C
	int var_00D20;	//  0x00D20
	int var_00D24;	//  0x00D24
	int var_00D28;	//  0x00D28
	int var_00D2C;	//  0x00D2C
	int var_00D30;	//  0x00D30
	int var_00D34;	//  0x00D34
	int var_00D38;	//  0x00D38
	int var_00D3C;	//  0x00D3C
	int var_00D40;	//  0x00D40
	int var_00D44;	//  0x00D44
	int var_00D48;	//  0x00D48
	int var_00D4C;	//  0x00D4C
	int var_00D50;	//  0x00D50
	int var_00D54;	//  0x00D54
	int var_00D58;	//  0x00D58
	int var_00D5C;	//  0x00D5C
	int var_00D60;	//  0x00D60
	int var_00D64;	//  0x00D64
	int var_00D68;	//  0x00D68
	int var_00D6C;	//  0x00D6C
	int var_00D70;	//  0x00D70
	int var_00D74;	//  0x00D74
	int var_00D78;	//  0x00D78
	int var_00D7C;	//  0x00D7C
	int var_00D80;	//  0x00D80
	int var_00D84;	//  0x00D84
	int var_00D88;	//  0x00D88
	int var_00D8C;	//  0x00D8C
	int var_00D90;	//  0x00D90
	int var_00D94;	//  0x00D94
	int var_00D98;	//  0x00D98
	int var_00D9C;	//  0x00D9C
	int var_00DA0;	//  0x00DA0
	int var_00DA4;	//  0x00DA4
	int var_00DA8;	//  0x00DA8
	int var_00DAC;	//  0x00DAC
	int var_00DB0;	//  0x00DB0
	int var_00DB4;	//  0x00DB4
	int var_00DB8;	//  0x00DB8
	int var_00DBC;	//  0x00DBC
	int var_00DC0;	//  0x00DC0
	int var_00DC4;	//  0x00DC4
	int var_00DC8;	//  0x00DC8
	int var_00DCC;	//  0x00DCC
	int var_00DD0;	//  0x00DD0
	int var_00DD4;	//  0x00DD4
	int var_00DD8;	//  0x00DD8
	int var_00DDC;	//  0x00DDC
	int var_00DE0;	//  0x00DE0
	int var_00DE4;	//  0x00DE4
	int var_00DE8;	//  0x00DE8
	int var_00DEC;	//  0x00DEC
	int var_00DF0;	//  0x00DF0
	int var_00DF4;	//  0x00DF4
	int var_00DF8;	//  0x00DF8
	int var_00DFC;	//  0x00DFC
	int var_00E00;	//  0x00E00
	int var_00E04;	//  0x00E04
	int var_00E08;	//  0x00E08
	int var_00E0C;	//  0x00E0C
	int var_00E10;	//  0x00E10
	int var_00E14;	//  0x00E14
	int var_00E18;	//  0x00E18
	int var_00E1C;	//  0x00E1C
	int var_00E20;	//  0x00E20
	int var_00E24;	//  0x00E24
	int var_00E28;	//  0x00E28
	int var_00E2C;	//  0x00E2C
	int var_00E30;	//  0x00E30
	int var_00E34;	//  0x00E34
	int var_00E38;	//  0x00E38
	int var_00E3C;	//  0x00E3C
	int var_00E40;	//  0x00E40
	int var_00E44;	//  0x00E44
	int var_00E48;	//  0x00E48
	int var_00E4C;	//  0x00E4C
	int var_00E50;	//  0x00E50
	int var_00E54;	//  0x00E54
	int var_00E58;	//  0x00E58
	int var_00E5C;	//  0x00E5C
	int var_00E60;	//  0x00E60
	int var_00E64;	//  0x00E64
	int var_00E68;	//  0x00E68
	int var_00E6C;	//  0x00E6C
	int var_00E70;	//  0x00E70
	int var_00E74;	//  0x00E74
	int var_00E78;	//  0x00E78
	int var_00E7C;	//  0x00E7C
	int var_00E80;	//  0x00E80
	int var_00E84;	//  0x00E84
	int var_00E88;	//  0x00E88
	int var_00E8C;	//  0x00E8C
	int var_00E90;	//  0x00E90
	int var_00E94;	//  0x00E94
	int var_00E98;	//  0x00E98
	int var_00E9C;	//  0x00E9C
	int var_00EA0;	//  0x00EA0
	int var_00EA4;	//  0x00EA4
	int var_00EA8;	//  0x00EA8
	int var_00EAC;	//  0x00EAC
	int var_00EB0;	//  0x00EB0
	int var_00EB4;	//  0x00EB4
	int var_00EB8;	//  0x00EB8
	int var_00EBC;	//  0x00EBC
	int var_00EC0;	//  0x00EC0
	int var_00EC4;	//  0x00EC4
	int var_00EC8;	//  0x00EC8
	int var_00ECC;	//  0x00ECC
	int var_00ED0;	//  0x00ED0
	int var_00ED4;	//  0x00ED4
	int var_00ED8;	//  0x00ED8
	int var_00EDC;	//  0x00EDC
	int var_00EE0;	//  0x00EE0
	int var_00EE4;	//  0x00EE4
	int var_00EE8;	//  0x00EE8
	int var_00EEC;	//  0x00EEC
	int var_00EF0;	//  0x00EF0
	int var_00EF4;	//  0x00EF4
	int var_00EF8;	//  0x00EF8
	int var_00EFC;	//  0x00EFC
	int var_00F00;	//  0x00F00
	int var_00F04;	//  0x00F04
	int var_00F08;	//  0x00F08
	int var_00F0C;	//  0x00F0C
	int var_00F10;	//  0x00F10
	int var_00F14;	//  0x00F14
	int var_00F18;	//  0x00F18
	int var_00F1C;	//  0x00F1C
	int var_00F20;	//  0x00F20
	int var_00F24;	//  0x00F24
	int var_00F28;	//  0x00F28
	int var_00F2C;	//  0x00F2C
	int var_00F30;	//  0x00F30
	int var_00F34;	//  0x00F34
	int var_00F38;	//  0x00F38
	int var_00F3C;	//  0x00F3C
	int var_00F40;	//  0x00F40
	int var_00F44;	//  0x00F44
	int var_00F48;	//  0x00F48
	int var_00F4C;	//  0x00F4C
	int var_00F50;	//  0x00F50
	int var_00F54;	//  0x00F54
	int var_00F58;	//  0x00F58
	int var_00F5C;	//  0x00F5C
	int var_00F60;	//  0x00F60
	int var_00F64;	//  0x00F64
	int var_00F68;	//  0x00F68
	int var_00F6C;	//  0x00F6C
	int var_00F70;	//  0x00F70
	int var_00F74;	//  0x00F74
	int var_00F78;	//  0x00F78
	int var_00F7C;	//  0x00F7C
	int var_00F80;	//  0x00F80
	int var_00F84;	//  0x00F84
	int var_00F88;	//  0x00F88
	int var_00F8C;	//  0x00F8C
	int var_00F90;	//  0x00F90
	int var_00F94;	//  0x00F94
	int var_00F98;	//  0x00F98
	int var_00F9C;	//  0x00F9C
	int var_00FA0;	//  0x00FA0
	int var_00FA4;	//  0x00FA4
	int var_00FA8;	//  0x00FA8
	int var_00FAC;	//  0x00FAC
	int var_00FB0;	//  0x00FB0
	int var_00FB4;	//  0x00FB4
	int var_00FB8;	//  0x00FB8
	int var_00FBC;	//  0x00FBC
	int var_00FC0;	//  0x00FC0
	int var_00FC4;	//  0x00FC4
	int var_00FC8;	//  0x00FC8
	int var_00FCC;	//  0x00FCC
	int var_00FD0;	//  0x00FD0
	int var_00FD4;	//  0x00FD4
	int var_00FD8;	//  0x00FD8
	int var_00FDC;	//  0x00FDC
	int var_00FE0;	//  0x00FE0
	int var_00FE4;	//  0x00FE4
	int var_00FE8;	//  0x00FE8
	int var_00FEC;	//  0x00FEC
	int var_00FF0;	//  0x00FF0
	int var_00FF4;	//  0x00FF4
	int var_00FF8;	//  0x00FF8
	int var_00FFC;	//  0x00FFC
	int var_01000;	//  0x01000
	int var_01004;	//  0x01004
	int var_01008;	//  0x01008
	int var_0100C;	//  0x0100C
	int var_01010;	//  0x01010
	int var_01014;	//  0x01014
	int var_01018;	//  0x01018
	int var_0101C;	//  0x0101C
	int var_01020;	//  0x01020
	int var_01024;	//  0x01024
	int var_01028;	//  0x01028
	int var_0102C;	//  0x0102C
	int var_01030;	//  0x01030
	int var_01034;	//  0x01034
	int var_01038;	//  0x01038
	int var_0103C;	//  0x0103C
	int var_01040;	//  0x01040
	int var_01044;	//  0x01044
	int var_01048;	//  0x01048
	int var_0104C;	//  0x0104C
	int var_01050;	//  0x01050
	int var_01054;	//  0x01054
	int var_01058;	//  0x01058
	int var_0105C;	//  0x0105C
	int var_01060;	//  0x01060
	int var_01064;	//  0x01064
	int var_01068;	//  0x01068
	int var_0106C;	//  0x0106C
	int var_01070;	//  0x01070
	int var_01074;	//  0x01074
	int var_01078;	//  0x01078
	int var_0107C;	//  0x0107C
	int var_01080;	//  0x01080
	int var_01084;	//  0x01084
	int var_01088;	//  0x01088
	int var_0108C;	//  0x0108C
	int var_01090;	//  0x01090
	int var_01094;	//  0x01094
	int var_01098;	//  0x01098
	int var_0109C;	//  0x0109C
	int var_010A0;	//  0x010A0
	int var_010A4;	//  0x010A4
	int var_010A8;	//  0x010A8
	int var_010AC;	//  0x010AC
	int var_010B0;	//  0x010B0
	int var_010B4;	//  0x010B4
	int var_010B8;	//  0x010B8
	int var_010BC;	//  0x010BC
	int var_010C0;	//  0x010C0
	int var_010C4;	//  0x010C4
	int var_010C8;	//  0x010C8
	int var_010CC;	//  0x010CC
	int var_010D0;	//  0x010D0
	int var_010D4;	//  0x010D4
	int var_010D8;	//  0x010D8
	int var_010DC;	//  0x010DC
	int var_010E0;	//  0x010E0
	int var_010E4;	//  0x010E4
	int var_010E8;	//  0x010E8
	int var_010EC;	//  0x010EC
	int var_010F0;	//  0x010F0
	int var_010F4;	//  0x010F4
	int var_010F8;	//  0x010F8
	int var_010FC;	//  0x010FC
	double skillNextTime;	//  0x01100
	int var_01108;	//  0x01108
	int var_0110C;	//  0x0110C
	int var_01110;	//  0x01110
	int var_01114;	//  0x01114
	int var_01118;	//  0x01118
	int var_0111C;	//  0x0111C
	int var_01120;	//  0x01120
	int var_01124;	//  0x01124
	int var_01128;	//  0x01128
	int var_0112C;	//  0x0112C
	int var_01130;	//  0x01130
	int var_01134;	//  0x01134
	int var_01138;	//  0x01138
	int var_0113C;	//  0x0113C
	int var_01140;	//  0x01140
	int var_01144;	//  0x01144
	int var_01148;	//  0x01148
	int var_0114C;	//  0x0114C
	int var_01150;	//  0x01150
	int var_01154;	//  0x01154
	int var_01158;	//  0x01158
	int var_0115C;	//  0x0115C
	int var_01160;	//  0x01160
	int var_01164;	//  0x01164
	int var_01168;	//  0x01168
	int var_0116C;	//  0x0116C
	int var_01170;	//  0x01170
	int var_01174;	//  0x01174
	int var_01178;	//  0x01178
	int var_0117C;	//  0x0117C
	int var_01180;	//  0x01180
	int var_01184;	//  0x01184
	int var_01188;	//  0x01188
	int var_0118C;	//  0x0118C
	int var_01190;	//  0x01190
	int var_01194;	//  0x01194
	int var_01198;	//  0x01198
	int var_0119C;	//  0x0119C
	int var_011A0;	//  0x011A0
	int var_011A4;	//  0x011A4
	int var_011A8;	//  0x011A8
	int var_011AC;	//  0x011AC
	int var_011B0;	//  0x011B0
	int var_011B4;	//  0x011B4
	int var_011B8;	//  0x011B8
	int var_011BC;	//  0x011BC
	int var_011C0;	//  0x011C0
	int var_011C4;	//  0x011C4
	int var_011C8;	//  0x011C8
	int var_011CC;	//  0x011CC
	int var_011D0;	//  0x011D0
	int var_011D4;	//  0x011D4
	int var_011D8;	//  0x011D8
	int var_011DC;	//  0x011DC
	int var_011E0;	//  0x011E0
	int var_011E4;	//  0x011E4
	int var_011E8;	//  0x011E8
	int var_011EC;	//  0x011EC
	int var_011F0;	//  0x011F0
	int var_011F4;	//  0x011F4
	int var_011F8;	//  0x011F8
	int var_011FC;	//  0x011FC
	int var_01200;	//  0x01200
	int var_01204;	//  0x01204
	int var_01208;	//  0x01208
	int var_0120C;	//  0x0120C
	int var_01210;	//  0x01210
	int var_01214;	//  0x01214
	int var_01218;	//  0x01218
	int var_0121C;	//  0x0121C
	int var_01220;	//  0x01220
	int var_01224;	//  0x01224
	int var_01228;	//  0x01228
	int var_0122C;	//  0x0122C
	int var_01230;	//  0x01230
	int var_01234;	//  0x01234
	int var_01238;	//  0x01238
	int var_0123C;	//  0x0123C
	int var_01240;	//  0x01240
	int var_01244;	//  0x01244
	int var_01248;	//  0x01248
	int var_0124C;	//  0x0124C
	int var_01250;	//  0x01250
	int var_01254;	//  0x01254
	int var_01258;	//  0x01258
	int var_0125C;	//  0x0125C
	int var_01260;	//  0x01260
	int var_01264;	//  0x01264
	int var_01268;	//  0x01268
	int var_0126C;	//  0x0126C
	int var_01270;	//  0x01270
	int var_01274;	//  0x01274
	int var_01278;	//  0x01278
	int var_0127C;	//  0x0127C
	int var_01280;	//  0x01280
	int var_01284;	//  0x01284
	int var_01288;	//  0x01288
	int var_0128C;	//  0x0128C
	int var_01290;	//  0x01290
	int var_01294;	//  0x01294
	int var_01298;	//  0x01298
	int var_0129C;	//  0x0129C
	int var_012A0;	//  0x012A0
	int var_012A4;	//  0x012A4
	int var_012A8;	//  0x012A8
	int var_012AC;	//  0x012AC
	int var_012B0;	//  0x012B0
	int var_012B4;	//  0x012B4
	int var_012B8;	//  0x012B8
	int var_012BC;	//  0x012BC
	int var_012C0;	//  0x012C0
	int var_012C4;	//  0x012C4
	int var_012C8;	//  0x012C8
	int var_012CC;	//  0x012CC
	int var_012D0;	//  0x012D0
	int var_012D4;	//  0x012D4
	int var_012D8;	//  0x012D8
	int var_012DC;	//  0x012DC
	int var_012E0;	//  0x012E0
	int var_012E4;	//  0x012E4
	int var_012E8;	//  0x012E8
	int var_012EC;	//  0x012EC
	int var_012F0;	//  0x012F0
	int var_012F4;	//  0x012F4
	int var_012F8;	//  0x012F8
	int var_012FC;	//  0x012FC
	int var_01300;	//  0x01300
	int var_01304;	//  0x01304
	int var_01308;	//  0x01308
	int var_0130C;	//  0x0130C
	int var_01310;	//  0x01310
	int var_01314;	//  0x01314
	int var_01318;	//  0x01318
	int var_0131C;	//  0x0131C
	int var_01320;	//  0x01320
	int var_01324;	//  0x01324
	int var_01328;	//  0x01328
	int var_0132C;	//  0x0132C
	int var_01330;	//  0x01330
	int var_01334;	//  0x01334
	int var_01338;	//  0x01338
	int var_0133C;	//  0x0133C
	int var_01340;	//  0x01340
	int var_01344;	//  0x01344
	int var_01348;	//  0x01348
	int var_0134C;	//  0x0134C
	int var_01350;	//  0x01350
	int var_01354;	//  0x01354
	int var_01358;	//  0x01358
	int var_0135C;	//  0x0135C
	int var_01360;	//  0x01360
	int var_01364;	//  0x01364
	int var_01368;	//  0x01368
	int var_0136C;	//  0x0136C
	int var_01370;	//  0x01370
	int var_01374;	//  0x01374
	int var_01378;	//  0x01378
	int var_0137C;	//  0x0137C
	int var_01380;	//  0x01380
	int var_01384;	//  0x01384
	int var_01388;	//  0x01388
	int var_0138C;	//  0x0138C
	int var_01390;	//  0x01390
	int var_01394;	//  0x01394
	int var_01398;	//  0x01398
	int var_0139C;	//  0x0139C
	int var_013A0;	//  0x013A0
	int var_013A4;	//  0x013A4
	int var_013A8;	//  0x013A8
	int var_013AC;	//  0x013AC
	int var_013B0;	//  0x013B0
	int var_013B4;	//  0x013B4
	int var_013B8;	//  0x013B8
	int var_013BC;	//  0x013BC
	int var_013C0;	//  0x013C0
	int var_013C4;	//  0x013C4
	int var_013C8;	//  0x013C8
	int var_013CC;	//  0x013CC
	int var_013D0;	//  0x013D0
	int var_013D4;	//  0x013D4
	int var_013D8;	//  0x013D8
	int var_013DC;	//  0x013DC
	int var_013E0;	//  0x013E0
	int var_013E4;	//  0x013E4
	int var_013E8;	//  0x013E8
	int var_013EC;	//  0x013EC
	int var_013F0;	//  0x013F0
	int var_013F4;	//  0x013F4
	int var_013F8;	//  0x013F8
	int var_013FC;	//  0x013FC
	int var_01400;	//  0x01400
	int var_01404;	//  0x01404
	int var_01408;	//  0x01408
	int var_0140C;	//  0x0140C
	int var_01410;	//  0x01410
	int var_01414;	//  0x01414
	int var_01418;	//  0x01418
	int var_0141C;	//  0x0141C
	int var_01420;	//  0x01420
	int var_01424;	//  0x01424
	int var_01428;	//  0x01428
	int var_0142C;	//  0x0142C
	int var_01430;	//  0x01430
	int var_01434;	//  0x01434
	int var_01438;	//  0x01438
	int var_0143C;	//  0x0143C
	int var_01440;	//  0x01440
	int var_01444;	//  0x01444
	int var_01448;	//  0x01448
	int var_0144C;	//  0x0144C
	int var_01450;	//  0x01450
	int var_01454;	//  0x01454
	int var_01458;	//  0x01458
	int var_0145C;	//  0x0145C
	int var_01460;	//  0x01460
	int var_01464;	//  0x01464
	int var_01468;	//  0x01468
	int var_0146C;	//  0x0146C
	int var_01470;	//  0x01470
	int var_01474;	//  0x01474
	int var_01478;	//  0x01478
	int var_0147C;	//  0x0147C
	int var_01480;	//  0x01480
	int var_01484;	//  0x01484
	int var_01488;	//  0x01488
	int var_0148C;	//  0x0148C
	int var_01490;	//  0x01490
	int var_01494;	//  0x01494
	int var_01498;	//  0x01498
	int var_0149C;	//  0x0149C
	int var_014A0;	//  0x014A0
	int var_014A4;	//  0x014A4
	int var_014A8;	//  0x014A8
	int var_014AC;	//  0x014AC
	int var_014B0;	//  0x014B0
	int var_014B4;	//  0x014B4
	int var_014B8;	//  0x014B8
	int var_014BC;	//  0x014BC
	int var_014C0;	//  0x014C0
	int var_014C4;	//  0x014C4
	int var_014C8;	//  0x014C8
	int var_014CC;	//  0x014CC
	int var_014D0;	//  0x014D0
	int var_014D4;	//  0x014D4
	int var_014D8;	//  0x014D8
	int var_014DC;	//  0x014DC
	int var_014E0;	//  0x014E0
	int var_014E4;	//  0x014E4
	int var_014E8;	//  0x014E8
	int var_014EC;	//  0x014EC
	int var_014F0;	//  0x014F0
	int var_014F4;	//  0x014F4
	int var_014F8;	//  0x014F8
	int var_014FC;	//  0x014FC
	int var_01500;	//  0x01500
	int var_01504;	//  0x01504
	int var_01508;	//  0x01508
	int var_0150C;	//  0x0150C
	int var_01510;	//  0x01510
	int var_01514;	//  0x01514
	int var_01518;	//  0x01518
	int var_0151C;	//  0x0151C
	int var_01520;	//  0x01520
	int var_01524;	//  0x01524
	int var_01528;	//  0x01528
	int var_0152C;	//  0x0152C
	int var_01530;	//  0x01530
	int var_01534;	//  0x01534
	int var_01538;	//  0x01538
	int var_0153C;	//  0x0153C
	int var_01540;	//  0x01540
	int var_01544;	//  0x01544
	int var_01548;	//  0x01548
	int var_0154C;	//  0x0154C
	int var_01550;	//  0x01550
	int var_01554;	//  0x01554
	int var_01558;	//  0x01558
	int var_0155C;	//  0x0155C
	int var_01560;	//  0x01560
	int var_01564;	//  0x01564
	int var_01568;	//  0x01568
	int var_0156C;	//  0x0156C
	int var_01570;	//  0x01570
	int var_01574;	//  0x01574
	int var_01578;	//  0x01578
	int var_0157C;	//  0x0157C
	int var_01580;	//  0x01580
	int var_01584;	//  0x01584
	int var_01588;	//  0x01588
	int var_0158C;	//  0x0158C
	int var_01590;	//  0x01590
	int var_01594;	//  0x01594
	int var_01598;	//  0x01598
	int var_0159C;	//  0x0159C
	int var_015A0;	//  0x015A0
	int var_015A4;	//  0x015A4
	int var_015A8;	//  0x015A8
	int var_015AC;	//  0x015AC
	int var_015B0;	//  0x015B0
	int var_015B4;	//  0x015B4
	int var_015B8;	//  0x015B8
	int var_015BC;	//  0x015BC
	int var_015C0;	//  0x015C0
	int var_015C4;	//  0x015C4
	int var_015C8;	//  0x015C8
	int var_015CC;	//  0x015CC
	int var_015D0;	//  0x015D0
	int var_015D4;	//  0x015D4
	int var_015D8;	//  0x015D8
	int var_015DC;	//  0x015DC
	int var_015E0;	//  0x015E0
	int var_015E4;	//  0x015E4
	int var_015E8;	//  0x015E8
	int var_015EC;	//  0x015EC
	int var_015F0;	//  0x015F0
	int var_015F4;	//  0x015F4
	int var_015F8;	//  0x015F8
	int var_015FC;	//  0x015FC
	int var_01600;	//  0x01600
	int var_01604;	//  0x01604
	int var_01608;	//  0x01608
	int var_0160C;	//  0x0160C
	int var_01610;	//  0x01610
	int var_01614;	//  0x01614
	int var_01618;	//  0x01618
	int var_0161C;	//  0x0161C
	int var_01620;	//  0x01620
	int var_01624;	//  0x01624
	int var_01628;	//  0x01628
	int var_0162C;	//  0x0162C
	int var_01630;	//  0x01630
	int var_01634;	//  0x01634
	int var_01638;	//  0x01638
	int var_0163C;	//  0x0163C
	int var_01640;	//  0x01640
	int var_01644;	//  0x01644
	int var_01648;	//  0x01648
	int var_0164C;	//  0x0164C
	int var_01650;	//  0x01650
	int var_01654;	//  0x01654
	int var_01658;	//  0x01658
	int var_0165C;	//  0x0165C
	int var_01660;	//  0x01660
	int var_01664;	//  0x01664
	int var_01668;	//  0x01668
	int var_0166C;	//  0x0166C
	int var_01670;	//  0x01670
	int var_01674;	//  0x01674
	int var_01678;	//  0x01678
	int var_0167C;	//  0x0167C
	int var_01680;	//  0x01680
	int var_01684;	//  0x01684
	int var_01688;	//  0x01688
	int var_0168C;	//  0x0168C
	int var_01690;	//  0x01690
	int var_01694;	//  0x01694
	int var_01698;	//  0x01698
	int var_0169C;	//  0x0169C
	int var_016A0;	//  0x016A0
	int var_016A4;	//  0x016A4
	int var_016A8;	//  0x016A8
	int var_016AC;	//  0x016AC
	int var_016B0;	//  0x016B0
	int var_016B4;	//  0x016B4
	int var_016B8;	//  0x016B8
	int var_016BC;	//  0x016BC
	int var_016C0;	//  0x016C0
	int var_016C4;	//  0x016C4
	int var_016C8;	//  0x016C8
	int var_016CC;	//  0x016CC
	int var_016D0;	//  0x016D0
	int var_016D4;	//  0x016D4
	int var_016D8;	//  0x016D8
	int var_016DC;	//  0x016DC
	int var_016E0;	//  0x016E0
	int var_016E4;	//  0x016E4
	int var_016E8;	//  0x016E8
	int var_016EC;	//  0x016EC
	int var_016F0;	//  0x016F0
	int var_016F4;	//  0x016F4
	int var_016F8;	//  0x016F8
	int var_016FC;	//  0x016FC
	int var_01700;	//  0x01700
	int var_01704;	//  0x01704
	int var_01708;	//  0x01708
	int var_0170C;	//  0x0170C
	int var_01710;	//  0x01710
	int var_01714;	//  0x01714
	int var_01718;	//  0x01718
	int var_0171C;	//  0x0171C
	int var_01720;	//  0x01720
	int var_01724;	//  0x01724
	int var_01728;	//  0x01728
	int var_0172C;	//  0x0172C
	int var_01730;	//  0x01730
	int var_01734;	//  0x01734
	int var_01738;	//  0x01738
	int var_0173C;	//  0x0173C
	int var_01740;	//  0x01740
	int var_01744;	//  0x01744
	int var_01748;	//  0x01748
	int var_0174C;	//  0x0174C
	int var_01750;	//  0x01750
	int var_01754;	//  0x01754
	int var_01758;	//  0x01758
	int var_0175C;	//  0x0175C
	int var_01760;	//  0x01760
	int var_01764;	//  0x01764
	int var_01768;	//  0x01768
	int var_0176C;	//  0x0176C
	int var_01770;	//  0x01770
	int var_01774;	//  0x01774
	int var_01778;	//  0x01778
	int var_0177C;	//  0x0177C
	int var_01780;	//  0x01780
	int var_01784;	//  0x01784
	int var_01788;	//  0x01788
	int var_0178C;	//  0x0178C
	int var_01790;	//  0x01790
	int var_01794;	//  0x01794
	int var_01798;	//  0x01798
	int var_0179C;	//  0x0179C
	int var_017A0;	//  0x017A0
	int var_017A4;	//  0x017A4
	int var_017A8;	//  0x017A8
	int var_017AC;	//  0x017AC
	int var_017B0;	//  0x017B0
	int var_017B4;	//  0x017B4
	int var_017B8;	//  0x017B8
	int var_017BC;	//  0x017BC
	int var_017C0;	//  0x017C0
	int var_017C4;	//  0x017C4
	int var_017C8;	//  0x017C8
	int var_017CC;	//  0x017CC
	int var_017D0;	//  0x017D0
	int var_017D4;	//  0x017D4
	int var_017D8;	//  0x017D8
	int var_017DC;	//  0x017DC
	int var_017E0;	//  0x017E0
	int var_017E4;	//  0x017E4
	int var_017E8;	//  0x017E8
	int var_017EC;	//  0x017EC
	int var_017F0;	//  0x017F0
	int var_017F4;	//  0x017F4
	int var_017F8;	//  0x017F8
	int var_017FC;	//  0x017FC
	int var_01800;	//  0x01800
	int var_01804;	//  0x01804
	int var_01808;	//  0x01808
	int var_0180C;	//  0x0180C
	int var_01810;	//  0x01810
	int var_01814;	//  0x01814
	int var_01818;	//  0x01818
	int var_0181C;	//  0x0181C
	int var_01820;	//  0x01820
	int var_01824;	//  0x01824
	int var_01828;	//  0x01828
	int var_0182C;	//  0x0182C
	int var_01830;	//  0x01830
	int var_01834;	//  0x01834
	int var_01838;	//  0x01838
	int var_0183C;	//  0x0183C
	int var_01840;	//  0x01840
	int var_01844;	//  0x01844
	int var_01848;	//  0x01848
	int var_0184C;	//  0x0184C
	int var_01850;	//  0x01850
	int var_01854;	//  0x01854
	int var_01858;	//  0x01858
	int var_0185C;	//  0x0185C
	int var_01860;	//  0x01860
	int var_01864;	//  0x01864
	int var_01868;	//  0x01868
	int var_0186C;	//  0x0186C
	int var_01870;	//  0x01870
	int var_01874;	//  0x01874
	int var_01878;	//  0x01878
	int var_0187C;	//  0x0187C
	int var_01880;	//  0x01880
	int var_01884;	//  0x01884
	int var_01888;	//  0x01888
	int var_0188C;	//  0x0188C
	int var_01890;	//  0x01890
	int var_01894;	//  0x01894
	int var_01898;	//  0x01898
	int var_0189C;	//  0x0189C
	int var_018A0;	//  0x018A0
	int var_018A4;	//  0x018A4
	int var_018A8;	//  0x018A8
	int var_018AC;	//  0x018AC
	int var_018B0;	//  0x018B0
	int var_018B4;	//  0x018B4
	int var_018B8;	//  0x018B8
	int var_018BC;	//  0x018BC
	int var_018C0;	//  0x018C0
	int var_018C4;	//  0x018C4
	int var_018C8;	//  0x018C8
	int var_018CC;	//  0x018CC
	int var_018D0;	//  0x018D0
	int var_018D4;	//  0x018D4
	int var_018D8;	//  0x018D8
	int var_018DC;	//  0x018DC
	int var_018E0;	//  0x018E0
	int var_018E4;	//  0x018E4
	int var_018E8;	//  0x018E8
	int var_018EC;	//  0x018EC
	int var_018F0;	//  0x018F0
	int var_018F4;	//  0x018F4
	int var_018F8;	//  0x018F8
	int var_018FC;	//  0x018FC
	int var_01900;	//  0x01900
	int var_01904;	//  0x01904
	int var_01908;	//  0x01908
	int var_0190C;	//  0x0190C
	int var_01910;	//  0x01910
	int var_01914;	//  0x01914
	int var_01918;	//  0x01918
	int var_0191C;	//  0x0191C
	int var_01920;	//  0x01920
	int var_01924;	//  0x01924
	int var_01928;	//  0x01928
	int var_0192C;	//  0x0192C
	int var_01930;	//  0x01930
	int var_01934;	//  0x01934
	int var_01938;	//  0x01938
	int var_0193C;	//  0x0193C
	int var_01940;	//  0x01940
	int var_01944;	//  0x01944
	int var_01948;	//  0x01948
	int var_0194C;	//  0x0194C
	int var_01950;	//  0x01950
	int var_01954;	//  0x01954
	int var_01958;	//  0x01958
	int var_0195C;	//  0x0195C
	int var_01960;	//  0x01960
	int var_01964;	//  0x01964
	int var_01968;	//  0x01968
	int var_0196C;	//  0x0196C
	int var_01970;	//  0x01970
	int var_01974;	//  0x01974
	int var_01978;	//  0x01978
	int var_0197C;	//  0x0197C
	int var_01980;	//  0x01980
	int var_01984;	//  0x01984
	int var_01988;	//  0x01988
	int var_0198C;	//  0x0198C
	int var_01990;	//  0x01990
	int var_01994;	//  0x01994
	int var_01998;	//  0x01998
	int var_0199C;	//  0x0199C
	int var_019A0;	//  0x019A0
	int var_019A4;	//  0x019A4
	int var_019A8;	//  0x019A8
	int var_019AC;	//  0x019AC
	int var_019B0;	//  0x019B0
	int var_019B4;	//  0x019B4
	int var_019B8;	//  0x019B8
	int var_019BC;	//  0x019BC
	int var_019C0;	//  0x019C0
	int var_019C4;	//  0x019C4
	int var_019C8;	//  0x019C8
	int var_019CC;	//  0x019CC
	int var_019D0;	//  0x019D0
	int var_019D4;	//  0x019D4
	int var_019D8;	//  0x019D8
	int var_019DC;	//  0x019DC
	int var_019E0;	//  0x019E0
	int var_019E4;	//  0x019E4
	int var_019E8;	//  0x019E8
	int var_019EC;	//  0x019EC
	int var_019F0;	//  0x019F0
	int var_019F4;	//  0x019F4
	int var_019F8;	//  0x019F8
	int var_019FC;	//  0x019FC
	int var_01A00;	//  0x01A00
	int var_01A04;	//  0x01A04
	int var_01A08;	//  0x01A08
	int var_01A0C;	//  0x01A0C
	int var_01A10;	//  0x01A10
	int var_01A14;	//  0x01A14
	int var_01A18;	//  0x01A18
	int var_01A1C;	//  0x01A1C
	int var_01A20;	//  0x01A20
	int var_01A24;	//  0x01A24
	int var_01A28;	//  0x01A28
	int var_01A2C;	//  0x01A2C
	int var_01A30;	//  0x01A30
	int var_01A34;	//  0x01A34
	int var_01A38;	//  0x01A38
	int var_01A3C;	//  0x01A3C
	int var_01A40;	//  0x01A40
	int var_01A44;	//  0x01A44
	int var_01A48;	//  0x01A48
	int var_01A4C;	//  0x01A4C
	int var_01A50;	//  0x01A50
	int var_01A54;	//  0x01A54
	int var_01A58;	//  0x01A58
	int var_01A5C;	//  0x01A5C
	int var_01A60;	//  0x01A60
	int var_01A64;	//  0x01A64
	int var_01A68;	//  0x01A68
	int var_01A6C;	//  0x01A6C
	int var_01A70;	//  0x01A70
	int var_01A74;	//  0x01A74
	int var_01A78;	//  0x01A78
	int var_01A7C;	//  0x01A7C
	int var_01A80;	//  0x01A80
	int var_01A84;	//  0x01A84
	int var_01A88;	//  0x01A88
	int var_01A8C;	//  0x01A8C
	int var_01A90;	//  0x01A90
	int var_01A94;	//  0x01A94
	int var_01A98;	//  0x01A98
	int var_01A9C;	//  0x01A9C
	int var_01AA0;	//  0x01AA0
	int var_01AA4;	//  0x01AA4
	int var_01AA8;	//  0x01AA8
	int var_01AAC;	//  0x01AAC
	int var_01AB0;	//  0x01AB0
	int var_01AB4;	//  0x01AB4
	int var_01AB8;	//  0x01AB8
	int var_01ABC;	//  0x01ABC
	int var_01AC0;	//  0x01AC0
	int var_01AC4;	//  0x01AC4
	int var_01AC8;	//  0x01AC8
	int var_01ACC;	//  0x01ACC
	int var_01AD0;	//  0x01AD0
	int var_01AD4;	//  0x01AD4
	int var_01AD8;	//  0x01AD8
	int var_01ADC;	//  0x01ADC
	int var_01AE0;	//  0x01AE0
	int var_01AE4;	//  0x01AE4
	int var_01AE8;	//  0x01AE8
	int var_01AEC;	//  0x01AEC
	int var_01AF0;	//  0x01AF0
	int var_01AF4;	//  0x01AF4
	int var_01AF8;	//  0x01AF8
	int var_01AFC;	//  0x01AFC
	int var_01B00;	//  0x01B00
	int var_01B04;	//  0x01B04
	int var_01B08;	//  0x01B08
	int var_01B0C;	//  0x01B0C
	int var_01B10;	//  0x01B10
	int var_01B14;	//  0x01B14
	int var_01B18;	//  0x01B18
	int var_01B1C;	//  0x01B1C
	int var_01B20;	//  0x01B20
	int var_01B24;	//  0x01B24
	int var_01B28;	//  0x01B28
	int var_01B2C;	//  0x01B2C
	int var_01B30;	//  0x01B30
	int var_01B34;	//  0x01B34
	int var_01B38;	//  0x01B38
	int var_01B3C;	//  0x01B3C
	int var_01B40;	//  0x01B40
	int var_01B44;	//  0x01B44
	int var_01B48;	//  0x01B48
	int var_01B4C;	//  0x01B4C
	int var_01B50;	//  0x01B50
	int var_01B54;	//  0x01B54
	int var_01B58;	//  0x01B58
	int var_01B5C;	//  0x01B5C
	int var_01B60;	//  0x01B60
	int var_01B64;	//  0x01B64
	int var_01B68;	//  0x01B68
	int var_01B6C;	//  0x01B6C
	int var_01B70;	//  0x01B70
	int var_01B74;	//  0x01B74
	int var_01B78;	//  0x01B78
	int var_01B7C;	//  0x01B7C
	int var_01B80;	//  0x01B80
	int var_01B84;	//  0x01B84
	int var_01B88;	//  0x01B88
	int var_01B8C;	//  0x01B8C
	int var_01B90;	//  0x01B90
	int var_01B94;	//  0x01B94
	int var_01B98;	//  0x01B98
	int var_01B9C;	//  0x01B9C
	int var_01BA0;	//  0x01BA0
	int var_01BA4;	//  0x01BA4
	int var_01BA8;	//  0x01BA8
	int var_01BAC;	//  0x01BAC
	int var_01BB0;	//  0x01BB0
	int var_01BB4;	//  0x01BB4
	int var_01BB8;	//  0x01BB8
	int var_01BBC;	//  0x01BBC
	int var_01BC0;	//  0x01BC0
	int var_01BC4;	//  0x01BC4
	int var_01BC8;	//  0x01BC8
	int var_01BCC;	//  0x01BCC
	int var_01BD0;	//  0x01BD0
	int var_01BD4;	//  0x01BD4
	int var_01BD8;	//  0x01BD8
	int var_01BDC;	//  0x01BDC
	int var_01BE0;	//  0x01BE0
	int var_01BE4;	//  0x01BE4
	int var_01BE8;	//  0x01BE8
	int var_01BEC;	//  0x01BEC
	int var_01BF0;	//  0x01BF0
	int var_01BF4;	//  0x01BF4
	int var_01BF8;	//  0x01BF8
	int var_01BFC;	//  0x01BFC
	int var_01C00;	//  0x01C00
	int var_01C04;	//  0x01C04
	int var_01C08;	//  0x01C08
	int var_01C0C;	//  0x01C0C
	int var_01C10;	//  0x01C10
	int var_01C14;	//  0x01C14
	int var_01C18;	//  0x01C18
	int var_01C1C;	//  0x01C1C
	int var_01C20;	//  0x01C20
	int var_01C24;	//  0x01C24
	int var_01C28;	//  0x01C28
	int var_01C2C;	//  0x01C2C
	int var_01C30;	//  0x01C30
	int var_01C34;	//  0x01C34
	int var_01C38;	//  0x01C38
	int var_01C3C;	//  0x01C3C
	int var_01C40;	//  0x01C40
	int var_01C44;	//  0x01C44
	int var_01C48;	//  0x01C48
	int var_01C4C;	//  0x01C4C
	int var_01C50;	//  0x01C50
	int var_01C54;	//  0x01C54
	int var_01C58;	//  0x01C58
	int var_01C5C;	//  0x01C5C
	int var_01C60;	//  0x01C60
	int var_01C64;	//  0x01C64
	int var_01C68;	//  0x01C68
	int var_01C6C;	//  0x01C6C
	int var_01C70;	//  0x01C70
	int var_01C74;	//  0x01C74
	int var_01C78;	//  0x01C78
	int var_01C7C;	//  0x01C7C
	int var_01C80;	//  0x01C80
	int var_01C84;	//  0x01C84
	int var_01C88;	//  0x01C88
	int var_01C8C;	//  0x01C8C
	int var_01C90;	//  0x01C90
	int var_01C94;	//  0x01C94
	int var_01C98;	//  0x01C98
	int var_01C9C;	//  0x01C9C
	int var_01CA0;	//  0x01CA0
	int var_01CA4;	//  0x01CA4
	int var_01CA8;	//  0x01CA8
	int var_01CAC;	//  0x01CAC
	int var_01CB0;	//  0x01CB0
	int var_01CB4;	//  0x01CB4
	int var_01CB8;	//  0x01CB8
	int var_01CBC;	//  0x01CBC
	int var_01CC0;	//  0x01CC0
	int var_01CC4;	//  0x01CC4
	int var_01CC8;	//  0x01CC8
	int var_01CCC;	//  0x01CCC
	int var_01CD0;	//  0x01CD0
	int var_01CD4;	//  0x01CD4
	int var_01CD8;	//  0x01CD8
	int var_01CDC;	//  0x01CDC
	int var_01CE0;	//  0x01CE0
	int var_01CE4;	//  0x01CE4
	int var_01CE8;	//  0x01CE8
	int var_01CEC;	//  0x01CEC
	int var_01CF0;	//  0x01CF0
	int var_01CF4;	//  0x01CF4
	int var_01CF8;	//  0x01CF8
	int var_01CFC;	//  0x01CFC
	int var_01D00;	//  0x01D00
	int var_01D04;	//  0x01D04
	int var_01D08;	//  0x01D08
	int var_01D0C;	//  0x01D0C
	int var_01D10;	//  0x01D10
	int var_01D14;	//  0x01D14
	int var_01D18;	//  0x01D18
	int var_01D1C;	//  0x01D1C
	int var_01D20;	//  0x01D20
	int var_01D24;	//  0x01D24
	int var_01D28;	//  0x01D28
	int var_01D2C;	//  0x01D2C
	int var_01D30;	//  0x01D30
	int var_01D34;	//  0x01D34
	int var_01D38;	//  0x01D38
	int var_01D3C;	//  0x01D3C
	int var_01D40;	//  0x01D40
	int var_01D44;	//  0x01D44
	int var_01D48;	//  0x01D48
	int var_01D4C;	//  0x01D4C
	int var_01D50;	//  0x01D50
	int var_01D54;	//  0x01D54
	int var_01D58;	//  0x01D58
	int var_01D5C;	//  0x01D5C
	int var_01D60;	//  0x01D60
	int var_01D64;	//  0x01D64
	int var_01D68;	//  0x01D68
	int var_01D6C;	//  0x01D6C
	int var_01D70;	//  0x01D70
	int var_01D74;	//  0x01D74
	int var_01D78;	//  0x01D78
	int var_01D7C;	//  0x01D7C
	int var_01D80;	//  0x01D80
	int var_01D84;	//  0x01D84
	int var_01D88;	//  0x01D88
	int var_01D8C;	//  0x01D8C
	int var_01D90;	//  0x01D90
	int var_01D94;	//  0x01D94
	int var_01D98;	//  0x01D98
	int var_01D9C;	//  0x01D9C
	int var_01DA0;	//  0x01DA0
	int var_01DA4;	//  0x01DA4
	int var_01DA8;	//  0x01DA8
	int var_01DAC;	//  0x01DAC
	int var_01DB0;	//  0x01DB0
	int var_01DB4;	//  0x01DB4
	int var_01DB8;	//  0x01DB8
	int var_01DBC;	//  0x01DBC
	int var_01DC0;	//  0x01DC0
	int var_01DC4;	//  0x01DC4
	int var_01DC8;	//  0x01DC8
	int var_01DCC;	//  0x01DCC
	int var_01DD0;	//  0x01DD0
	int var_01DD4;	//  0x01DD4
	int var_01DD8;	//  0x01DD8
	int var_01DDC;	//  0x01DDC
	int var_01DE0;	//  0x01DE0
	int var_01DE4;	//  0x01DE4
	int var_01DE8;	//  0x01DE8
	int var_01DEC;	//  0x01DEC
	int var_01DF0;	//  0x01DF0
	int var_01DF4;	//  0x01DF4
	int var_01DF8;	//  0x01DF8
	int var_01DFC;	//  0x01DFC
	int var_01E00;	//  0x01E00
	int var_01E04;	//  0x01E04
	int var_01E08;	//  0x01E08
	int var_01E0C;	//  0x01E0C
	int var_01E10;	//  0x01E10
	int var_01E14;	//  0x01E14
	int var_01E18;	//  0x01E18
	int var_01E1C;	//  0x01E1C
	int var_01E20;	//  0x01E20
	int var_01E24;	//  0x01E24
	int var_01E28;	//  0x01E28
	int var_01E2C;	//  0x01E2C
	int var_01E30;	//  0x01E30
	int var_01E34;	//  0x01E34
	int var_01E38;	//  0x01E38
	int var_01E3C;	//  0x01E3C
	int var_01E40;	//  0x01E40
	int var_01E44;	//  0x01E44
	int var_01E48;	//  0x01E48
	int var_01E4C;	//  0x01E4C
	int var_01E50;	//  0x01E50
	int var_01E54;	//  0x01E54
	int var_01E58;	//  0x01E58
	int var_01E5C;	//  0x01E5C
	int var_01E60;	//  0x01E60
	int var_01E64;	//  0x01E64
	int var_01E68;	//  0x01E68
	int var_01E6C;	//  0x01E6C
	int var_01E70;	//  0x01E70
	int var_01E74;	//  0x01E74
	int var_01E78;	//  0x01E78
	int var_01E7C;	//  0x01E7C
	int var_01E80;	//  0x01E80
	int var_01E84;	//  0x01E84
	int var_01E88;	//  0x01E88
	int var_01E8C;	//  0x01E8C
	int var_01E90;	//  0x01E90
	int var_01E94;	//  0x01E94
	int var_01E98;	//  0x01E98
	int var_01E9C;	//  0x01E9C
	int var_01EA0;	//  0x01EA0
	int var_01EA4;	//  0x01EA4
	int var_01EA8;	//  0x01EA8
	int var_01EAC;	//  0x01EAC
	int var_01EB0;	//  0x01EB0
	int var_01EB4;	//  0x01EB4
	int var_01EB8;	//  0x01EB8
	int var_01EBC;	//  0x01EBC
	int var_01EC0;	//  0x01EC0
	int var_01EC4;	//  0x01EC4
	int var_01EC8;	//  0x01EC8
	int var_01ECC;	//  0x01ECC
	int var_01ED0;	//  0x01ED0
	int var_01ED4;	//  0x01ED4
	int var_01ED8;	//  0x01ED8
	int var_01EDC;	//  0x01EDC
	int var_01EE0;	//  0x01EE0
	int var_01EE4;	//  0x01EE4
	int var_01EE8;	//  0x01EE8
	int var_01EEC;	//  0x01EEC
	int var_01EF0;	//  0x01EF0
	int var_01EF4;	//  0x01EF4
	int var_01EF8;	//  0x01EF8
	int var_01EFC;	//  0x01EFC
	int var_01F00;	//  0x01F00
	int var_01F04;	//  0x01F04
	int var_01F08;	//  0x01F08
	int var_01F0C;	//  0x01F0C
	int var_01F10;	//  0x01F10
	int var_01F14;	//  0x01F14
	int var_01F18;	//  0x01F18
	int var_01F1C;	//  0x01F1C
	int var_01F20;	//  0x01F20
	int var_01F24;	//  0x01F24
	int var_01F28;	//  0x01F28
	int var_01F2C;	//  0x01F2C
	int var_01F30;	//  0x01F30
	int var_01F34;	//  0x01F34
	int var_01F38;	//  0x01F38
	int var_01F3C;	//  0x01F3C
	int var_01F40;	//  0x01F40
	int var_01F44;	//  0x01F44
	int var_01F48;	//  0x01F48
	int var_01F4C;	//  0x01F4C
	int var_01F50;	//  0x01F50
	int var_01F54;	//  0x01F54
	int var_01F58;	//  0x01F58
	int var_01F5C;	//  0x01F5C
	int var_01F60;	//  0x01F60
	int var_01F64;	//  0x01F64
	int var_01F68;	//  0x01F68
	int var_01F6C;	//  0x01F6C
	int var_01F70;	//  0x01F70
	int var_01F74;	//  0x01F74
	int var_01F78;	//  0x01F78
	int var_01F7C;	//  0x01F7C
	int var_01F80;	//  0x01F80
	int var_01F84;	//  0x01F84
	int var_01F88;	//  0x01F88
	int var_01F8C;	//  0x01F8C
	int var_01F90;	//  0x01F90
	int var_01F94;	//  0x01F94
	int var_01F98;	//  0x01F98
	int var_01F9C;	//  0x01F9C
	int var_01FA0;	//  0x01FA0
	int var_01FA4;	//  0x01FA4
	int var_01FA8;	//  0x01FA8
	int var_01FAC;	//  0x01FAC
	int var_01FB0;	//  0x01FB0
	int var_01FB4;	//  0x01FB4
	int var_01FB8;	//  0x01FB8
	int var_01FBC;	//  0x01FBC
	int var_01FC0;	//  0x01FC0
	int var_01FC4;	//  0x01FC4
	int var_01FC8;	//  0x01FC8
	int var_01FCC;	//  0x01FCC
	int var_01FD0;	//  0x01FD0
	int var_01FD4;	//  0x01FD4
	int var_01FD8;	//  0x01FD8
	int var_01FDC;	//  0x01FDC
	int var_01FE0;	//  0x01FE0
	int var_01FE4;	//  0x01FE4
	int var_01FE8;	//  0x01FE8
	int var_01FEC;	//  0x01FEC
	int var_01FF0;	//  0x01FF0
	int var_01FF4;	//  0x01FF4
	int var_01FF8;	//  0x01FF8
	int var_01FFC;	//  0x01FFC
	int var_02000;	//  0x02000
	int var_02004;	//  0x02004
	int var_02008;	//  0x02008
	int var_0200C;	//  0x0200C
	int var_02010;	//  0x02010
	int var_02014;	//  0x02014
	int var_02018;	//  0x02018
	int var_0201C;	//  0x0201C
	int var_02020;	//  0x02020
	int var_02024;	//  0x02024
	int var_02028;	//  0x02028
	int var_0202C;	//  0x0202C
	int var_02030;	//  0x02030
	int var_02034;	//  0x02034
	int var_02038;	//  0x02038
	int var_0203C;	//  0x0203C
	int var_02040;	//  0x02040
	int var_02044;	//  0x02044
	int var_02048;	//  0x02048
	int var_0204C;	//  0x0204C
	int var_02050;	//  0x02050
	int var_02054;	//  0x02054
	int var_02058;	//  0x02058
	int var_0205C;	//  0x0205C
	int var_02060;	//  0x02060
	int var_02064;	//  0x02064
	int var_02068;	//  0x02068
	int var_0206C;	//  0x0206C
	int var_02070;	//  0x02070
	int var_02074;	//  0x02074
	int var_02078;	//  0x02078
	int var_0207C;	//  0x0207C
	int var_02080;	//  0x02080
	int var_02084;	//  0x02084
	int var_02088;	//  0x02088
	int var_0208C;	//  0x0208C
	int var_02090;	//  0x02090
	int var_02094;	//  0x02094
	int var_02098;	//  0x02098
	int var_0209C;	//  0x0209C
	int var_020A0;	//  0x020A0
	int var_020A4;	//  0x020A4
	int var_020A8;	//  0x020A8
	int var_020AC;	//  0x020AC
	int var_020B0;	//  0x020B0
	int var_020B4;	//  0x020B4
	int var_020B8;	//  0x020B8
	int var_020BC;	//  0x020BC
	int var_020C0;	//  0x020C0
	int var_020C4;	//  0x020C4
	int var_020C8;	//  0x020C8
	int var_020CC;	//  0x020CC
	int var_020D0;	//  0x020D0
	int var_020D4;	//  0x020D4
	int var_020D8;	//  0x020D8
	int var_020DC;	//  0x020DC
	int var_020E0;	//  0x020E0
	int var_020E4;	//  0x020E4
	int var_020E8;	//  0x020E8
	int var_020EC;	//  0x020EC
	int var_020F0;	//  0x020F0
	int var_020F4;	//  0x020F4
	int var_020F8;	//  0x020F8
	int var_020FC;	//  0x020FC
	int var_02100;	//  0x02100
	int var_02104;	//  0x02104
	int var_02108;	//  0x02108
	int var_0210C;	//  0x0210C
	int var_02110;	//  0x02110
	int var_02114;	//  0x02114
	int var_02118;	//  0x02118
	int var_0211C;	//  0x0211C
	int var_02120;	//  0x02120
	int var_02124;	//  0x02124
	int var_02128;	//  0x02128
	int var_0212C;	//  0x0212C
	int var_02130;	//  0x02130
	int var_02134;	//  0x02134
	int var_02138;	//  0x02138
	int var_0213C;	//  0x0213C
	int var_02140;	//  0x02140
	int var_02144;	//  0x02144
	int var_02148;	//  0x02148
	int var_0214C;	//  0x0214C
	int var_02150;	//  0x02150
	int var_02154;	//  0x02154
	int var_02158;	//  0x02158
	int var_0215C;	//  0x0215C
	int var_02160;	//  0x02160
	int var_02164;	//  0x02164
	int var_02168;	//  0x02168
	int var_0216C;	//  0x0216C
	int var_02170;	//  0x02170
	int var_02174;	//  0x02174
	int var_02178;	//  0x02178
	int var_0217C;	//  0x0217C
	int var_02180;	//  0x02180
	int var_02184;	//  0x02184
	int var_02188;	//  0x02188
	int var_0218C;	//  0x0218C
	int var_02190;	//  0x02190
	int var_02194;	//  0x02194
	int var_02198;	//  0x02198
	int var_0219C;	//  0x0219C
	int var_021A0;	//  0x021A0
	int var_021A4;	//  0x021A4
	int var_021A8;	//  0x021A8
	int var_021AC;	//  0x021AC
	int var_021B0;	//  0x021B0
	int var_021B4;	//  0x021B4
	int var_021B8;	//  0x021B8
	int var_021BC;	//  0x021BC
	int var_021C0;	//  0x021C0
	int var_021C4;	//  0x021C4
	int var_021C8;	//  0x021C8
	int var_021CC;	//  0x021CC
	int var_021D0;	//  0x021D0
	int var_021D4;	//  0x021D4
	int var_021D8;	//  0x021D8
	int var_021DC;	//  0x021DC
	int var_021E0;	//  0x021E0
	int var_021E4;	//  0x021E4
	int var_021E8;	//  0x021E8
	int var_021EC;	//  0x021EC
	int var_021F0;	//  0x021F0
	int var_021F4;	//  0x021F4
	int var_021F8;	//  0x021F8
	int var_021FC;	//  0x021FC
	int var_02200;	//  0x02200
	int var_02204;	//  0x02204
	int var_02208;	//  0x02208
	int var_0220C;	//  0x0220C
	int var_02210;	//  0x02210
	int var_02214;	//  0x02214
	int var_02218;	//  0x02218
	int var_0221C;	//  0x0221C
	int var_02220;	//  0x02220
	int var_02224;	//  0x02224
	int var_02228;	//  0x02228
	int var_0222C;	//  0x0222C
	int var_02230;	//  0x02230
	int var_02234;	//  0x02234
	int var_02238;	//  0x02238
	int var_0223C;	//  0x0223C
	int var_02240;	//  0x02240
	int var_02244;	//  0x02244
	int var_02248;	//  0x02248
	int var_0224C;	//  0x0224C
	int var_02250;	//  0x02250
	int var_02254;	//  0x02254
	int var_02258;	//  0x02258
	int var_0225C;	//  0x0225C
	int var_02260;	//  0x02260
	int var_02264;	//  0x02264
	int var_02268;	//  0x02268
	int var_0226C;	//  0x0226C
	int var_02270;	//  0x02270
	int var_02274;	//  0x02274
	int var_02278;	//  0x02278
	int var_0227C;	//  0x0227C
	int var_02280;	//  0x02280
	int var_02284;	//  0x02284
	int var_02288;	//  0x02288
	int var_0228C;	//  0x0228C
	int var_02290;	//  0x02290
	int var_02294;	//  0x02294
	int var_02298;	//  0x02298
	int var_0229C;	//  0x0229C
	int var_022A0;	//  0x022A0
	int var_022A4;	//  0x022A4
	int var_022A8;	//  0x022A8
	int var_022AC;	//  0x022AC
	int var_022B0;	//  0x022B0
	int var_022B4;	//  0x022B4
	int var_022B8;	//  0x022B8
	int var_022BC;	//  0x022BC
	int var_022C0;	//  0x022C0
	int var_022C4;	//  0x022C4
	int var_022C8;	//  0x022C8
	int var_022CC;	//  0x022CC
	int var_022D0;	//  0x022D0
	int var_022D4;	//  0x022D4
	int var_022D8;	//  0x022D8
	int var_022DC;	//  0x022DC
	int var_022E0;	//  0x022E0
	int var_022E4;	//  0x022E4
	int var_022E8;	//  0x022E8
	int var_022EC;	//  0x022EC
	int var_022F0;	//  0x022F0
	int var_022F4;	//  0x022F4
	int var_022F8;	//  0x022F8
	int var_022FC;	//  0x022FC
	int var_02300;	//  0x02300
	int var_02304;	//  0x02304
	int var_02308;	//  0x02308
	int var_0230C;	//  0x0230C
	int var_02310;	//  0x02310
	int var_02314;	//  0x02314
	int var_02318;	//  0x02318
	int var_0231C;	//  0x0231C
	int var_02320;	//  0x02320
	int var_02324;	//  0x02324
	int var_02328;	//  0x02328
	int var_0232C;	//  0x0232C
	int var_02330;	//  0x02330
	int var_02334;	//  0x02334
	int var_02338;	//  0x02338
	int var_0233C;	//  0x0233C
	int var_02340;	//  0x02340
	int var_02344;	//  0x02344
	int var_02348;	//  0x02348
	int var_0234C;	//  0x0234C
	int var_02350;	//  0x02350
	int var_02354;	//  0x02354
	int var_02358;	//  0x02358
	int var_0235C;	//  0x0235C
	int var_02360;	//  0x02360
	int var_02364;	//  0x02364
	int var_02368;	//  0x02368
	int var_0236C;	//  0x0236C
	int var_02370;	//  0x02370
	int var_02374;	//  0x02374
	int var_02378;	//  0x02378
	int var_0237C;	//  0x0237C
	int var_02380;	//  0x02380
	int var_02384;	//  0x02384
	int var_02388;	//  0x02388
	int var_0238C;	//  0x0238C
	int var_02390;	//  0x02390
	int var_02394;	//  0x02394
	int var_02398;	//  0x02398
	int var_0239C;	//  0x0239C
	int var_023A0;	//  0x023A0
	int var_023A4;	//  0x023A4
	int var_023A8;	//  0x023A8
	int var_023AC;	//  0x023AC
	int var_023B0;	//  0x023B0
	int var_023B4;	//  0x023B4
	int var_023B8;	//  0x023B8
	int var_023BC;	//  0x023BC
	int var_023C0;	//  0x023C0
	int var_023C4;	//  0x023C4
	int var_023C8;	//  0x023C8
	int var_023CC;	//  0x023CC
	int var_023D0;	//  0x023D0
	int var_023D4;	//  0x023D4
	int var_023D8;	//  0x023D8
	int var_023DC;	//  0x023DC
	int var_023E0;	//  0x023E0
	int var_023E4;	//  0x023E4
	int var_023E8;	//  0x023E8
	int var_023EC;	//  0x023EC
	int var_023F0;	//  0x023F0
	int var_023F4;	//  0x023F4
	int var_023F8;	//  0x023F8
	int var_023FC;	//  0x023FC
	int var_02400;	//  0x02400
	int var_02404;	//  0x02404
	int var_02408;	//  0x02408
	int var_0240C;	//  0x0240C
	int var_02410;	//  0x02410
	int var_02414;	//  0x02414
	int var_02418;	//  0x02418
	int var_0241C;	//  0x0241C
	int var_02420;	//  0x02420
	int var_02424;	//  0x02424
	int var_02428;	//  0x02428
	int var_0242C;	//  0x0242C
	int var_02430;	//  0x02430
	int var_02434;	//  0x02434
	int var_02438;	//  0x02438
	int var_0243C;	//  0x0243C
	int var_02440;	//  0x02440
	int var_02444;	//  0x02444
	int var_02448;	//  0x02448
	int var_0244C;	//  0x0244C
	int var_02450;	//  0x02450
	int var_02454;	//  0x02454
	int var_02458;	//  0x02458
	int var_0245C;	//  0x0245C
	int var_02460;	//  0x02460
	int var_02464;	//  0x02464
	int var_02468;	//  0x02468
	int var_0246C;	//  0x0246C
	int var_02470;	//  0x02470
	int var_02474;	//  0x02474
	int var_02478;	//  0x02478
	int var_0247C;	//  0x0247C
	int var_02480;	//  0x02480
	int var_02484;	//  0x02484
	int var_02488;	//  0x02488
	int var_0248C;	//  0x0248C
	int var_02490;	//  0x02490
	int var_02494;	//  0x02494
	int var_02498;	//  0x02498
	int var_0249C;	//  0x0249C
	int var_024A0;	//  0x024A0
	int var_024A4;	//  0x024A4
	int var_024A8;	//  0x024A8
	int var_024AC;	//  0x024AC
	int var_024B0;	//  0x024B0
	int var_024B4;	//  0x024B4
	int var_024B8;	//  0x024B8
	int var_024BC;	//  0x024BC
	int var_024C0;	//  0x024C0
	int var_024C4;	//  0x024C4
	int var_024C8;	//  0x024C8
	int var_024CC;	//  0x024CC
	int var_024D0;	//  0x024D0
	int var_024D4;	//  0x024D4
	int var_024D8;	//  0x024D8
	int var_024DC;	//  0x024DC
	int var_024E0;	//  0x024E0
	int var_024E4;	//  0x024E4
	int var_024E8;	//  0x024E8
	int var_024EC;	//  0x024EC
	int var_024F0;	//  0x024F0
	int var_024F4;	//  0x024F4
	int var_024F8;	//  0x024F8
	int var_024FC;	//  0x024FC
	int var_02500;	//  0x02500
	int var_02504;	//  0x02504
	int var_02508;	//  0x02508
	int var_0250C;	//  0x0250C
	int var_02510;	//  0x02510
	int var_02514;	//  0x02514
	int var_02518;	//  0x02518
	int var_0251C;	//  0x0251C
	int var_02520;	//  0x02520
	int var_02524;	//  0x02524
	int var_02528;	//  0x02528
	int var_0252C;	//  0x0252C
	int var_02530;	//  0x02530
	int var_02534;	//  0x02534
	int var_02538;	//  0x02538
	int var_0253C;	//  0x0253C
	int var_02540;	//  0x02540
	int var_02544;	//  0x02544
	int var_02548;	//  0x02548
	int var_0254C;	//  0x0254C
	int var_02550;	//  0x02550
	int var_02554;	//  0x02554
	int var_02558;	//  0x02558
	int var_0255C;	//  0x0255C
	int var_02560;	//  0x02560
	int var_02564;	//  0x02564
	int var_02568;	//  0x02568
	int var_0256C;	//  0x0256C
	int var_02570;	//  0x02570
	int var_02574;	//  0x02574
	int var_02578;	//  0x02578
	int var_0257C;	//  0x0257C
	int var_02580;	//  0x02580
	int var_02584;	//  0x02584
	int var_02588;	//  0x02588
	int var_0258C;	//  0x0258C
	int var_02590;	//  0x02590
	int var_02594;	//  0x02594
	int var_02598;	//  0x02598
	int var_0259C;	//  0x0259C
	int var_025A0;	//  0x025A0
	int var_025A4;	//  0x025A4
	int var_025A8;	//  0x025A8
	int var_025AC;	//  0x025AC
	int var_025B0;	//  0x025B0
	int var_025B4;	//  0x025B4
	int var_025B8;	//  0x025B8
	int var_025BC;	//  0x025BC
	int var_025C0;	//  0x025C0
	int var_025C4;	//  0x025C4
	int var_025C8;	//  0x025C8
	int var_025CC;	//  0x025CC
	int var_025D0;	//  0x025D0
	int var_025D4;	//  0x025D4
	int var_025D8;	//  0x025D8
	int var_025DC;	//  0x025DC
	int var_025E0;	//  0x025E0
	int var_025E4;	//  0x025E4
	int var_025E8;	//  0x025E8
	int var_025EC;	//  0x025EC
	int var_025F0;	//  0x025F0
	int var_025F4;	//  0x025F4
	int var_025F8;	//  0x025F8
	int var_025FC;	//  0x025FC
	int var_02600;	//  0x02600
	int var_02604;	//  0x02604
	int var_02608;	//  0x02608
	int var_0260C;	//  0x0260C
	int var_02610;	//  0x02610
	int var_02614;	//  0x02614
	int var_02618;	//  0x02618
	int var_0261C;	//  0x0261C
	int var_02620;	//  0x02620
	int var_02624;	//  0x02624
	int var_02628;	//  0x02628
	int var_0262C;	//  0x0262C
	int var_02630;	//  0x02630
	int var_02634;	//  0x02634
	int var_02638;	//  0x02638
	int var_0263C;	//  0x0263C
	int var_02640;	//  0x02640
	int var_02644;	//  0x02644
	int var_02648;	//  0x02648
	int var_0264C;	//  0x0264C
	int var_02650;	//  0x02650
	int var_02654;	//  0x02654
	int var_02658;	//  0x02658
	int var_0265C;	//  0x0265C
	int var_02660;	//  0x02660
	int var_02664;	//  0x02664
	int var_02668;	//  0x02668
	int var_0266C;	//  0x0266C
	int var_02670;	//  0x02670
	int var_02674;	//  0x02674
	int var_02678;	//  0x02678
	int var_0267C;	//  0x0267C
	int var_02680;	//  0x02680
	int var_02684;	//  0x02684
	int var_02688;	//  0x02688
	int var_0268C;	//  0x0268C
	int var_02690;	//  0x02690
	int var_02694;	//  0x02694
	int var_02698;	//  0x02698
	int var_0269C;	//  0x0269C
	int var_026A0;	//  0x026A0
	int var_026A4;	//  0x026A4
	int var_026A8;	//  0x026A8
	int var_026AC;	//  0x026AC
	int var_026B0;	//  0x026B0
	int var_026B4;	//  0x026B4
	int var_026B8;	//  0x026B8
	int var_026BC;	//  0x026BC
	int var_026C0;	//  0x026C0
	int var_026C4;	//  0x026C4
	int var_026C8;	//  0x026C8
	int var_026CC;	//  0x026CC
	int var_026D0;	//  0x026D0
	int var_026D4;	//  0x026D4
	int var_026D8;	//  0x026D8
	int var_026DC;	//  0x026DC
	int var_026E0;	//  0x026E0
	int var_026E4;	//  0x026E4
	int var_026E8;	//  0x026E8
	int var_026EC;	//  0x026EC
	int var_026F0;	//  0x026F0
	int var_026F4;	//  0x026F4
	int var_026F8;	//  0x026F8
	int var_026FC;	//  0x026FC
	int var_02700;	//  0x02700
	int var_02704;	//  0x02704
	int var_02708;	//  0x02708
	int var_0270C;	//  0x0270C
	int var_02710;	//  0x02710
	int var_02714;	//  0x02714
	int var_02718;	//  0x02718
	int var_0271C;	//  0x0271C
	int var_02720;	//  0x02720
	int var_02724;	//  0x02724
	int var_02728;	//  0x02728
	int var_0272C;	//  0x0272C
	int var_02730;	//  0x02730
	int var_02734;	//  0x02734
	int var_02738;	//  0x02738
	int var_0273C;	//  0x0273C
	int var_02740;	//  0x02740
	int var_02744;	//  0x02744
	int var_02748;	//  0x02748
	int var_0274C;	//  0x0274C
	int var_02750;	//  0x02750
	int var_02754;	//  0x02754
	int var_02758;	//  0x02758
	int var_0275C;	//  0x0275C
	int var_02760;	//  0x02760
	int var_02764;	//  0x02764
	int var_02768;	//  0x02768
	int var_0276C;	//  0x0276C
	int var_02770;	//  0x02770
	int var_02774;	//  0x02774
	int var_02778;	//  0x02778
	int var_0277C;	//  0x0277C
	int var_02780;	//  0x02780
	int var_02784;	//  0x02784
	int var_02788;	//  0x02788
	int var_0278C;	//  0x0278C
	int var_02790;	//  0x02790
	int var_02794;	//  0x02794
	int var_02798;	//  0x02798
	int var_0279C;	//  0x0279C
	int var_027A0;	//  0x027A0
	int var_027A4;	//  0x027A4
	int var_027A8;	//  0x027A8
	int var_027AC;	//  0x027AC
	int var_027B0;	//  0x027B0
	int var_027B4;	//  0x027B4
	int var_027B8;	//  0x027B8
	int var_027BC;	//  0x027BC
	int var_027C0;	//  0x027C0
	int var_027C4;	//  0x027C4
	int var_027C8;	//  0x027C8
	int var_027CC;	//  0x027CC
	int var_027D0;	//  0x027D0
	int var_027D4;	//  0x027D4
	int var_027D8;	//  0x027D8
	int var_027DC;	//  0x027DC
	int var_027E0;	//  0x027E0
	int var_027E4;	//  0x027E4
	int var_027E8;	//  0x027E8
	int var_027EC;	//  0x027EC
	int var_027F0;	//  0x027F0
	int var_027F4;	//  0x027F4
	int var_027F8;	//  0x027F8
	int var_027FC;	//  0x027FC
	int var_02800;	//  0x02800
	int var_02804;	//  0x02804
	int var_02808;	//  0x02808
	int iClass;	//  0x0280C
	int var_02810;	//  0x02810
	int var_02814;	//  0x02814
	int var_02818;	//  0x02818
	int var_0281C;	//  0x0281C
	int var_02820;	//  0x02820
	int var_02824;	//  0x02824
	int var_02828;	//  0x02828
	int var_0282C;	//  0x0282C
	int var_02830;	//  0x02830
	int var_02834;	//  0x02834
	int var_02838;	//  0x02838
	unsigned long long skillTickCount;	//  0x0283C
	unsigned char styleEx;	//  0x02844
	unsigned char var_02845;	//  0x02844
	unsigned char var_02846;	//  0x02844
	unsigned char var_02847;	//  0x02844
	int var_02848;	//  0x02848
	int var_0284C;	//  0x0284C
	int var_02850;	//  0x02850
	int var_02854;	//  0x02854
	int var_02858;	//  0x02858
	int var_0285C;	//  0x0285C
	int var_02860;	//  0x02860
	int var_02864;	//  0x02864
	int var_02868;	//  0x02868
	int var_0286C;	//  0x0286C
	int var_02870;	//  0x02870
	int var_02874;	//  0x02874
	int var_02878;	//  0x02878
	int var_0287C;	//  0x0287C
	int var_02880;	//  0x02880
	int iStyleEX;	//  0x02884 //battlemode,bike,combo,astral
	int var_02888;	//  0x02888
	int var_0288C;	//  0x0288C
	int var_02890;	//  0x02890
	int var_02894;	//  0x02894
	int var_02898;	//  0x02898
	int var_0289C;	//  0x0289C
	int var_028A0;	//  0x028A0
	int var_028A4;	//  0x028A4
	int var_028A8;	//  0x028A8
	int var_028AC;	//  0x028AC
	int var_028B0;	//  0x028B0
	int var_028B4;	//  0x028B4
	int var_028B8;	//  0x028B8
	int var_028BC;	//  0x028BC
	int var_028C0;	//  0x028C0
	int var_028C4;	//  0x028C4
	int var_028C8;	//  0x028C8
	int var_028CC;	//  0x028CC
	int var_028D0;	//  0x028D0
	int var_028D4;	//  0x028D4
	int var_028D8;	//  0x028D8
	int var_028DC;	//  0x028DC
	int var_028E0;	//  0x028E0
	int var_028E4;	//  0x028E4
	int var_028E8;	//  0x028E8
	int var_028EC;	//  0x028EC
	int var_028F0;	//  0x028F0
	int var_028F4;	//  0x028F4
	int var_028F8;	//  0x028F8
	int var_028FC;	//  0x028FC
	int var_02900;	//  0x02900
	int var_02904;	//  0x02904
	int var_02908;	//  0x02908
	int var_0290C;	//  0x0290C
	int var_02910;	//  0x02910
	int var_02914;	//  0x02914
	int var_02918;	//  0x02918
	int var_0291C;	//  0x0291C
	int var_02920;	//  0x02920
	int var_02924;	//  0x02924
	int var_02928;	//  0x02928
	int var_0292C;	//  0x0292C
	int var_02930;	//  0x02930
	int var_02934;	//  0x02934
	int var_02938;	//  0x02938
	int var_0293C;	//  0x0293C
	int var_02940;	//  0x02940
	int var_02944;	//  0x02944
	int var_02948;	//  0x02948
	int var_0294C;	//  0x0294C
	int var_02950;	//  0x02950
	int var_02954;	//  0x02954
	int var_02958;	//  0x02958
	int var_0295C;	//  0x0295C
	int var_02960;	//  0x02960
	int var_02964;	//  0x02964
	int var_02968;	//  0x02968
	int var_0296C;	//  0x0296C
	int var_02970;	//  0x02970
	int var_02974;	//  0x02974
	int var_02978;	//  0x02978
	int var_0297C;	//  0x0297C
	int var_02980;	//  0x02980
	int var_02984;	//  0x02984
	int var_02988;	//  0x02988
	int var_0298C;	//  0x0298C
	int var_02990;	//  0x02990
	int var_02994;	//  0x02994
	int var_02998;	//  0x02998
	int var_0299C;	//  0x0299C
	int var_029A0;	//  0x029A0
	int var_029A4;	//  0x029A4
	int var_029A8;	//  0x029A8
	int var_029AC;	//  0x029AC
	int var_029B0;	//  0x029B0
	int var_029B4;	//  0x029B4
	int var_029B8;	//  0x029B8
	int var_029BC;	//  0x029BC
	int var_029C0;	//  0x029C0
	int var_029C4;	//  0x029C4
	int var_029C8;	//  0x029C8
	int var_029CC;	//  0x029CC
	int var_029D0;	//  0x029D0
	int var_029D4;	//  0x029D4
	int var_029D8;	//  0x029D8
	int var_029DC;	//  0x029DC
	int var_029E0;	//  0x029E0
	int var_029E4;	//  0x029E4
	int var_029E8;	//  0x029E8
	int var_029EC;	//  0x029EC
	int var_029F0;	//  0x029F0
	int var_029F4;	//  0x029F4
	int var_029F8;	//  0x029F8
	int var_029FC;	//  0x029FC
	int var_02A00;	//  0x02A00
	int var_02A04;	//  0x02A04
	int var_02A08;	//  0x02A08
	int var_02A0C;	//  0x02A0C
	int var_02A10;	//  0x02A10
	int var_02A14;	//  0x02A14
	int var_02A18;	//  0x02A18
	int var_02A1C;	//  0x02A1C
	int var_02A20;	//  0x02A20
	int var_02A24;	//  0x02A24
	int var_02A28;	//  0x02A28
	int var_02A2C;	//  0x02A2C
	int var_02A30;	//  0x02A30
	int var_02A34;	//  0x02A34
	int var_02A38;	//  0x02A38
	int var_02A3C;	//  0x02A3C
	int var_02A40;	//  0x02A40
	int var_02A44;	//  0x02A44
	int var_02A48;	//  0x02A48
	int var_02A4C;	//  0x02A4C
	int var_02A50;	//  0x02A50
	int var_02A54;	//  0x02A54
	int var_02A58;	//  0x02A58
	int var_02A5C;	//  0x02A5C
	int var_02A60;	//  0x02A60
	int var_02A64;	//  0x02A64
	int var_02A68;	//  0x02A68
	int var_02A6C;	//  0x02A6C
	int var_02A70;	//  0x02A70
	int var_02A74;	//  0x02A74
	int var_02A78;	//  0x02A78
	int var_02A7C;	//  0x02A7C
	int var_02A80;	//  0x02A80
	int var_02A84;	//  0x02A84
	int var_02A88;	//  0x02A88
	int var_02A8C;	//  0x02A8C
	int var_02A90;	//  0x02A90
	int var_02A94;	//  0x02A94
	int var_02A98;	//  0x02A98
	int var_02A9C;	//  0x02A9C
	int var_02AA0;	//  0x02AA0
	int var_02AA4;	//  0x02AA4
	int var_02AA8;	//  0x02AA8
	int var_02AAC;	//  0x02AAC
	int var_02AB0;	//  0x02AB0
	int var_02AB4;	//  0x02AB4
	int var_02AB8;	//  0x02AB8
	int var_02ABC;	//  0x02ABC
	int var_02AC0;	//  0x02AC0
	int var_02AC4;	//  0x02AC4
	int var_02AC8;	//  0x02AC8
	int var_02ACC;	//  0x02ACC
	int var_02AD0;	//  0x02AD0
	int var_02AD4;	//  0x02AD4
	int var_02AD8;	//  0x02AD8
	int var_02ADC;	//  0x02ADC
	int var_02AE0;	//  0x02AE0
	int var_02AE4;	//  0x02AE4
	int var_02AE8;	//  0x02AE8
	int var_02AEC;	//  0x02AEC
	int var_02AF0;	//  0x02AF0
	int var_02AF4;	//  0x02AF4
	int var_02AF8;	//  0x02AF8
	int var_02AFC;	//  0x02AFC
	int var_02B00;	//  0x02B00
	int var_02B04;	//  0x02B04
	int var_02B08;	//  0x02B08
	int var_02B0C;	//  0x02B0C
	int var_02B10;	//  0x02B10
	int var_02B14;	//  0x02B14
	int var_02B18;	//  0x02B18
	int var_02B1C;	//  0x02B1C
	int var_02B20;	//  0x02B20
	int var_02B24;	//  0x02B24
	int var_02B28;	//  0x02B28
	int var_02B2C;	//  0x02B2C
	int var_02B30;	//  0x02B30
	int var_02B34;	//  0x02B34
	int var_02B38;	//  0x02B38
	int var_02B3C;	//  0x02B3C
	int var_02B40;	//  0x02B40
	int var_02B44;	//  0x02B44
	int var_02B48;	//  0x02B48
	int var_02B4C;	//  0x02B4C
	int var_02B50;	//  0x02B50
	int var_02B54;	//  0x02B54
	int var_02B58;	//  0x02B58
	int var_02B5C;	//  0x02B5C
	int var_02B60;	//  0x02B60
	int var_02B64;	//  0x02B64
	int var_02B68;	//  0x02B68
	int var_02B6C;	//  0x02B6C
	int var_02B70;	//  0x02B70
	int var_02B74;	//  0x02B74
	int var_02B78;	//  0x02B78
	int var_02B7C;	//  0x02B7C
	int var_02B80;	//  0x02B80
	int var_02B84;	//  0x02B84
	int var_02B88;	//  0x02B88
	int var_02B8C;	//  0x02B8C
	int var_02B90;	//  0x02B90
	int var_02B94;	//  0x02B94
	int var_02B98;	//  0x02B98
	int var_02B9C;	//  0x02B9C
	int var_02BA0;	//  0x02BA0
	int var_02BA4;	//  0x02BA4
	int var_02BA8;	//  0x02BA8
	int var_02BAC;	//  0x02BAC
	int var_02BB0;	//  0x02BB0
	int var_02BB4;	//  0x02BB4
	int var_02BB8;	//  0x02BB8
	int var_02BBC;	//  0x02BBC
	int var_02BC0;	//  0x02BC0
	int var_02BC4;	//  0x02BC4
	int var_02BC8;	//  0x02BC8
	int var_02BCC;	//  0x02BCC
	int var_02BD0;	//  0x02BD0
	int var_02BD4;	//  0x02BD4
	int var_02BD8;	//  0x02BD8
	int var_02BDC;	//  0x02BDC
	int var_02BE0;	//  0x02BE0
	int var_02BE4;	//  0x02BE4
	int var_02BE8;	//  0x02BE8
	int var_02BEC;	//  0x02BEC
	int var_02BF0;	//  0x02BF0
	int var_02BF4;	//  0x02BF4
	int var_02BF8;	//  0x02BF8
	int var_02BFC;	//  0x02BFC
	int var_02C00;	//  0x02C00
	int var_02C04;	//  0x02C04
	int var_02C08;	//  0x02C08
	int var_02C0C;	//  0x02C0C
	int var_02C10;	//  0x02C10
	int var_02C14;	//  0x02C14
	int var_02C18;	//  0x02C18
	int var_02C1C;	//  0x02C1C
	int var_02C20;	//  0x02C20
	int var_02C24;	//  0x02C24
	int var_02C28;	//  0x02C28
	int var_02C2C;	//  0x02C2C
	int var_02C30;	//  0x02C30
	int var_02C34;	//  0x02C34
	int var_02C38;	//  0x02C38
	int var_02C3C;	//  0x02C3C
	int var_02C40;	//  0x02C40
	int var_02C44;	//  0x02C44
	int var_02C48;	//  0x02C48
	int var_02C4C;	//  0x02C4C
	int var_02C50;	//  0x02C50
	int var_02C54;	//  0x02C54
	int var_02C58;	//  0x02C58
	int var_02C5C;	//  0x02C5C
	int var_02C60;	//  0x02C60
	int var_02C64;	//  0x02C64
	int var_02C68;	//  0x02C68
	int var_02C6C;	//  0x02C6C
	int var_02C70;	//  0x02C70
	int var_02C74;	//  0x02C74
	int var_02C78;	//  0x02C78
	int var_02C7C;	//  0x02C7C
	int var_02C80;	//  0x02C80
	int var_02C84;	//  0x02C84
	int var_02C88;	//  0x02C88
	int var_02C8C;	//  0x02C8C
	int var_02C90;	//  0x02C90
	int var_02C94;	//  0x02C94
	int var_02C98;	//  0x02C98
	int var_02C9C;	//  0x02C9C
	int var_02CA0;	//  0x02CA0
	int var_02CA4;	//  0x02CA4
	int var_02CA8;	//  0x02CA8
	int var_02CAC;	//  0x02CAC
	int var_02CB0;	//  0x02CB0
	int var_02CB4;	//  0x02CB4
	int var_02CB8;	//  0x02CB8
	int var_02CBC;	//  0x02CBC
	int var_02CC0;	//  0x02CC0
	int var_02CC4;	//  0x02CC4
	int var_02CC8;	//  0x02CC8
	int var_02CCC;	//  0x02CCC
	int var_02CD0;	//  0x02CD0
	int var_02CD4;	//  0x02CD4
	int var_02CD8;	//  0x02CD8
	int var_02CDC;	//  0x02CDC
	int var_02CE0;	//  0x02CE0
	int var_02CE4;	//  0x02CE4
	int var_02CE8;	//  0x02CE8
	int var_02CEC;	//  0x02CEC
	int var_02CF0;	//  0x02CF0
	int var_02CF4;	//  0x02CF4
	int var_02CF8;	//  0x02CF8
	int var_02CFC;	//  0x02CFC
	int var_02D00;	//  0x02D00
	int var_02D04;	//  0x02D04
	int var_02D08;	//  0x02D08
	int var_02D0C;	//  0x02D0C
	int var_02D10;	//  0x02D10
	int var_02D14;	//  0x02D14
	int var_02D18;	//  0x02D18
	int var_02D1C;	//  0x02D1C
	int var_02D20;	//  0x02D20
	int var_02D24;	//  0x02D24
	int var_02D28;	//  0x02D28
	int var_02D2C;	//  0x02D2C
	int var_02D30;	//  0x02D30
	int var_02D34;	//  0x02D34
	int var_02D38;	//  0x02D38
	int var_02D3C;	//  0x02D3C
	int var_02D40;	//  0x02D40
	int var_02D44;	//  0x02D44
	int var_02D48;	//  0x02D48
	int var_02D4C;	//  0x02D4C
	int var_02D50;	//  0x02D50
	int var_02D54;	//  0x02D54
	int var_02D58;	//  0x02D58
	int var_02D5C;	//  0x02D5C
	int var_02D60;	//  0x02D60
	int var_02D64;	//  0x02D64
	int var_02D68;	//  0x02D68
	int var_02D6C;	//  0x02D6C
	int var_02D70;	//  0x02D70
	int var_02D74;	//  0x02D74
	int var_02D78;	//  0x02D78
	int var_02D7C;	//  0x02D7C
	int var_02D80;	//  0x02D80
	int var_02D84;	//  0x02D84
	int var_02D88;	//  0x02D88
	int var_02D8C;	//  0x02D8C
	int var_02D90;	//  0x02D90
	int var_02D94;	//  0x02D94
	int var_02D98;	//  0x02D98
	int var_02D9C;	//  0x02D9C
	int var_02DA0;	//  0x02DA0
	int var_02DA4;	//  0x02DA4
	int var_02DA8;	//  0x02DA8
	int var_02DAC;	//  0x02DAC
	int var_02DB0;	//  0x02DB0
	int var_02DB4;	//  0x02DB4
	int var_02DB8;	//  0x02DB8
	int var_02DBC;	//  0x02DBC
	int var_02DC0;	//  0x02DC0
	int var_02DC4;	//  0x02DC4
	int var_02DC8;	//  0x02DC8
	int var_02DCC;	//  0x02DCC
	int var_02DD0;	//  0x02DD0
	int var_02DD4;	//  0x02DD4
	int var_02DD8;	//  0x02DD8
	int var_02DDC;	//  0x02DDC
	int var_02DE0;	//  0x02DE0
	int var_02DE4;	//  0x02DE4
	int var_02DE8;	//  0x02DE8
	int var_02DEC;	//  0x02DEC
	int var_02DF0;	//  0x02DF0
	int var_02DF4;	//  0x02DF4
	int var_02DF8;	//  0x02DF8
	int var_02DFC;	//  0x02DFC
	int var_02E00;	//  0x02E00
	int var_02E04;	//  0x02E04
	int var_02E08;	//  0x02E08
	int var_02E0C;	//  0x02E0C
	int var_02E10;	//  0x02E10
	int var_02E14;	//  0x02E14
	int var_02E18;	//  0x02E18
	int var_02E1C;	//  0x02E1C
	int var_02E20;	//  0x02E20
	int var_02E24;	//  0x02E24
	int var_02E28;	//  0x02E28
	int var_02E2C;	//  0x02E2C
	int var_02E30;	//  0x02E30
	int var_02E34;	//  0x02E34
	int var_02E38;	//  0x02E38
	int var_02E3C;	//  0x02E3C
	int var_02E40;	//  0x02E40
	int var_02E44;	//  0x02E44
	int var_02E48;	//  0x02E48
	int var_02E4C;	//  0x02E4C
	int var_02E50;	//  0x02E50
	int var_02E54;	//  0x02E54
	int var_02E58;	//  0x02E58
	int var_02E5C;	//  0x02E5C
	int var_02E60;	//  0x02E60
	int var_02E64;	//  0x02E64
	int var_02E68;	//  0x02E68
	int var_02E6C;	//  0x02E6C
	int var_02E70;	//  0x02E70
	int var_02E74;	//  0x02E74
	int var_02E78;	//  0x02E78
	int var_02E7C;	//  0x02E7C
	int var_02E80;	//  0x02E80
	int var_02E84;	//  0x02E84
	int var_02E88;	//  0x02E88
	int var_02E8C;	//  0x02E8C
	int var_02E90;	//  0x02E90
	int var_02E94;	//  0x02E94
	int var_02E98;	//  0x02E98
	int var_02E9C;	//  0x02E9C
	int var_02EA0;	//  0x02EA0
	int var_02EA4;	//  0x02EA4
	int var_02EA8;	//  0x02EA8
	int var_02EAC;	//  0x02EAC
	int var_02EB0;	//  0x02EB0
	int var_02EB4;	//  0x02EB4
	int var_02EB8;	//  0x02EB8
	int var_02EBC;	//  0x02EBC
	int var_02EC0;	//  0x02EC0
	int var_02EC4;	//  0x02EC4
	int var_02EC8;	//  0x02EC8
	int var_02ECC;	//  0x02ECC
	int var_02ED0;	//  0x02ED0
	int var_02ED4;	//  0x02ED4
	int var_02ED8;	//  0x02ED8
	int var_02EDC;	//  0x02EDC
	int var_02EE0;	//  0x02EE0
	int var_02EE4;	//  0x02EE4
	int var_02EE8;	//  0x02EE8
	int var_02EEC;	//  0x02EEC
	int var_02EF0;	//  0x02EF0
	int var_02EF4;	//  0x02EF4
	int var_02EF8;	//  0x02EF8
	int var_02EFC;	//  0x02EFC
	int var_02F00;	//  0x02F00
	int var_02F04;	//  0x02F04
	int var_02F08;	//  0x02F08
	int var_02F0C;	//  0x02F0C
	int var_02F10;	//  0x02F10
	int var_02F14;	//  0x02F14
	int var_02F18;	//  0x02F18
	int var_02F1C;	//  0x02F1C
	int var_02F20;	//  0x02F20
	int var_02F24;	//  0x02F24
	int var_02F28;	//  0x02F28
	int var_02F2C;	//  0x02F2C
	int var_02F30;	//  0x02F30
	int var_02F34;	//  0x02F34
	int var_02F38;	//  0x02F38
	int var_02F3C;	//  0x02F3C
	int var_02F40;	//  0x02F40
	int var_02F44;	//  0x02F44
	int var_02F48;	//  0x02F48
	int var_02F4C;	//  0x02F4C
	int var_02F50;	//  0x02F50
	int var_02F54;	//  0x02F54
	int isLoggedChar;	//  0x02F58
	int var_02F5C;	//  0x02F5C
	int var_02F60;	//  0x02F60
	int var_02F64;	//  0x02F64
	int var_02F68;	//  0x02F68
	int var_02F6C;	//  0x02F6C
	int var_02F70;	//  0x02F70
	int var_02F74;	//  0x02F74
	int var_02F78;	//  0x02F78
	int var_02F7C;	//  0x02F7C
	int var_02F80;	//  0x02F80
	int var_02F84;	//  0x02F84
	EntityData SelectedEntity;	//  0x02F88
	eEntityTypes entityType;	//  0x02F8C
	int SelectedSkillSlot;	//  0x02F90 //é o id do slot de skill selecionado
	int var_02F94;	//  0x02F94
	int var_02F98;	//  0x02F98
	int var_02F9C;	//  0x02F9C
	int var_02FA0;	//  0x02FA0
	int var_02FA4;	//  0x02FA4
	int var_02FA8;	//  0x02FA8
	int var_02FAC;	//  0x02FAC
	int var_02FB0;	//  0x02FB0
	int var_02FB4;	//  0x02FB4
	int var_02FB8;	//  0x02FB8
	int var_02FBC;	//  0x02FBC
	int var_02FC0;	//  0x02FC0
	int var_02FC4;	//  0x02FC4
	int var_02FC8;	//  0x02FC8
	int var_02FCC;	//  0x02FCC
	int var_02FD0;	//  0x02FD0
	int var_02FD4;	//  0x02FD4
	char IsLeftBtnPressedInWorld;	//  0x02FD8
	char IsRightBtnPressedInWorld;	//  0x02FD9
	char var_02FDA;	//  0x02FD9
	char var_02FDV;	//  0x02FD9
	int var_02FDC;	//  0x02FDC
	int var_02FE0;	//  0x02FE0
	int var_02FE4;	//  0x02FE4
	int var_02FE8;	//  0x02FE8
	int var_02FEC;	//  0x02FEC
	int var_02FF0;	//  0x02FF0
	int var_02FF4;	//  0x02FF4
	int var_02FF8;	//  0x02FF8
	int var_02FFC;	//  0x02FFC
	int var_03000;	//  0x03000
	int var_03004;	//  0x03004
	int var_03008;	//  0x03008
	int var_0300C;	//  0x0300C
	int var_03010;	//  0x03010
	int var_03014;	//  0x03014
	int var_03018;	//  0x03018
	int var_0301C;	//  0x0301C
	int var_03020;	//  0x03020
	int var_03024;	//  0x03024
	int var_03028;	//  0x03028
	int var_0302C;	//  0x0302C
	int var_03030;	//  0x03030
	int var_03034;	//  0x03034
	int var_03038;	//  0x03038
	float maxZoom;	//  0x0303C
	float minZoom;	//  0x03040
	float fCameraDistance;	//  0x03044
	int var_03048;	//  0x03048
	int selectedMode;	//  0x0304C
	int var_03050;	//  0x03050
	int var_03054;	//  0x03054
	int var_03058;	//  0x03058
	int var_0305C;	//  0x0305C
	int iWorldIdxMinimap;	//  0x03060
	int var_03064;	//  0x03064
	int var_03068;	//  0x03068
	int var_0306C;	//  0x0306C
	int var_03070;	//  0x03070
	int var_03074;	//  0x03074
	int var_03078;	//  0x03078
	int var_0307C;	//  0x0307C
	int var_03080;	//  0x03080
	int var_03084;	//  0x03084
	int var_03088;	//  0x03088
	int var_0308C;	//  0x0308C
	int var_03090;	//  0x03090
	int var_03094;	//  0x03094
	int var_03098;	//  0x03098
	int var_0309C;	//  0x0309C
	int var_030A0;	//  0x030A0
	int var_030A4;	//  0x030A4
	int var_030A8;	//  0x030A8
	int var_030AC;	//  0x030AC
	int var_030B0;	//  0x030B0
	int var_030B4;	//  0x030B4
	int var_030B8;	//  0x030B8
	int var_030BC;	//  0x030BC
	int var_030C0;	//  0x030C0
	int var_030C4;	//  0x030C4
	int var_030C8;	//  0x030C8
	int var_030CC;	//  0x030CC
	int var_030D0;	//  0x030D0
	int var_030D4;	//  0x030D4
	int var_030D8;	//  0x030D8
	int var_030DC;	//  0x030DC
	int var_030E0;	//  0x030E0
	int var_030E4;	//  0x030E4
	int var_030E8;	//  0x030E8
	int var_030EC;	//  0x030EC
	int var_030F0;	//  0x030F0
	int var_030F4;	//  0x030F4
	int var_030F8;	//  0x030F8
	int var_030FC;	//  0x030FC
	int var_03100;	//  0x03100
	int var_03104;	//  0x03104
	int var_03108;	//  0x03108
	int var_0310C;	//  0x0310C
	int var_03110;	//  0x03110
	int var_03114;	//  0x03114
	int var_03118;	//  0x03118
	int var_0311C;	//  0x0311C
	int var_03120;	//  0x03120
	int var_03124;	//  0x03124
	int var_03128;	//  0x03128
	int var_0312C;	//  0x0312C
	int var_03130;	//  0x03130
	int var_03134;	//  0x03134
	int var_03138;	//  0x03138
	int var_0313C;	//  0x0313C
	int var_03140;	//  0x03140
	int var_03144;	//  0x03144
	int var_03148;	//  0x03148
	int var_0314C;	//  0x0314C
	int var_03150;	//  0x03150
	int var_03154;	//  0x03154
	int var_03158;	//  0x03158
	int var_0315C;	//  0x0315C
	int var_03160;	//  0x03160
	int var_03164;	//  0x03164
	int var_03168;	//  0x03168
	int var_0316C;	//  0x0316C
	int var_03170;	//  0x03170
	int var_03174;	//  0x03174
	int var_03178;	//  0x03178
	int var_0317C;	//  0x0317C
	int var_03180;	//  0x03180
	int var_03184;	//  0x03184
	int var_03188;	//  0x03188
	int var_0318C;	//  0x0318C
	int var_03190;	//  0x03190
	int var_03194;	//  0x03194
	int var_03198;	//  0x03198
	int var_0319C;	//  0x0319C
	int var_031A0;	//  0x031A0
	int var_031A4;	//  0x031A4
	int var_031A8;	//  0x031A8
	int var_031AC;	//  0x031AC
	int var_031B0;	//  0x031B0
	int var_031B4;	//  0x031B4
	int var_031B8;	//  0x031B8
	int var_031BC;	//  0x031BC
	int var_031C0;	//  0x031C0
	int var_031C4;	//  0x031C4
	int var_031C8;	//  0x031C8
	int var_031CC;	//  0x031CC
	int var_031D0;	//  0x031D0
	int var_031D4;	//  0x031D4
	int var_031D8;	//  0x031D8
	int var_031DC;	//  0x031DC
	int var_031E0;	//  0x031E0
	int var_031E4;	//  0x031E4
	int var_031E8;	//  0x031E8
	int var_031EC;	//  0x031EC
	int var_031F0;	//  0x031F0
	int var_031F4;	//  0x031F4
	int var_031F8;	//  0x031F8
	int var_031FC;	//  0x031FC
	int var_03200;	//  0x03200
	int var_03204;	//  0x03204
	int var_03208;	//  0x03208
	int var_0320C;	//  0x0320C
	int var_03210;	//  0x03210
	int var_03214;	//  0x03214
	int var_03218;	//  0x03218
	int var_0321C;	//  0x0321C
	int var_03220;	//  0x03220
	int var_03224;	//  0x03224
	int var_03228;	//  0x03228
	int var_0322C;	//  0x0322C
	int var_03230;	//  0x03230
	int var_03234;	//  0x03234
	int var_03238;	//  0x03238
	int var_0323C;	//  0x0323C
	int var_03240;	//  0x03240
	int var_03244;	//  0x03244
	int var_03248;	//  0x03248
	int var_0324C;	//  0x0324C
	int var_03250;	//  0x03250
	int var_03254;	//  0x03254
	int var_03258;	//  0x03258
	int var_0325C;	//  0x0325C
	int var_03260;	//  0x03260
	int var_03264;	//  0x03264
	int var_03268;	//  0x03268
	int var_0326C;	//  0x0326C
	int var_03270;	//  0x03270
	int var_03274;	//  0x03274
	int var_03278;	//  0x03278
	int var_0327C;	//  0x0327C
	int var_03280;	//  0x03280
	int var_03284;	//  0x03284
	int var_03288;	//  0x03288
	int var_0328C;	//  0x0328C
	int var_03290;	//  0x03290
	int var_03294;	//  0x03294
	int var_03298;	//  0x03298
	int var_0329C;	//  0x0329C
	int var_032A0;	//  0x032A0
	int var_032A4;	//  0x032A4
	int var_032A8;	//  0x032A8
	int var_032AC;	//  0x032AC
	int var_032B0;	//  0x032B0
	int var_032B4;	//  0x032B4
	int var_032B8;	//  0x032B8
	int var_032BC;	//  0x032BC
	int var_032C0;	//  0x032C0
	int var_032C4;	//  0x032C4
	int var_032C8;	//  0x032C8
	int var_032CC;	//  0x032CC
	int var_032D0;	//  0x032D0
	int var_032D4;	//  0x032D4
	int var_032D8;	//  0x032D8
	int var_032DC;	//  0x032DC
	int var_032E0;	//  0x032E0
	int var_032E4;	//  0x032E4
	int var_032E8;	//  0x032E8
	int var_032EC;	//  0x032EC
	int var_032F0;	//  0x032F0
	int var_032F4;	//  0x032F4
	int var_032F8;	//  0x032F8
	int var_032FC;	//  0x032FC
	int var_03300;	//  0x03300
	int var_03304;	//  0x03304
	int var_03308;	//  0x03308
	int var_0330C;	//  0x0330C
	int var_03310;	//  0x03310
	int var_03314;	//  0x03314
	int var_03318;	//  0x03318
	int var_0331C;	//  0x0331C
	int var_03320;	//  0x03320
	int var_03324;	//  0x03324
	int var_03328;	//  0x03328
	int var_0332C;	//  0x0332C
	int var_03330;	//  0x03330
	int var_03334;	//  0x03334
	int var_03338;	//  0x03338
	int var_0333C;	//  0x0333C
	int var_03340;	//  0x03340
	int var_03344;	//  0x03344
	int var_03348;	//  0x03348
	int var_0334C;	//  0x0334C
	int var_03350;	//  0x03350
	int var_03354;	//  0x03354
	int var_03358;	//  0x03358
	int var_0335C;	//  0x0335C
	int var_03360;	//  0x03360
	int var_03364;	//  0x03364
	int var_03368;	//  0x03368
	int var_0336C;	//  0x0336C
	int var_03370;	//  0x03370
	int var_03374;	//  0x03374
	int var_03378;	//  0x03378
	int var_0337C;	//  0x0337C
	int var_03380;	//  0x03380
	int var_03384;	//  0x03384
	int var_03388;	//  0x03388
	int var_0338C;	//  0x0338C
	int var_03390;	//  0x03390
	int var_03394;	//  0x03394
	int var_03398;	//  0x03398
	int var_0339C;	//  0x0339C
	int var_033A0;	//  0x033A0
	int var_033A4;	//  0x033A4
	int var_033A8;	//  0x033A8
	int var_033AC;	//  0x033AC
	int var_033B0;	//  0x033B0
	int var_033B4;	//  0x033B4
	int var_033B8;	//  0x033B8
	int var_033BC;	//  0x033BC
	int var_033C0;	//  0x033C0
	int var_033C4;	//  0x033C4
	int var_033C8;	//  0x033C8
	int var_033CC;	//  0x033CC
	int var_033D0;	//  0x033D0
	int var_033D4;	//  0x033D4
	int var_033D8;	//  0x033D8
	int var_033DC;	//  0x033DC
	int var_033E0;	//  0x033E0
	int var_033E4;	//  0x033E4
	int var_033E8;	//  0x033E8
	int var_033EC;	//  0x033EC
	int var_033F0;	//  0x033F0
	int var_033F4;	//  0x033F4
	int var_033F8;	//  0x033F8
	int var_033FC;	//  0x033FC
	int var_03400;	//  0x03400
	int var_03404;	//  0x03404
	int var_03408;	//  0x03408
	int var_0340C;	//  0x0340C
	int var_03410;	//  0x03410
	int var_03414;	//  0x03414
	int var_03418;	//  0x03418
	int var_0341C;	//  0x0341C
	int var_03420;	//  0x03420
	int var_03424;	//  0x03424
	int var_03428;	//  0x03428
	int var_0342C;	//  0x0342C
	int var_03430;	//  0x03430
	int var_03434;	//  0x03434
	int var_03438;	//  0x03438
	int var_0343C;	//  0x0343C
	int var_03440;	//  0x03440
	int var_03444;	//  0x03444
	int var_03448;	//  0x03448
	int var_0344C;	//  0x0344C
	int var_03450;	//  0x03450
	int var_03454;	//  0x03454
	int var_03458;	//  0x03458
	int var_0345C;	//  0x0345C
	int var_03460;	//  0x03460
	int var_03464;	//  0x03464
	int var_03468;	//  0x03468
	int var_0346C;	//  0x0346C
	int var_03470;	//  0x03470
	int var_03474;	//  0x03474
	int var_03478;	//  0x03478
	int var_0347C;	//  0x0347C
	int var_03480;	//  0x03480
	int var_03484;	//  0x03484
	int var_03488;	//  0x03488
	int var_0348C;	//  0x0348C
	int var_03490;	//  0x03490
	int var_03494;	//  0x03494
	int var_03498;	//  0x03498
	int var_0349C;	//  0x0349C
	int var_034A0;	//  0x034A0
	int var_034A4;	//  0x034A4
	int var_034A8;	//  0x034A8
	int var_034AC;	//  0x034AC
	int var_034B0;	//  0x034B0
	int var_034B4;	//  0x034B4
	int var_034B8;	//  0x034B8
	int var_034BC;	//  0x034BC
	int var_034C0;	//  0x034C0
	int var_034C4;	//  0x034C4
	int var_034C8;	//  0x034C8
	int var_034CC;	//  0x034CC
	int var_034D0;	//  0x034D0
	int var_034D4;	//  0x034D4
	int var_034D8;	//  0x034D8
	int var_034DC;	//  0x034DC
	int var_034E0;	//  0x034E0
	int var_034E4;	//  0x034E4
	int var_034E8;	//  0x034E8
	int var_034EC;	//  0x034EC
	int var_034F0;	//  0x034F0
	int var_034F4;	//  0x034F4
	int var_034F8;	//  0x034F8
	int var_034FC;	//  0x034FC
	int var_03500;	//  0x03500
	int var_03504;	//  0x03504
	int var_03508;	//  0x03508
	int var_0350C;	//  0x0350C
	int var_03510;	//  0x03510
	int var_03514;	//  0x03514
	int var_03518;	//  0x03518
	int var_0351C;	//  0x0351C
	int var_03520;	//  0x03520
	int var_03524;	//  0x03524
	int var_03528;	//  0x03528
	int var_0352C;	//  0x0352C
	int var_03530;	//  0x03530
	int var_03534;	//  0x03534
	int var_03538;	//  0x03538
	int var_0353C;	//  0x0353C
	int var_03540;	//  0x03540
	int var_03544;	//  0x03544
	int var_03548;	//  0x03548
	int var_0354C;	//  0x0354C
	int var_03550;	//  0x03550
	int var_03554;	//  0x03554
	int var_03558;	//  0x03558
	int var_0355C;	//  0x0355C
	int var_03560;	//  0x03560
	int var_03564;	//  0x03564
	int var_03568;	//  0x03568
	int var_0356C;	//  0x0356C
	int var_03570;	//  0x03570
	int var_03574;	//  0x03574
	int var_03578;	//  0x03578
	int var_0357C;	//  0x0357C
	int var_03580;	//  0x03580
	int var_03584;	//  0x03584
	int var_03588;	//  0x03588
	int var_0358C;	//  0x0358C
	int var_03590;	//  0x03590
	int var_03594;	//  0x03594
	int var_03598;	//  0x03598
	int var_0359C;	//  0x0359C
	int var_035A0;	//  0x035A0
	int var_035A4;	//  0x035A4
	int var_035A8;	//  0x035A8
	int var_035AC;	//  0x035AC
	int var_035B0;	//  0x035B0
	int var_035B4;	//  0x035B4
	int var_035B8;	//  0x035B8
	int var_035BC;	//  0x035BC
	int var_035C0;	//  0x035C0
	int var_035C4;	//  0x035C4
	int var_035C8;	//  0x035C8
	int var_035CC;	//  0x035CC
	int var_035D0;	//  0x035D0
	int var_035D4;	//  0x035D4
	int var_035D8;	//  0x035D8
	int var_035DC;	//  0x035DC
	int var_035E0;	//  0x035E0
	int var_035E4;	//  0x035E4
	int var_035E8;	//  0x035E8
	int var_035EC;	//  0x035EC
	int var_035F0;	//  0x035F0
	int var_035F4;	//  0x035F4
	int var_035F8;	//  0x035F8
	int var_035FC;	//  0x035FC
	int var_03600;	//  0x03600
	int var_03604;	//  0x03604
	int var_03608;	//  0x03608
	int var_0360C;	//  0x0360C
	int var_03610;	//  0x03610
	int var_03614;	//  0x03614
	int var_03618;	//  0x03618
	int var_0361C;	//  0x0361C
	int var_03620;	//  0x03620
	int var_03624;	//  0x03624
	int var_03628;	//  0x03628
	int var_0362C;	//  0x0362C
	int var_03630;	//  0x03630
	int var_03634;	//  0x03634
	int var_03638;	//  0x03638
	int var_0363C;	//  0x0363C
	int var_03640;	//  0x03640
	int var_03644;	//  0x03644
	int var_03648;	//  0x03648
	int var_0364C;	//  0x0364C
	int var_03650;	//  0x03650
	int var_03654;	//  0x03654
	int var_03658;	//  0x03658
	int var_0365C;	//  0x0365C
	int var_03660;	//  0x03660
	int var_03664;	//  0x03664
	int var_03668;	//  0x03668
	int var_0366C;	//  0x0366C
	int var_03670;	//  0x03670
	int var_03674;	//  0x03674
	int var_03678;	//  0x03678
	int var_0367C;	//  0x0367C
	int var_03680;	//  0x03680
	int var_03684;	//  0x03684
	int var_03688;	//  0x03688
	int var_0368C;	//  0x0368C
	int var_03690;	//  0x03690
	int var_03694;	//  0x03694
	int var_03698;	//  0x03698
	int var_0369C;	//  0x0369C
	int var_036A0;	//  0x036A0
	int var_036A4;	//  0x036A4
	int var_036A8;	//  0x036A8
	int var_036AC;	//  0x036AC
	int var_036B0;	//  0x036B0
	int var_036B4;	//  0x036B4
	int var_036B8;	//  0x036B8
	int var_036BC;	//  0x036BC
	int var_036C0;	//  0x036C0
	int var_036C4;	//  0x036C4
	int var_036C8;	//  0x036C8
	int var_036CC;	//  0x036CC
	int var_036D0;	//  0x036D0
	int var_036D4;	//  0x036D4
	int var_036D8;	//  0x036D8
	int var_036DC;	//  0x036DC
	int var_036E0;	//  0x036E0
	int var_036E4;	//  0x036E4
	int var_036E8;	//  0x036E8
	int var_036EC;	//  0x036EC
	int var_036F0;	//  0x036F0
	int var_036F4;	//  0x036F4
	int var_036F8;	//  0x036F8
	int var_036FC;	//  0x036FC
	int var_03700;	//  0x03700
	int var_03704;	//  0x03704
	int var_03708;	//  0x03708
	int var_0370C;	//  0x0370C
	int var_03710;	//  0x03710
	int var_03714;	//  0x03714
	int var_03718;	//  0x03718
	int var_0371C;	//  0x0371C
	int var_03720;	//  0x03720
	int var_03724;	//  0x03724
	int var_03728;	//  0x03728
	int var_0372C;	//  0x0372C
	int var_03730;	//  0x03730
	int var_03734;	//  0x03734
	int var_03738;	//  0x03738
	int var_0373C;	//  0x0373C
	int var_03740;	//  0x03740
	int var_03744;	//  0x03744
	int var_03748;	//  0x03748
	int var_0374C;	//  0x0374C
	int var_03750;	//  0x03750
	int var_03754;	//  0x03754
	int var_03758;	//  0x03758
	int var_0375C;	//  0x0375C
	int var_03760;	//  0x03760
	int var_03764;	//  0x03764
	int var_03768;	//  0x03768
	int var_0376C;	//  0x0376C
	int var_03770;	//  0x03770
	int var_03774;	//  0x03774
	int var_03778;	//  0x03778
	int var_0377C;	//  0x0377C
	int var_03780;	//  0x03780
	int var_03784;	//  0x03784
	int var_03788;	//  0x03788
	int var_0378C;	//  0x0378C
	int var_03790;	//  0x03790
	int var_03794;	//  0x03794
	int var_03798;	//  0x03798
	int var_0379C;	//  0x0379C
	int var_037A0;	//  0x037A0
	int var_037A4;	//  0x037A4
	int var_037A8;	//  0x037A8
	int var_037AC;	//  0x037AC
	int var_037B0;	//  0x037B0
	int var_037B4;	//  0x037B4
	int var_037B8;	//  0x037B8
	int var_037BC;	//  0x037BC
	int var_037C0;	//  0x037C0
	int var_037C4;	//  0x037C4
	int var_037C8;	//  0x037C8
	int var_037CC;	//  0x037CC
	int var_037D0;	//  0x037D0
	int var_037D4;	//  0x037D4
	int var_037D8;	//  0x037D8
	int var_037DC;	//  0x037DC
	int var_037E0;	//  0x037E0
	int var_037E4;	//  0x037E4
	int var_037E8;	//  0x037E8
	int var_037EC;	//  0x037EC
	int var_037F0;	//  0x037F0
	int var_037F4;	//  0x037F4
	int var_037F8;	//  0x037F8
	int var_037FC;	//  0x037FC
	int var_03800;	//  0x03800
	int var_03804;	//  0x03804
	int var_03808;	//  0x03808
	int var_0380C;	//  0x0380C
	int var_03810;	//  0x03810
	int var_03814;	//  0x03814
	int var_03818;	//  0x03818
	int var_0381C;	//  0x0381C
	int var_03820;	//  0x03820
	int var_03824;	//  0x03824
	int var_03828;	//  0x03828
	int var_0382C;	//  0x0382C
	int var_03830;	//  0x03830
	int var_03834;	//  0x03834
	int var_03838;	//  0x03838
	int var_0383C;	//  0x0383C
	int var_03840;	//  0x03840
	int var_03844;	//  0x03844
	int var_03848;	//  0x03848
	int var_0384C;	//  0x0384C
	int var_03850;	//  0x03850
	int var_03854;	//  0x03854
	int var_03858;	//  0x03858
	int var_0385C;	//  0x0385C
	int var_03860;	//  0x03860
	int var_03864;	//  0x03864
	int var_03868;	//  0x03868
	int var_0386C;	//  0x0386C
	int var_03870;	//  0x03870
	int var_03874;	//  0x03874
	int var_03878;	//  0x03878
	int var_0387C;	//  0x0387C
	int var_03880;	//  0x03880
	int var_03884;	//  0x03884
	int var_03888;	//  0x03888
	int var_0388C;	//  0x0388C
	int var_03890;	//  0x03890
	int var_03894;	//  0x03894
	int var_03898;	//  0x03898
	int var_0389C;	//  0x0389C
	int var_038A0;	//  0x038A0
	int var_038A4;	//  0x038A4
	int var_038A8;	//  0x038A8
	int var_038AC;	//  0x038AC
	int var_038B0;	//  0x038B0
	int var_038B4;	//  0x038B4
	int var_038B8;	//  0x038B8
	int var_038BC;	//  0x038BC
	int var_038C0;	//  0x038C0
	int var_038C4;	//  0x038C4
	int var_038C8;	//  0x038C8
	int var_038CC;	//  0x038CC
	int var_038D0;	//  0x038D0
	int var_038D4;	//  0x038D4
	int var_038D8;	//  0x038D8
	int var_038DC;	//  0x038DC
	int var_038E0;	//  0x038E0
	int var_038E4;	//  0x038E4
	int var_038E8;	//  0x038E8
	int var_038EC;	//  0x038EC
	int var_038F0;	//  0x038F0
	int var_038F4;	//  0x038F4
	int var_038F8;	//  0x038F8
	int var_038FC;	//  0x038FC
	int var_03900;	//  0x03900
	int var_03904;	//  0x03904
	int var_03908;	//  0x03908
	int var_0390C;	//  0x0390C
	int var_03910;	//  0x03910
	int var_03914;	//  0x03914
	int var_03918;	//  0x03918
	int var_0391C;	//  0x0391C
	int var_03920;	//  0x03920
	int var_03924;	//  0x03924
	int var_03928;	//  0x03928
	int var_0392C;	//  0x0392C
	int var_03930;	//  0x03930
	int var_03934;	//  0x03934
	int var_03938;	//  0x03938
	int var_0393C;	//  0x0393C
	int var_03940;	//  0x03940
	int var_03944;	//  0x03944
	int var_03948;	//  0x03948
	int var_0394C;	//  0x0394C
	int var_03950;	//  0x03950
	int var_03954;	//  0x03954
	int var_03958;	//  0x03958
	int var_0395C;	//  0x0395C
	int var_03960;	//  0x03960
	int var_03964;	//  0x03964
	int var_03968;	//  0x03968
	int var_0396C;	//  0x0396C
	int var_03970;	//  0x03970
	int var_03974;	//  0x03974
	int var_03978;	//  0x03978
	int var_0397C;	//  0x0397C
	int var_03980;	//  0x03980
	int var_03984;	//  0x03984
	int var_03988;	//  0x03988
	int var_0398C;	//  0x0398C
	int var_03990;	//  0x03990
	int var_03994;	//  0x03994
	int var_03998;	//  0x03998
	int var_0399C;	//  0x0399C
	int var_039A0;	//  0x039A0
	int var_039A4;	//  0x039A4
	int var_039A8;	//  0x039A8
	int var_039AC;	//  0x039AC
	int var_039B0;	//  0x039B0
	int var_039B4;	//  0x039B4
	int var_039B8;	//  0x039B8
	int var_039BC;	//  0x039BC
	int var_039C0;	//  0x039C0
	int var_039C4;	//  0x039C4
	int var_039C8;	//  0x039C8
	int var_039CC;	//  0x039CC
	int var_039D0;	//  0x039D0
	int var_039D4;	//  0x039D4
	int var_039D8;	//  0x039D8
	int var_039DC;	//  0x039DC
	int var_039E0;	//  0x039E0
	int var_039E4;	//  0x039E4
	int var_039E8;	//  0x039E8
	int var_039EC;	//  0x039EC
	int var_039F0;	//  0x039F0
	int var_039F4;	//  0x039F4
	int var_039F8;	//  0x039F8
	int var_039FC;	//  0x039FC
	int var_03A00;	//  0x03A00
	int var_03A04;	//  0x03A04
	int var_03A08;	//  0x03A08
	int var_03A0C;	//  0x03A0C
	int var_03A10;	//  0x03A10
	int var_03A14;	//  0x03A14
	int var_03A18;	//  0x03A18
	int var_03A1C;	//  0x03A1C
	int var_03A20;	//  0x03A20
	int var_03A24;	//  0x03A24
	int var_03A28;	//  0x03A28
	int var_03A2C;	//  0x03A2C
	int var_03A30;	//  0x03A30
	int var_03A34;	//  0x03A34
	int var_03A38;	//  0x03A38
	int var_03A3C;	//  0x03A3C
	int var_03A40;	//  0x03A40
	int var_03A44;	//  0x03A44
	int var_03A48;	//  0x03A48
	int var_03A4C;	//  0x03A4C
	int var_03A50;	//  0x03A50
	int var_03A54;	//  0x03A54
	int var_03A58;	//  0x03A58
	int var_03A5C;	//  0x03A5C
	int var_03A60;	//  0x03A60
	int var_03A64;	//  0x03A64
	int var_03A68;	//  0x03A68
	int var_03A6C;	//  0x03A6C
	int var_03A70;	//  0x03A70
	int var_03A74;	//  0x03A74
	int var_03A78;	//  0x03A78
	int var_03A7C;	//  0x03A7C
	int var_03A80;	//  0x03A80
	int var_03A84;	//  0x03A84
	int var_03A88;	//  0x03A88
	int var_03A8C;	//  0x03A8C
	int var_03A90;	//  0x03A90
	int var_03A94;	//  0x03A94
	int var_03A98;	//  0x03A98
	int var_03A9C;	//  0x03A9C
	int var_03AA0;	//  0x03AA0
	int var_03AA4;	//  0x03AA4
	int var_03AA8;	//  0x03AA8
	int var_03AAC;	//  0x03AAC
	int var_03AB0;	//  0x03AB0
	int var_03AB4;	//  0x03AB4
	int var_03AB8;	//  0x03AB8
	int var_03ABC;	//  0x03ABC
	int var_03AC0;	//  0x03AC0
	int var_03AC4;	//  0x03AC4
	int var_03AC8;	//  0x03AC8
	int var_03ACC;	//  0x03ACC
	int var_03AD0;	//  0x03AD0
	int var_03AD4;	//  0x03AD4
	int var_03AD8;	//  0x03AD8
	int var_03ADC;	//  0x03ADC
	int var_03AE0;	//  0x03AE0
	int var_03AE4;	//  0x03AE4
	int var_03AE8;	//  0x03AE8
	int var_03AEC;	//  0x03AEC
	int var_03AF0;	//  0x03AF0
	int var_03AF4;	//  0x03AF4
	int var_03AF8;	//  0x03AF8
	int var_03AFC;	//  0x03AFC
	int var_03B00;	//  0x03B00
	int var_03B04;	//  0x03B04
	int var_03B08;	//  0x03B08
	int var_03B0C;	//  0x03B0C
	int var_03B10;	//  0x03B10
	int var_03B14;	//  0x03B14
	int var_03B18;	//  0x03B18
	int var_03B1C;	//  0x03B1C
	int var_03B20;	//  0x03B20
	int var_03B24;	//  0x03B24
	int var_03B28;	//  0x03B28
	int var_03B2C;	//  0x03B2C
	int var_03B30;	//  0x03B30
	int var_03B34;	//  0x03B34
	int var_03B38;	//  0x03B38
	int var_03B3C;	//  0x03B3C
	int var_03B40;	//  0x03B40
	int var_03B44;	//  0x03B44
	int var_03B48;	//  0x03B48
	int var_03B4C;	//  0x03B4C
	int var_03B50;	//  0x03B50
	int var_03B54;	//  0x03B54
	int var_03B58;	//  0x03B58
	int var_03B5C;	//  0x03B5C
	int var_03B60;	//  0x03B60
	int var_03B64;	//  0x03B64
	int var_03B68;	//  0x03B68
	int var_03B6C;	//  0x03B6C
	int var_03B70;	//  0x03B70
	int var_03B74;	//  0x03B74
	int var_03B78;	//  0x03B78
	int var_03B7C;	//  0x03B7C
	int var_03B80;	//  0x03B80
	int var_03B84;	//  0x03B84
	int var_03B88;	//  0x03B88
	int var_03B8C;	//  0x03B8C
	int var_03B90;	//  0x03B90
	int var_03B94;	//  0x03B94
	int var_03B98;	//  0x03B98
	int var_03B9C;	//  0x03B9C
	int var_03BA0;	//  0x03BA0
	int var_03BA4;	//  0x03BA4
	int var_03BA8;	//  0x03BA8
	int var_03BAC;	//  0x03BAC
	int var_03BB0;	//  0x03BB0
	int var_03BB4;	//  0x03BB4
	int var_03BB8;	//  0x03BB8
	int var_03BBC;	//  0x03BBC
	int var_03BC0;	//  0x03BC0
	int var_03BC4;	//  0x03BC4
	int var_03BC8;	//  0x03BC8
	int var_03BCC;	//  0x03BCC
	int var_03BD0;	//  0x03BD0
	int var_03BD4;	//  0x03BD4
	int var_03BD8;	//  0x03BD8
	int var_03BDC;	//  0x03BDC
	int var_03BE0;	//  0x03BE0
	int var_03BE4;	//  0x03BE4
	int var_03BE8;	//  0x03BE8
	int var_03BEC;	//  0x03BEC
	int var_03BF0;	//  0x03BF0
	int var_03BF4;	//  0x03BF4
	int var_03BF8;	//  0x03BF8
	int var_03BFC;	//  0x03BFC
	int var_03C00;	//  0x03C00
	int var_03C04;	//  0x03C04
	int var_03C08;	//  0x03C08
	int var_03C0C;	//  0x03C0C
	int var_03C10;	//  0x03C10
	int var_03C14;	//  0x03C14
	int var_03C18;	//  0x03C18
	int var_03C1C;	//  0x03C1C
	int var_03C20;	//  0x03C20
	int var_03C24;	//  0x03C24
	int var_03C28;	//  0x03C28
	int var_03C2C;	//  0x03C2C
	int var_03C30;	//  0x03C30
	int var_03C34;	//  0x03C34
	int var_03C38;	//  0x03C38
	int var_03C3C;	//  0x03C3C
	int var_03C40;	//  0x03C40
	int var_03C44;	//  0x03C44
	int var_03C48;	//  0x03C48
	int var_03C4C;	//  0x03C4C
	int var_03C50;	//  0x03C50
	int var_03C54;	//  0x03C54
	int var_03C58;	//  0x03C58
	int var_03C5C;	//  0x03C5C
	int var_03C60;	//  0x03C60
	int var_03C64;	//  0x03C64
	int var_03C68;	//  0x03C68
	int var_03C6C;	//  0x03C6C
	int var_03C70;	//  0x03C70
	int var_03C74;	//  0x03C74
	int var_03C78;	//  0x03C78
	int var_03C7C;	//  0x03C7C
	int var_03C80;	//  0x03C80
	int var_03C84;	//  0x03C84
	int var_03C88;	//  0x03C88
	int var_03C8C;	//  0x03C8C
	int var_03C90;	//  0x03C90
	int var_03C94;	//  0x03C94
	int var_03C98;	//  0x03C98
	int var_03C9C;	//  0x03C9C
	int var_03CA0;	//  0x03CA0
	int var_03CA4;	//  0x03CA4
	int var_03CA8;	//  0x03CA8
	int var_03CAC;	//  0x03CAC
	int var_03CB0;	//  0x03CB0
	int var_03CB4;	//  0x03CB4
	int var_03CB8;	//  0x03CB8
	int var_03CBC;	//  0x03CBC
	int var_03CC0;	//  0x03CC0
	int var_03CC4;	//  0x03CC4
	int var_03CC8;	//  0x03CC8
	int var_03CCC;	//  0x03CCC
	int var_03CD0;	//  0x03CD0
	int var_03CD4;	//  0x03CD4
	int var_03CD8;	//  0x03CD8
	int var_03CDC;	//  0x03CDC
	int var_03CE0;	//  0x03CE0
	int var_03CE4;	//  0x03CE4
	int var_03CE8;	//  0x03CE8
	int var_03CEC;	//  0x03CEC
	int var_03CF0;	//  0x03CF0
	int var_03CF4;	//  0x03CF4
	int var_03CF8;	//  0x03CF8
	int var_03CFC;	//  0x03CFC
	int var_03D00;	//  0x03D00
	int var_03D04;	//  0x03D04
	int var_03D08;	//  0x03D08
	int var_03D0C;	//  0x03D0C
	int var_03D10;	//  0x03D10
	int var_03D14;	//  0x03D14
	int var_03D18;	//  0x03D18
	int var_03D1C;	//  0x03D1C
	int var_03D20;	//  0x03D20
	int var_03D24;	//  0x03D24
	int var_03D28;	//  0x03D28
	int var_03D2C;	//  0x03D2C
	int var_03D30;	//  0x03D30
	int var_03D34;	//  0x03D34
	int var_03D38;	//  0x03D38
	int var_03D3C;	//  0x03D3C
	int var_03D40;	//  0x03D40
	int var_03D44;	//  0x03D44
	int var_03D48;	//  0x03D48
	int var_03D4C;	//  0x03D4C
	int var_03D50;	//  0x03D50
	int var_03D54;	//  0x03D54
	int var_03D58;	//  0x03D58
	int var_03D5C;	//  0x03D5C
	int var_03D60;	//  0x03D60
	int var_03D64;	//  0x03D64
	int var_03D68;	//  0x03D68
	int var_03D6C;	//  0x03D6C
	int var_03D70;	//  0x03D70
	int var_03D74;	//  0x03D74
	int var_03D78;	//  0x03D78
	int var_03D7C;	//  0x03D7C
	int var_03D80;	//  0x03D80
	int var_03D84;	//  0x03D84
	int var_03D88;	//  0x03D88
	int var_03D8C;	//  0x03D8C
	int var_03D90;	//  0x03D90
	int var_03D94;	//  0x03D94
	int var_03D98;	//  0x03D98
	int var_03D9C;	//  0x03D9C
	int var_03DA0;	//  0x03DA0
	int var_03DA4;	//  0x03DA4
	int var_03DA8;	//  0x03DA8
	int var_03DAC;	//  0x03DAC
	int var_03DB0;	//  0x03DB0
	int var_03DB4;	//  0x03DB4
	int var_03DB8;	//  0x03DB8
	int var_03DBC;	//  0x03DBC
	int var_03DC0;	//  0x03DC0
	int var_03DC4;	//  0x03DC4
	int var_03DC8;	//  0x03DC8
	int var_03DCC;	//  0x03DCC
	int var_03DD0;	//  0x03DD0
	int var_03DD4;	//  0x03DD4
	int var_03DD8;	//  0x03DD8
	int var_03DDC;	//  0x03DDC
	int var_03DE0;	//  0x03DE0
	int var_03DE4;	//  0x03DE4
	int var_03DE8;	//  0x03DE8
	int var_03DEC;	//  0x03DEC
	int var_03DF0;	//  0x03DF0
	int var_03DF4;	//  0x03DF4
	int var_03DF8;	//  0x03DF8
	int var_03DFC;	//  0x03DFC
	int var_03E00;	//  0x03E00
	int var_03E04;	//  0x03E04
	int var_03E08;	//  0x03E08
	int var_03E0C;	//  0x03E0C
	int var_03E10;	//  0x03E10
	int var_03E14;	//  0x03E14
	int var_03E18;	//  0x03E18
	int var_03E1C;	//  0x03E1C
	int var_03E20;	//  0x03E20
	int var_03E24;	//  0x03E24
	int var_03E28;	//  0x03E28
	int var_03E2C;	//  0x03E2C
	int var_03E30;	//  0x03E30
	int var_03E34;	//  0x03E34
	int var_03E38;	//  0x03E38
	int var_03E3C;	//  0x03E3C
	int var_03E40;	//  0x03E40
	int var_03E44;	//  0x03E44
	int var_03E48;	//  0x03E48
	int var_03E4C;	//  0x03E4C
	int var_03E50;	//  0x03E50
	int var_03E54;	//  0x03E54
	int var_03E58;	//  0x03E58
	int var_03E5C;	//  0x03E5C
	int var_03E60;	//  0x03E60
	int var_03E64;	//  0x03E64
	int var_03E68;	//  0x03E68
	int var_03E6C;	//  0x03E6C
	int var_03E70;	//  0x03E70
	int var_03E74;	//  0x03E74
	int var_03E78;	//  0x03E78
	int var_03E7C;	//  0x03E7C
	int var_03E80;	//  0x03E80
	int var_03E84;	//  0x03E84
	int var_03E88;	//  0x03E88
	int var_03E8C;	//  0x03E8C
	int var_03E90;	//  0x03E90
	int var_03E94;	//  0x03E94
	int var_03E98;	//  0x03E98
	int var_03E9C;	//  0x03E9C
	int var_03EA0;	//  0x03EA0
	int var_03EA4;	//  0x03EA4
	int var_03EA8;	//  0x03EA8
	int var_03EAC;	//  0x03EAC
	int var_03EB0;	//  0x03EB0
	int var_03EB4;	//  0x03EB4
	int var_03EB8;	//  0x03EB8
	int var_03EBC;	//  0x03EBC
	int var_03EC0;	//  0x03EC0
	int var_03EC4;	//  0x03EC4
	int var_03EC8;	//  0x03EC8
	int var_03ECC;	//  0x03ECC
	int var_03ED0;	//  0x03ED0
	int var_03ED4;	//  0x03ED4
	int var_03ED8;	//  0x03ED8
	int var_03EDC;	//  0x03EDC
	int var_03EE0;	//  0x03EE0
	int var_03EE4;	//  0x03EE4
	int var_03EE8;	//  0x03EE8
	int var_03EEC;	//  0x03EEC
	int var_03EF0;	//  0x03EF0
	int var_03EF4;	//  0x03EF4
	int var_03EF8;	//  0x03EF8
	int var_03EFC;	//  0x03EFC
	int var_03F00;	//  0x03F00
	int var_03F04;	//  0x03F04
	int var_03F08;	//  0x03F08
	int var_03F0C;	//  0x03F0C
	int var_03F10;	//  0x03F10
	int var_03F14;	//  0x03F14
	int var_03F18;	//  0x03F18
	int var_03F1C;	//  0x03F1C
	int var_03F20;	//  0x03F20
	int var_03F24;	//  0x03F24
	int var_03F28;	//  0x03F28
	int var_03F2C;	//  0x03F2C
	int var_03F30;	//  0x03F30
	int var_03F34;	//  0x03F34
	int var_03F38;	//  0x03F38
	int var_03F3C;	//  0x03F3C
	int var_03F40;	//  0x03F40
	int var_03F44;	//  0x03F44
	int var_03F48;	//  0x03F48
	int var_03F4C;	//  0x03F4C
	int var_03F50;	//  0x03F50
	int var_03F54;	//  0x03F54
	int var_03F58;	//  0x03F58
	int var_03F5C;	//  0x03F5C
	int var_03F60;	//  0x03F60
	int var_03F64;	//  0x03F64
	int var_03F68;	//  0x03F68
	int var_03F6C;	//  0x03F6C
	int var_03F70;	//  0x03F70
	int var_03F74;	//  0x03F74
	int var_03F78;	//  0x03F78
	int var_03F7C;	//  0x03F7C
	int var_03F80;	//  0x03F80
	int var_03F84;	//  0x03F84
	int var_03F88;	//  0x03F88
	int var_03F8C;	//  0x03F8C
	int var_03F90;	//  0x03F90
	int var_03F94;	//  0x03F94
	int var_03F98;	//  0x03F98
	int var_03F9C;	//  0x03F9C
	int var_03FA0;	//  0x03FA0
	int var_03FA4;	//  0x03FA4
	int var_03FA8;	//  0x03FA8
	int var_03FAC;	//  0x03FAC
	int var_03FB0;	//  0x03FB0
	int var_03FB4;	//  0x03FB4
	int var_03FB8;	//  0x03FB8
	int var_03FBC;	//  0x03FBC
	int var_03FC0;	//  0x03FC0
	int var_03FC4;	//  0x03FC4
	int var_03FC8;	//  0x03FC8
	int var_03FCC;	//  0x03FCC
	int var_03FD0;	//  0x03FD0
	int var_03FD4;	//  0x03FD4
	int var_03FD8;	//  0x03FD8
	int var_03FDC;	//  0x03FDC
	int var_03FE0;	//  0x03FE0
	int var_03FE4;	//  0x03FE4
	int var_03FE8;	//  0x03FE8
	int var_03FEC;	//  0x03FEC
	int var_03FF0;	//  0x03FF0
	int var_03FF4;	//  0x03FF4
	int var_03FF8;	//  0x03FF8
	int var_03FFC;	//  0x03FFC
	int var_04000;	//  0x04000
	int var_04004;	//  0x04004
	int var_04008;	//  0x04008
	int var_0400C;	//  0x0400C
	int var_04010;	//  0x04010
	int var_04014;	//  0x04014
	int var_04018;	//  0x04018
	int var_0401C;	//  0x0401C
	int var_04020;	//  0x04020
	int var_04024;	//  0x04024
	int var_04028;	//  0x04028
	int var_0402C;	//  0x0402C
	int var_04030;	//  0x04030
	int var_04034;	//  0x04034
	int var_04038;	//  0x04038
	int var_0403C;	//  0x0403C
	int var_04040;	//  0x04040
	int var_04044;	//  0x04044
	int var_04048;	//  0x04048
	int var_0404C;	//  0x0404C
	int var_04050;	//  0x04050
	int var_04054;	//  0x04054
	int var_04058;	//  0x04058
	int var_0405C;	//  0x0405C
	int var_04060;	//  0x04060
	int var_04064;	//  0x04064
	int var_04068;	//  0x04068
	int var_0406C;	//  0x0406C
	int var_04070;	//  0x04070
	int var_04074;	//  0x04074
	int var_04078;	//  0x04078
	int var_0407C;	//  0x0407C
	int var_04080;	//  0x04080
	int var_04084;	//  0x04084
	int var_04088;	//  0x04088
	int var_0408C;	//  0x0408C
	int var_04090;	//  0x04090
	int var_04094;	//  0x04094
	int var_04098;	//  0x04098
	int var_0409C;	//  0x0409C
	int var_040A0;	//  0x040A0
	int var_040A4;	//  0x040A4
	int var_040A8;	//  0x040A8
	int var_040AC;	//  0x040AC
	int var_040B0;	//  0x040B0
	int var_040B4;	//  0x040B4
	int var_040B8;	//  0x040B8
	int var_040BC;	//  0x040BC
	int var_040C0;	//  0x040C0
	int var_040C4;	//  0x040C4
	int var_040C8;	//  0x040C8
	int var_040CC;	//  0x040CC
	int var_040D0;	//  0x040D0
	int var_040D4;	//  0x040D4
	int var_040D8;	//  0x040D8
	int var_040DC;	//  0x040DC
	int var_040E0;	//  0x040E0
	int var_040E4;	//  0x040E4
	int var_040E8;	//  0x040E8
	int var_040EC;	//  0x040EC
	int var_040F0;	//  0x040F0
	int var_040F4;	//  0x040F4
	int var_040F8;	//  0x040F8
	int var_040FC;	//  0x040FC
	int var_04100;	//  0x04100
	int var_04104;	//  0x04104
	int var_04108;	//  0x04108
	int var_0410C;	//  0x0410C
	int var_04110;	//  0x04110
	int var_04114;	//  0x04114
	int var_04118;	//  0x04118
	int var_0411C;	//  0x0411C
	int var_04120;	//  0x04120
	int var_04124;	//  0x04124
	int var_04128;	//  0x04128
	int var_0412C;	//  0x0412C
	int var_04130;	//  0x04130
	int var_04134;	//  0x04134
	int var_04138;	//  0x04138
	int var_0413C;	//  0x0413C
	int var_04140;	//  0x04140
	int var_04144;	//  0x04144
	int var_04148;	//  0x04148
	int var_0414C;	//  0x0414C
	int var_04150;	//  0x04150
	int var_04154;	//  0x04154
	int var_04158;	//  0x04158
	int var_0415C;	//  0x0415C
	int var_04160;	//  0x04160
	int var_04164;	//  0x04164
	int var_04168;	//  0x04168
	int var_0416C;	//  0x0416C
	int var_04170;	//  0x04170
	int var_04174;	//  0x04174
	int var_04178;	//  0x04178
	int var_0417C;	//  0x0417C
	int var_04180;	//  0x04180
	int var_04184;	//  0x04184
	int var_04188;	//  0x04188
	int var_0418C;	//  0x0418C
	int var_04190;	//  0x04190
	int var_04194;	//  0x04194
	int var_04198;	//  0x04198
	int var_0419C;	//  0x0419C
	int var_041A0;	//  0x041A0
	int var_041A4;	//  0x041A4
	int var_041A8;	//  0x041A8
	int var_041AC;	//  0x041AC
	int var_041B0;	//  0x041B0
	int var_041B4;	//  0x041B4
	int var_041B8;	//  0x041B8
	int var_041BC;	//  0x041BC
	int var_041C0;	//  0x041C0
	int var_041C4;	//  0x041C4
	int var_041C8;	//  0x041C8
	int var_041CC;	//  0x041CC
	int var_041D0;	//  0x041D0
	int var_041D4;	//  0x041D4
	int var_041D8;	//  0x041D8
	int var_041DC;	//  0x041DC
	int var_041E0;	//  0x041E0
	int var_041E4;	//  0x041E4
	int var_041E8;	//  0x041E8
	int var_041EC;	//  0x041EC
	int var_041F0;	//  0x041F0
	int var_041F4;	//  0x041F4
	int var_041F8;	//  0x041F8
	int var_041FC;	//  0x041FC
	int var_04200;	//  0x04200
	int var_04204;	//  0x04204
	int var_04208;	//  0x04208
	int var_0420C;	//  0x0420C
	int var_04210;	//  0x04210
	int var_04214;	//  0x04214
	int var_04218;	//  0x04218
	int var_0421C;	//  0x0421C
	int var_04220;	//  0x04220
	int var_04224;	//  0x04224
	int var_04228;	//  0x04228
	int var_0422C;	//  0x0422C
	int var_04230;	//  0x04230
	int var_04234;	//  0x04234
	int var_04238;	//  0x04238
	int var_0423C;	//  0x0423C
	int var_04240;	//  0x04240
	int var_04244;	//  0x04244
	int var_04248;	//  0x04248
	int var_0424C;	//  0x0424C
	int var_04250;	//  0x04250
	int var_04254;	//  0x04254
	int var_04258;	//  0x04258
	int var_0425C;	//  0x0425C
	int var_04260;	//  0x04260
	int var_04264;	//  0x04264
	int var_04268;	//  0x04268
	int var_0426C;	//  0x0426C
	int var_04270;	//  0x04270
	int var_04274;	//  0x04274
	int var_04278;	//  0x04278
	int var_0427C;	//  0x0427C
	int var_04280;	//  0x04280
	int var_04284;	//  0x04284
	int var_04288;	//  0x04288
	int var_0428C;	//  0x0428C
	int var_04290;	//  0x04290
	int var_04294;	//  0x04294
	int var_04298;	//  0x04298
	int var_0429C;	//  0x0429C
	int var_042A0;	//  0x042A0
	int var_042A4;	//  0x042A4
	int var_042A8;	//  0x042A8
	int var_042AC;	//  0x042AC
	int var_042B0;	//  0x042B0
	int var_042B4;	//  0x042B4
	int var_042B8;	//  0x042B8
	int var_042BC;	//  0x042BC
	int var_042C0;	//  0x042C0
	int var_042C4;	//  0x042C4
	int var_042C8;	//  0x042C8
	int var_042CC;	//  0x042CC
	int var_042D0;	//  0x042D0
	int var_042D4;	//  0x042D4
	int var_042D8;	//  0x042D8
	int var_042DC;	//  0x042DC
	int var_042E0;	//  0x042E0
	int var_042E4;	//  0x042E4
	int var_042E8;	//  0x042E8
	int var_042EC;	//  0x042EC
	int var_042F0;	//  0x042F0
	int var_042F4;	//  0x042F4
	int var_042F8;	//  0x042F8
	int var_042FC;	//  0x042FC
	int var_04300;	//  0x04300
	int var_04304;	//  0x04304
	int var_04308;	//  0x04308
	int var_0430C;	//  0x0430C
	int var_04310;	//  0x04310
	int var_04314;	//  0x04314
	int var_04318;	//  0x04318
	int var_0431C;	//  0x0431C
	int var_04320;	//  0x04320
	int var_04324;	//  0x04324
	int var_04328;	//  0x04328
	int var_0432C;	//  0x0432C
	int var_04330;	//  0x04330
	int var_04334;	//  0x04334
	int var_04338;	//  0x04338
	int var_0433C;	//  0x0433C
	int var_04340;	//  0x04340
	int var_04344;	//  0x04344
	int var_04348;	//  0x04348
	int var_0434C;	//  0x0434C
	int var_04350;	//  0x04350
	int var_04354;	//  0x04354
	int var_04358;	//  0x04358
	int var_0435C;	//  0x0435C
	int var_04360;	//  0x04360
	int var_04364;	//  0x04364
	int var_04368;	//  0x04368
	int var_0436C;	//  0x0436C
	int var_04370;	//  0x04370
	int var_04374;	//  0x04374
	int var_04378;	//  0x04378
	int var_0437C;	//  0x0437C
	int var_04380;	//  0x04380
	int var_04384;	//  0x04384
	int var_04388;	//  0x04388
	int var_0438C;	//  0x0438C
	int var_04390;	//  0x04390
	int var_04394;	//  0x04394
	int var_04398;	//  0x04398
	int var_0439C;	//  0x0439C
	int var_043A0;	//  0x043A0
	int var_043A4;	//  0x043A4
	int var_043A8;	//  0x043A8
	int var_043AC;	//  0x043AC
	int var_043B0;	//  0x043B0
	int var_043B4;	//  0x043B4
	int var_043B8;	//  0x043B8
	int var_043BC;	//  0x043BC
	int var_043C0;	//  0x043C0
	int var_043C4;	//  0x043C4
	int var_043C8;	//  0x043C8
	int var_043CC;	//  0x043CC
	int var_043D0;	//  0x043D0
	int var_043D4;	//  0x043D4
	int var_043D8;	//  0x043D8
	int var_043DC;	//  0x043DC
	int var_043E0;	//  0x043E0
	int var_043E4;	//  0x043E4
	int var_043E8;	//  0x043E8
	int var_043EC;	//  0x043EC
	int var_043F0;	//  0x043F0
	int var_043F4;	//  0x043F4
	int var_043F8;	//  0x043F8
	int var_043FC;	//  0x043FC
	int var_04400;	//  0x04400
	int var_04404;	//  0x04404
	int var_04408;	//  0x04408
	int var_0440C;	//  0x0440C
	int var_04410;	//  0x04410
	int var_04414;	//  0x04414
	int var_04418;	//  0x04418
	int var_0441C;	//  0x0441C
	int var_04420;	//  0x04420
	int var_04424;	//  0x04424
	int var_04428;	//  0x04428
	int var_0442C;	//  0x0442C
	int var_04430;	//  0x04430
	int var_04434;	//  0x04434
	int var_04438;	//  0x04438
	int var_0443C;	//  0x0443C
	int var_04440;	//  0x04440
	int var_04444;	//  0x04444
	int var_04448;	//  0x04448
	int var_0444C;	//  0x0444C
	int var_04450;	//  0x04450
	int var_04454;	//  0x04454
	int var_04458;	//  0x04458
	int var_0445C;	//  0x0445C
	int var_04460;	//  0x04460
	int var_04464;	//  0x04464
	int var_04468;	//  0x04468
	int var_0446C;	//  0x0446C
	int var_04470;	//  0x04470
	int var_04474;	//  0x04474
	int var_04478;	//  0x04478
	int var_0447C;	//  0x0447C
	int var_04480;	//  0x04480
	int var_04484;	//  0x04484
	int var_04488;	//  0x04488
	int var_0448C;	//  0x0448C
	int var_04490;	//  0x04490
	int var_04494;	//  0x04494
	int var_04498;	//  0x04498
	int var_0449C;	//  0x0449C
	int var_044A0;	//  0x044A0
	int var_044A4;	//  0x044A4
	int var_044A8;	//  0x044A8
	int var_044AC;	//  0x044AC
	int var_044B0;	//  0x044B0
	int var_044B4;	//  0x044B4
	int var_044B8;	//  0x044B8
	int var_044BC;	//  0x044BC
	int var_044C0;	//  0x044C0
	int var_044C4;	//  0x044C4
	int var_044C8;	//  0x044C8
	int var_044CC;	//  0x044CC
	int var_044D0;	//  0x044D0
	int var_044D4;	//  0x044D4
	int var_044D8;	//  0x044D8
	int var_044DC;	//  0x044DC
	int var_044E0;	//  0x044E0
	int var_044E4;	//  0x044E4
	int var_044E8;	//  0x044E8
	int var_044EC;	//  0x044EC
	int var_044F0;	//  0x044F0
	int var_044F4;	//  0x044F4
	int var_044F8;	//  0x044F8
	int var_044FC;	//  0x044FC
	int var_04500;	//  0x04500
	int var_04504;	//  0x04504
	int var_04508;	//  0x04508
	int var_0450C;	//  0x0450C
	int var_04510;	//  0x04510
	int var_04514;	//  0x04514
	int var_04518;	//  0x04518
	int var_0451C;	//  0x0451C
	int var_04520;	//  0x04520
	int var_04524;	//  0x04524
	int var_04528;	//  0x04528
	int var_0452C;	//  0x0452C
	int var_04530;	//  0x04530
	int var_04534;	//  0x04534
	int var_04538;	//  0x04538
	int var_0453C;	//  0x0453C
	int var_04540;	//  0x04540
	int var_04544;	//  0x04544
	int var_04548;	//  0x04548
	int var_0454C;	//  0x0454C
	int var_04550;	//  0x04550
	int var_04554;	//  0x04554
	int var_04558;	//  0x04558
	int var_0455C;	//  0x0455C
	int var_04560;	//  0x04560
	int var_04564;	//  0x04564
	int var_04568;	//  0x04568
	int var_0456C;	//  0x0456C
	int var_04570;	//  0x04570
	int var_04574;	//  0x04574
	int var_04578;	//  0x04578
	int var_0457C;	//  0x0457C
	int var_04580;	//  0x04580
	int var_04584;	//  0x04584
	int var_04588;	//  0x04588
	int var_0458C;	//  0x0458C
	int var_04590;	//  0x04590
	int var_04594;	//  0x04594
	int var_04598;	//  0x04598
	int var_0459C;	//  0x0459C
	int var_045A0;	//  0x045A0
	int var_045A4;	//  0x045A4
	int var_045A8;	//  0x045A8
	int var_045AC;	//  0x045AC
	int var_045B0;	//  0x045B0
	int var_045B4;	//  0x045B4
	int var_045B8;	//  0x045B8
	int var_045BC;	//  0x045BC
	int var_045C0;	//  0x045C0
	int var_045C4;	//  0x045C4
	int var_045C8;	//  0x045C8
	int var_045CC;	//  0x045CC
	int var_045D0;	//  0x045D0
	int var_045D4;	//  0x045D4
	int var_045D8;	//  0x045D8
	int var_045DC;	//  0x045DC
	int var_045E0;	//  0x045E0
	int var_045E4;	//  0x045E4
	int var_045E8;	//  0x045E8
	int var_045EC;	//  0x045EC
	int var_045F0;	//  0x045F0
	int var_045F4;	//  0x045F4
	int var_045F8;	//  0x045F8
	int var_045FC;	//  0x045FC
	int var_04600;	//  0x04600
	int var_04604;	//  0x04604
	int var_04608;	//  0x04608
	int var_0460C;	//  0x0460C
	int var_04610;	//  0x04610
	int var_04614;	//  0x04614
	int var_04618;	//  0x04618
	int var_0461C;	//  0x0461C
	int var_04620;	//  0x04620
	int var_04624;	//  0x04624
	int var_04628;	//  0x04628
	int var_0462C;	//  0x0462C
	int var_04630;	//  0x04630
	int var_04634;	//  0x04634
	int var_04638;	//  0x04638
	int var_0463C;	//  0x0463C
	int var_04640;	//  0x04640
	int var_04644;	//  0x04644
	int var_04648;	//  0x04648
	int var_0464C;	//  0x0464C
	int var_04650;	//  0x04650
	int var_04654;	//  0x04654
	int var_04658;	//  0x04658
	int var_0465C;	//  0x0465C
	int var_04660;	//  0x04660
	int var_04664;	//  0x04664
	int var_04668;	//  0x04668
	int var_0466C;	//  0x0466C
	int var_04670;	//  0x04670
	int var_04674;	//  0x04674
	int var_04678;	//  0x04678
	int var_0467C;	//  0x0467C
	int var_04680;	//  0x04680
	int var_04684;	//  0x04684
	int var_04688;	//  0x04688
	int var_0468C;	//  0x0468C
	int var_04690;	//  0x04690
	int var_04694;	//  0x04694
	int var_04698;	//  0x04698
	int var_0469C;	//  0x0469C
	int var_046A0;	//  0x046A0
	int var_046A4;	//  0x046A4
	int var_046A8;	//  0x046A8
	int var_046AC;	//  0x046AC
	int var_046B0;	//  0x046B0
	int var_046B4;	//  0x046B4
	int var_046B8;	//  0x046B8
	int var_046BC;	//  0x046BC
	int var_046C0;	//  0x046C0
	int var_046C4;	//  0x046C4
	int var_046C8;	//  0x046C8
	int var_046CC;	//  0x046CC
	int var_046D0;	//  0x046D0
	int var_046D4;	//  0x046D4
	int var_046D8;	//  0x046D8
	int var_046DC;	//  0x046DC
	int var_046E0;	//  0x046E0
	int var_046E4;	//  0x046E4
	int var_046E8;	//  0x046E8
	int var_046EC;	//  0x046EC
	int var_046F0;	//  0x046F0
	int var_046F4;	//  0x046F4
	int var_046F8;	//  0x046F8
	int var_046FC;	//  0x046FC
	int var_04700;	//  0x04700
	int var_04704;	//  0x04704
	int var_04708;	//  0x04708
	int var_0470C;	//  0x0470C
	int var_04710;	//  0x04710
	int var_04714;	//  0x04714
	int var_04718;	//  0x04718
	int var_0471C;	//  0x0471C
	int var_04720;	//  0x04720
	int var_04724;	//  0x04724
	int var_04728;	//  0x04728
	int var_0472C;	//  0x0472C
	int var_04730;	//  0x04730
	int var_04734;	//  0x04734
	int var_04738;	//  0x04738
	int var_0473C;	//  0x0473C
	int var_04740;	//  0x04740
	int var_04744;	//  0x04744
	int var_04748;	//  0x04748
	int var_0474C;	//  0x0474C
	int var_04750;	//  0x04750
	int var_04754;	//  0x04754
	int var_04758;	//  0x04758
	int var_0475C;	//  0x0475C
	int var_04760;	//  0x04760
	int var_04764;	//  0x04764
	int var_04768;	//  0x04768
	int var_0476C;	//  0x0476C
	int var_04770;	//  0x04770
	int var_04774;	//  0x04774
	int var_04778;	//  0x04778
	int var_0477C;	//  0x0477C
	int var_04780;	//  0x04780
	int var_04784;	//  0x04784
	int var_04788;	//  0x04788
	int var_0478C;	//  0x0478C
	int var_04790;	//  0x04790
	int var_04794;	//  0x04794
	int var_04798;	//  0x04798
	int var_0479C;	//  0x0479C
	int var_047A0;	//  0x047A0
	int var_047A4;	//  0x047A4
	int var_047A8;	//  0x047A8
	int var_047AC;	//  0x047AC
	int var_047B0;	//  0x047B0
	int var_047B4;	//  0x047B4
	int var_047B8;	//  0x047B8
	int var_047BC;	//  0x047BC
	int var_047C0;	//  0x047C0
	int var_047C4;	//  0x047C4
	int var_047C8;	//  0x047C8
	int var_047CC;	//  0x047CC
	int var_047D0;	//  0x047D0
	int var_047D4;	//  0x047D4
	int var_047D8;	//  0x047D8
	int var_047DC;	//  0x047DC
	int var_047E0;	//  0x047E0
	int var_047E4;	//  0x047E4
	int var_047E8;	//  0x047E8
	int var_047EC;	//  0x047EC
	int var_047F0;	//  0x047F0
	int var_047F4;	//  0x047F4
	int var_047F8;	//  0x047F8
	int var_047FC;	//  0x047FC
	int var_04800;	//  0x04800
	int var_04804;	//  0x04804
	int var_04808;	//  0x04808
	int var_0480C;	//  0x0480C
	int var_04810;	//  0x04810
	int var_04814;	//  0x04814
	int var_04818;	//  0x04818
	int var_0481C;	//  0x0481C
	int var_04820;	//  0x04820
	int var_04824;	//  0x04824
	int var_04828;	//  0x04828
	int var_0482C;	//  0x0482C
	int var_04830;	//  0x04830
	int var_04834;	//  0x04834
	int var_04838;	//  0x04838
	int var_0483C;	//  0x0483C
	int var_04840;	//  0x04840
	int var_04844;	//  0x04844
	int var_04848;	//  0x04848
	int var_0484C;	//  0x0484C
	int var_04850;	//  0x04850
	int var_04854;	//  0x04854
	int var_04858;	//  0x04858
	int var_0485C;	//  0x0485C
	int var_04860;	//  0x04860
	int var_04864;	//  0x04864
	int var_04868;	//  0x04868
	int var_0486C;	//  0x0486C
	int var_04870;	//  0x04870
	int var_04874;	//  0x04874
	int var_04878;	//  0x04878
	int var_0487C;	//  0x0487C
	int var_04880;	//  0x04880
	int var_04884;	//  0x04884
	int var_04888;	//  0x04888
	int var_0488C;	//  0x0488C
	int var_04890;	//  0x04890
	int var_04894;	//  0x04894
	int var_04898;	//  0x04898
	int var_0489C;	//  0x0489C
	int var_048A0;	//  0x048A0
	int var_048A4;	//  0x048A4
	int var_048A8;	//  0x048A8
	int var_048AC;	//  0x048AC
	int var_048B0;	//  0x048B0
	int var_048B4;	//  0x048B4
	int var_048B8;	//  0x048B8
	int var_048BC;	//  0x048BC
	int var_048C0;	//  0x048C0
	int var_048C4;	//  0x048C4
	int var_048C8;	//  0x048C8
	int var_048CC;	//  0x048CC
	int var_048D0;	//  0x048D0
	int var_048D4;	//  0x048D4
	int var_048D8;	//  0x048D8
	int var_048DC;	//  0x048DC
	int var_048E0;	//  0x048E0
	int var_048E4;	//  0x048E4
	int var_048E8;	//  0x048E8
	int var_048EC;	//  0x048EC
	int var_048F0;	//  0x048F0
	int var_048F4;	//  0x048F4
	int var_048F8;	//  0x048F8
	int var_048FC;	//  0x048FC
	int var_04900;	//  0x04900
	int var_04904;	//  0x04904
	int var_04908;	//  0x04908
	int var_0490C;	//  0x0490C
	int var_04910;	//  0x04910
	int var_04914;	//  0x04914
	int var_04918;	//  0x04918
	int var_0491C;	//  0x0491C
	int var_04920;	//  0x04920
	int var_04924;	//  0x04924
	int var_04928;	//  0x04928
	int var_0492C;	//  0x0492C
	int var_04930;	//  0x04930
	int var_04934;	//  0x04934
	int var_04938;	//  0x04938
	int var_0493C;	//  0x0493C
	int var_04940;	//  0x04940
	int var_04944;	//  0x04944
	int var_04948;	//  0x04948
	int var_0494C;	//  0x0494C
	int var_04950;	//  0x04950
	int var_04954;	//  0x04954
	int var_04958;	//  0x04958
	int var_0495C;	//  0x0495C
	int var_04960;	//  0x04960
	int var_04964;	//  0x04964
	int var_04968;	//  0x04968
	int var_0496C;	//  0x0496C
	int var_04970;	//  0x04970
	int var_04974;	//  0x04974
	int var_04978;	//  0x04978
	int var_0497C;	//  0x0497C
	int var_04980;	//  0x04980
	int var_04984;	//  0x04984
	int var_04988;	//  0x04988
	int var_0498C;	//  0x0498C
	int var_04990;	//  0x04990
	int var_04994;	//  0x04994
	int var_04998;	//  0x04998
	int var_0499C;	//  0x0499C
	int var_049A0;	//  0x049A0
	int var_049A4;	//  0x049A4
	int var_049A8;	//  0x049A8
	int var_049AC;	//  0x049AC
	int var_049B0;	//  0x049B0
	int var_049B4;	//  0x049B4
	int var_049B8;	//  0x049B8
	int var_049BC;	//  0x049BC
	int var_049C0;	//  0x049C0
	int var_049C4;	//  0x049C4
	int var_049C8;	//  0x049C8
	int var_049CC;	//  0x049CC
	int var_049D0;	//  0x049D0
	int var_049D4;	//  0x049D4
	int var_049D8;	//  0x049D8
	int var_049DC;	//  0x049DC
	int var_049E0;	//  0x049E0
	int var_049E4;	//  0x049E4
	int var_049E8;	//  0x049E8
	int var_049EC;	//  0x049EC
	int var_049F0;	//  0x049F0
	int var_049F4;	//  0x049F4
	int var_049F8;	//  0x049F8
	int var_049FC;	//  0x049FC
	int var_04A00;	//  0x04A00
	int var_04A04;	//  0x04A04
	int var_04A08;	//  0x04A08
	int var_04A0C;	//  0x04A0C
	int var_04A10;	//  0x04A10
	int var_04A14;	//  0x04A14
	int var_04A18;	//  0x04A18
	int var_04A1C;	//  0x04A1C
	int var_04A20;	//  0x04A20
	int var_04A24;	//  0x04A24
	int var_04A28;	//  0x04A28
	int var_04A2C;	//  0x04A2C
	int var_04A30;	//  0x04A30
	int var_04A34;	//  0x04A34
	int var_04A38;	//  0x04A38
	int var_04A3C;	//  0x04A3C
	int var_04A40;	//  0x04A40
	int var_04A44;	//  0x04A44
	int var_04A48;	//  0x04A48
	int var_04A4C;	//  0x04A4C
	int var_04A50;	//  0x04A50
	int var_04A54;	//  0x04A54
	int var_04A58;	//  0x04A58
	int var_04A5C;	//  0x04A5C
	int var_04A60;	//  0x04A60
	int var_04A64;	//  0x04A64
	int var_04A68;	//  0x04A68
	int var_04A6C;	//  0x04A6C
	int var_04A70;	//  0x04A70
	int var_04A74;	//  0x04A74
	int var_04A78;	//  0x04A78
	int var_04A7C;	//  0x04A7C
	int var_04A80;	//  0x04A80
	int var_04A84;	//  0x04A84
	int var_04A88;	//  0x04A88
	int var_04A8C;	//  0x04A8C
	int var_04A90;	//  0x04A90
	int var_04A94;	//  0x04A94
	int var_04A98;	//  0x04A98
	int var_04A9C;	//  0x04A9C
	int var_04AA0;	//  0x04AA0
	int var_04AA4;	//  0x04AA4
	int var_04AA8;	//  0x04AA8
	int var_04AAC;	//  0x04AAC
	int var_04AB0;	//  0x04AB0
	int var_04AB4;	//  0x04AB4
	int var_04AB8;	//  0x04AB8
	int var_04ABC;	//  0x04ABC
	int var_04AC0;	//  0x04AC0
	int var_04AC4;	//  0x04AC4
	int var_04AC8;	//  0x04AC8
	int var_04ACC;	//  0x04ACC
	int var_04AD0;	//  0x04AD0
	int var_04AD4;	//  0x04AD4
	int var_04AD8;	//  0x04AD8
	int var_04ADC;	//  0x04ADC
	int var_04AE0;	//  0x04AE0
	int var_04AE4;	//  0x04AE4
	int var_04AE8;	//  0x04AE8
	int var_04AEC;	//  0x04AEC
	int var_04AF0;	//  0x04AF0
	int var_04AF4;	//  0x04AF4
	int var_04AF8;	//  0x04AF8
	int var_04AFC;	//  0x04AFC
	int var_04B00;	//  0x04B00
	int var_04B04;	//  0x04B04
	int var_04B08;	//  0x04B08
	int var_04B0C;	//  0x04B0C
	int var_04B10;	//  0x04B10
	int var_04B14;	//  0x04B14
	int var_04B18;	//  0x04B18
	int var_04B1C;	//  0x04B1C
	int var_04B20;	//  0x04B20
	int var_04B24;	//  0x04B24
	int var_04B28;	//  0x04B28
	int var_04B2C;	//  0x04B2C
	int var_04B30;	//  0x04B30
	int var_04B34;	//  0x04B34
	int var_04B38;	//  0x04B38
	int var_04B3C;	//  0x04B3C
	int var_04B40;	//  0x04B40
	int var_04B44;	//  0x04B44
	int var_04B48;	//  0x04B48
	int var_04B4C;	//  0x04B4C
	int var_04B50;	//  0x04B50
	int var_04B54;	//  0x04B54
	int var_04B58;	//  0x04B58
	int var_04B5C;	//  0x04B5C
	int var_04B60;	//  0x04B60
	int var_04B64;	//  0x04B64
	int var_04B68;	//  0x04B68
	int var_04B6C;	//  0x04B6C
	int var_04B70;	//  0x04B70
	int var_04B74;	//  0x04B74
	int var_04B78;	//  0x04B78
	int var_04B7C;	//  0x04B7C
	int var_04B80;	//  0x04B80
	int var_04B84;	//  0x04B84
	int var_04B88;	//  0x04B88
	int var_04B8C;	//  0x04B8C
	int var_04B90;	//  0x04B90
	int var_04B94;	//  0x04B94
	int var_04B98;	//  0x04B98
	int var_04B9C;	//  0x04B9C
	int var_04BA0;	//  0x04BA0
	int var_04BA4;	//  0x04BA4
	int var_04BA8;	//  0x04BA8
	int var_04BAC;	//  0x04BAC
	int var_04BB0;	//  0x04BB0
	int var_04BB4;	//  0x04BB4
	int var_04BB8;	//  0x04BB8
	int var_04BBC;	//  0x04BBC
	int var_04BC0;	//  0x04BC0
	int var_04BC4;	//  0x04BC4
	int var_04BC8;	//  0x04BC8
	int var_04BCC;	//  0x04BCC
	int var_04BD0;	//  0x04BD0
	int var_04BD4;	//  0x04BD4
	int var_04BD8;	//  0x04BD8
	int var_04BDC;	//  0x04BDC
	int var_04BE0;	//  0x04BE0
	int var_04BE4;	//  0x04BE4
	int var_04BE8;	//  0x04BE8
	int var_04BEC;	//  0x04BEC
	int var_04BF0;	//  0x04BF0
	int var_04BF4;	//  0x04BF4
	int var_04BF8;	//  0x04BF8
	int var_04BFC;	//  0x04BFC
	int var_04C00;	//  0x04C00
	int var_04C04;	//  0x04C04
	int var_04C08;	//  0x04C08
	int var_04C0C;	//  0x04C0C
	int var_04C10;	//  0x04C10
	int var_04C14;	//  0x04C14
	int var_04C18;	//  0x04C18
	int var_04C1C;	//  0x04C1C
	int var_04C20;	//  0x04C20
	int var_04C24;	//  0x04C24
	int var_04C28;	//  0x04C28
	int var_04C2C;	//  0x04C2C
	int var_04C30;	//  0x04C30
	int var_04C34;	//  0x04C34
	int var_04C38;	//  0x04C38
	int var_04C3C;	//  0x04C3C
	int var_04C40;	//  0x04C40
	int var_04C44;	//  0x04C44
	int var_04C48;	//  0x04C48
	int var_04C4C;	//  0x04C4C
	int var_04C50;	//  0x04C50
	int var_04C54;	//  0x04C54
	int var_04C58;	//  0x04C58
	int var_04C5C;	//  0x04C5C
	int var_04C60;	//  0x04C60
	int var_04C64;	//  0x04C64
	int var_04C68;	//  0x04C68
	int var_04C6C;	//  0x04C6C
	int var_04C70;	//  0x04C70
	int var_04C74;	//  0x04C74
	int var_04C78;	//  0x04C78
	int var_04C7C;	//  0x04C7C
	int var_04C80;	//  0x04C80
	int var_04C84;	//  0x04C84
	int var_04C88;	//  0x04C88
	int var_04C8C;	//  0x04C8C
	int var_04C90;	//  0x04C90
	int var_04C94;	//  0x04C94
	int var_04C98;	//  0x04C98
	int var_04C9C;	//  0x04C9C
	int var_04CA0;	//  0x04CA0
	int var_04CA4;	//  0x04CA4
	int var_04CA8;	//  0x04CA8
	int var_04CAC;	//  0x04CAC
	int var_04CB0;	//  0x04CB0
	int var_04CB4;	//  0x04CB4
	int var_04CB8;	//  0x04CB8
	int var_04CBC;	//  0x04CBC
	int var_04CC0;	//  0x04CC0
	int var_04CC4;	//  0x04CC4
	int var_04CC8;	//  0x04CC8
	int var_04CCC;	//  0x04CCC
	int var_04CD0;	//  0x04CD0
	int var_04CD4;	//  0x04CD4
	int var_04CD8;	//  0x04CD8
	int var_04CDC;	//  0x04CDC
	int var_04CE0;	//  0x04CE0
	int var_04CE4;	//  0x04CE4
	int var_04CE8;	//  0x04CE8
	int var_04CEC;	//  0x04CEC
	int var_04CF0;	//  0x04CF0
	int var_04CF4;	//  0x04CF4
	int var_04CF8;	//  0x04CF8
	int var_04CFC;	//  0x04CFC
	int var_04D00;	//  0x04D00
	int var_04D04;	//  0x04D04
	int var_04D08;	//  0x04D08
	int var_04D0C;	//  0x04D0C
	int var_04D10;	//  0x04D10
	int var_04D14;	//  0x04D14
	int var_04D18;	//  0x04D18
	int var_04D1C;	//  0x04D1C
	int var_04D20;	//  0x04D20
	int var_04D24;	//  0x04D24
	int var_04D28;	//  0x04D28
	int var_04D2C;	//  0x04D2C
	int var_04D30;	//  0x04D30
	int var_04D34;	//  0x04D34
	int var_04D38;	//  0x04D38
	int var_04D3C;	//  0x04D3C
	int var_04D40;	//  0x04D40
	int var_04D44;	//  0x04D44
	int var_04D48;	//  0x04D48
	int var_04D4C;	//  0x04D4C
	int var_04D50;	//  0x04D50
	int var_04D54;	//  0x04D54
	int var_04D58;	//  0x04D58
	int var_04D5C;	//  0x04D5C
	int var_04D60;	//  0x04D60
	int var_04D64;	//  0x04D64
	int var_04D68;	//  0x04D68
	int var_04D6C;	//  0x04D6C
	int var_04D70;	//  0x04D70
	int var_04D74;	//  0x04D74
	int var_04D78;	//  0x04D78
	int var_04D7C;	//  0x04D7C
	int var_04D80;	//  0x04D80
	int var_04D84;	//  0x04D84
	int var_04D88;	//  0x04D88
	int var_04D8C;	//  0x04D8C
	int var_04D90;	//  0x04D90
	int var_04D94;	//  0x04D94
	int var_04D98;	//  0x04D98
	int var_04D9C;	//  0x04D9C
	int var_04DA0;	//  0x04DA0
	int var_04DA4;	//  0x04DA4
	int var_04DA8;	//  0x04DA8
	int var_04DAC;	//  0x04DAC
	int var_04DB0;	//  0x04DB0
	int var_04DB4;	//  0x04DB4
	int var_04DB8;	//  0x04DB8
	int var_04DBC;	//  0x04DBC
	int var_04DC0;	//  0x04DC0
	int var_04DC4;	//  0x04DC4
	int var_04DC8;	//  0x04DC8
	int var_04DCC;	//  0x04DCC
	int var_04DD0;	//  0x04DD0
	int var_04DD4;	//  0x04DD4
	int var_04DD8;	//  0x04DD8
	int var_04DDC;	//  0x04DDC
	int var_04DE0;	//  0x04DE0
	int var_04DE4;	//  0x04DE4
	int var_04DE8;	//  0x04DE8
	int var_04DEC;	//  0x04DEC
	int var_04DF0;	//  0x04DF0
	int var_04DF4;	//  0x04DF4
	int var_04DF8;	//  0x04DF8
	int var_04DFC;	//  0x04DFC
	int var_04E00;	//  0x04E00
	int var_04E04;	//  0x04E04
	int var_04E08;	//  0x04E08
	int var_04E0C;	//  0x04E0C
	int var_04E10;	//  0x04E10
	int var_04E14;	//  0x04E14
	int var_04E18;	//  0x04E18
	int var_04E1C;	//  0x04E1C
	int var_04E20;	//  0x04E20
	int var_04E24;	//  0x04E24
	int var_04E28;	//  0x04E28
	int var_04E2C;	//  0x04E2C
	int var_04E30;	//  0x04E30
	int var_04E34;	//  0x04E34
	int var_04E38;	//  0x04E38
	int var_04E3C;	//  0x04E3C
	int var_04E40;	//  0x04E40
	int var_04E44;	//  0x04E44
	int var_04E48;	//  0x04E48
	int var_04E4C;	//  0x04E4C
	int var_04E50;	//  0x04E50
	int var_04E54;	//  0x04E54
	int var_04E58;	//  0x04E58
	int var_04E5C;	//  0x04E5C
	int var_04E60;	//  0x04E60
	int var_04E64;	//  0x04E64
	int var_04E68;	//  0x04E68
	int var_04E6C;	//  0x04E6C
	int var_04E70;	//  0x04E70
	int var_04E74;	//  0x04E74
	int var_04E78;	//  0x04E78
	int var_04E7C;	//  0x04E7C
	int var_04E80;	//  0x04E80
	int var_04E84;	//  0x04E84
	int var_04E88;	//  0x04E88
	int var_04E8C;	//  0x04E8C
	int var_04E90;	//  0x04E90
	int var_04E94;	//  0x04E94
	int var_04E98;	//  0x04E98
	int var_04E9C;	//  0x04E9C
	int var_04EA0;	//  0x04EA0
	int var_04EA4;	//  0x04EA4
	int var_04EA8;	//  0x04EA8
	int var_04EAC;	//  0x04EAC
	int var_04EB0;	//  0x04EB0
	int var_04EB4;	//  0x04EB4
	int var_04EB8;	//  0x04EB8
	int var_04EBC;	//  0x04EBC
	int var_04EC0;	//  0x04EC0
	int var_04EC4;	//  0x04EC4
	int var_04EC8;	//  0x04EC8
	int var_04ECC;	//  0x04ECC
	int var_04ED0;	//  0x04ED0
	int var_04ED4;	//  0x04ED4
	int var_04ED8;	//  0x04ED8
	int var_04EDC;	//  0x04EDC
	int var_04EE0;	//  0x04EE0
	int var_04EE4;	//  0x04EE4
	int var_04EE8;	//  0x04EE8
	int var_04EEC;	//  0x04EEC
	int var_04EF0;	//  0x04EF0
	int var_04EF4;	//  0x04EF4
	int var_04EF8;	//  0x04EF8
	int var_04EFC;	//  0x04EFC
	int var_04F00;	//  0x04F00
	int var_04F04;	//  0x04F04
	int var_04F08;	//  0x04F08
	int var_04F0C;	//  0x04F0C
	int var_04F10;	//  0x04F10
	int var_04F14;	//  0x04F14
	int var_04F18;	//  0x04F18
	int var_04F1C;	//  0x04F1C
	int var_04F20;	//  0x04F20
	int var_04F24;	//  0x04F24
	int var_04F28;	//  0x04F28
	int var_04F2C;	//  0x04F2C
	int var_04F30;	//  0x04F30
	int var_04F34;	//  0x04F34
	int var_04F38;	//  0x04F38
	int var_04F3C;	//  0x04F3C
	int var_04F40;	//  0x04F40
	int var_04F44;	//  0x04F44
	int var_04F48;	//  0x04F48
	int var_04F4C;	//  0x04F4C
	int var_04F50;	//  0x04F50
	int var_04F54;	//  0x04F54
	int var_04F58;	//  0x04F58
	int var_04F5C;	//  0x04F5C
	int var_04F60;	//  0x04F60
	int var_04F64;	//  0x04F64
	int var_04F68;	//  0x04F68
	int var_04F6C;	//  0x04F6C
	int var_04F70;	//  0x04F70
	int var_04F74;	//  0x04F74
	int var_04F78;	//  0x04F78
	int var_04F7C;	//  0x04F7C
	int var_04F80;	//  0x04F80
	int var_04F84;	//  0x04F84
	int var_04F88;	//  0x04F88
	int var_04F8C;	//  0x04F8C
	int var_04F90;	//  0x04F90
	int var_04F94;	//  0x04F94
	int var_04F98;	//  0x04F98
	int var_04F9C;	//  0x04F9C
	int var_04FA0;	//  0x04FA0
	int var_04FA4;	//  0x04FA4
	int var_04FA8;	//  0x04FA8
	int var_04FAC;	//  0x04FAC
	int var_04FB0;	//  0x04FB0
	int var_04FB4;	//  0x04FB4
	int var_04FB8;	//  0x04FB8
	int var_04FBC;	//  0x04FBC
	int var_04FC0;	//  0x04FC0
	int var_04FC4;	//  0x04FC4
	int var_04FC8;	//  0x04FC8
	int var_04FCC;	//  0x04FCC
	int var_04FD0;	//  0x04FD0
	int var_04FD4;	//  0x04FD4
	int var_04FD8;	//  0x04FD8
	int var_04FDC;	//  0x04FDC
	int var_04FE0;	//  0x04FE0
	int var_04FE4;	//  0x04FE4
	int var_04FE8;	//  0x04FE8
	int var_04FEC;	//  0x04FEC
	int var_04FF0;	//  0x04FF0
	int var_04FF4;	//  0x04FF4
	int var_04FF8;	//  0x04FF8
	int var_04FFC;	//  0x04FFC
	int var_05000;	//  0x05000
	int var_05004;	//  0x05004
	int var_05008;	//  0x05008
	int var_0500C;	//  0x0500C
	int var_05010;	//  0x05010
	int var_05014;	//  0x05014
	int var_05018;	//  0x05018
	int var_0501C;	//  0x0501C
	int var_05020;	//  0x05020
	int var_05024;	//  0x05024
	int var_05028;	//  0x05028
	int var_0502C;	//  0x0502C
	int var_05030;	//  0x05030
	int var_05034;	//  0x05034
	int var_05038;	//  0x05038
	int var_0503C;	//  0x0503C
	int var_05040;	//  0x05040
	int var_05044;	//  0x05044
	int var_05048;	//  0x05048
	int var_0504C;	//  0x0504C
	int var_05050;	//  0x05050
	int var_05054;	//  0x05054
	int var_05058;	//  0x05058
	int var_0505C;	//  0x0505C
	int var_05060;	//  0x05060
	int var_05064;	//  0x05064
	int var_05068;	//  0x05068
	int var_0506C;	//  0x0506C
	int iWorldIdx;	//  0x05070
	int var_05074;	//  0x05074
	int var_05078;	//  0x05078
	int var_0507C;	//  0x0507C
	int var_05080;	//  0x05080
	int var_05084;	//  0x05084
	int var_05088;	//  0x05088
	int var_0508C;	//  0x0508C
	int var_05090;	//  0x05090
	int var_05094;	//  0x05094
	int var_05098;	//  0x05098
	int var_0509C;	//  0x0509C
	int var_050A0;	//  0x050A0
	int var_050A4;	//  0x050A4
	int var_050A8;	//  0x050A8
	int var_050AC;	//  0x050AC
	int var_050B0;	//  0x050B0
	int var_050B4;	//  0x050B4
	int var_050B8;	//  0x050B8
	int var_050BC;	//  0x050BC
	int var_050C0;	//  0x050C0
	int var_050C4;	//  0x050C4
	int var_050C8;	//  0x050C8
	int var_050CC;	//  0x050CC
	int var_050D0;	//  0x050D0
	int var_050D4;	//  0x050D4
	int var_050D8;	//  0x050D8
	int var_050DC;	//  0x050DC
	int var_050E0;	//  0x050E0
	int var_050E4;	//  0x050E4
	int var_050E8;	//  0x050E8
	int var_050EC;	//  0x050EC
	int var_050F0;	//  0x050F0
	int var_050F4;	//  0x050F4
	int var_050F8;	//  0x050F8
	int var_050FC;	//  0x050FC
	int var_05100;	//  0x05100
	int var_05104;	//  0x05104
	int var_05108;	//  0x05108
	int var_0510C;	//  0x0510C
	int var_05110;	//  0x05110
	int var_05114;	//  0x05114
	int var_05118;	//  0x05118
	int var_0511C;	//  0x0511C
	int var_05120;	//  0x05120
	int var_05124;	//  0x05124
	int var_05128;	//  0x05128
	int var_0512C;	//  0x0512C
	int var_05130;	//  0x05130
	int var_05134;	//  0x05134
	int var_05138;	//  0x05138
	int var_0513C;	//  0x0513C
	int var_05140;	//  0x05140
	int var_05144;	//  0x05144
	int var_05148;	//  0x05148
	int var_0514C;	//  0x0514C
	int var_05150;	//  0x05150
	int var_05154;	//  0x05154
	int var_05158;	//  0x05158
	int var_0515C;	//  0x0515C
	int var_05160;	//  0x05160
	int var_05164;	//  0x05164
	int var_05168;	//  0x05168
	int var_0516C;	//  0x0516C
	int var_05170;	//  0x05170
	int var_05174;	//  0x05174
	int var_05178;	//  0x05178
	int var_0517C;	//  0x0517C
	int var_05180;	//  0x05180
	int var_05184;	//  0x05184
	int var_05188;	//  0x05188
	int var_0518C;	//  0x0518C
	int var_05190;	//  0x05190
	int var_05194;	//  0x05194
	int var_05198;	//  0x05198
	int var_0519C;	//  0x0519C
	int var_051A0;	//  0x051A0
	int var_051A4;	//  0x051A4
	int var_051A8;	//  0x051A8
	int var_051AC;	//  0x051AC
	int var_051B0;	//  0x051B0
	int var_051B4;	//  0x051B4
	int var_051B8;	//  0x051B8
	int var_051BC;	//  0x051BC
	int var_051C0;	//  0x051C0
	int var_051C4;	//  0x051C4
	int var_051C8;	//  0x051C8
	int var_051CC;	//  0x051CC
	int var_051D0;	//  0x051D0
	int var_051D4;	//  0x051D4
	int var_051D8;	//  0x051D8
	int var_051DC;	//  0x051DC
	int var_051E0;	//  0x051E0
	int var_051E4;	//  0x051E4
	int var_051E8;	//  0x051E8
	int var_051EC;	//  0x051EC
	int var_051F0;	//  0x051F0
	int var_051F4;	//  0x051F4
	int var_051F8;	//  0x051F8
	int var_051FC;	//  0x051FC
	int var_05200;	//  0x05200
	int var_05204;	//  0x05204
	int var_05208;	//  0x05208
	int var_0520C;	//  0x0520C
	int var_05210;	//  0x05210
	int var_05214;	//  0x05214
	int var_05218;	//  0x05218
	int var_0521C;	//  0x0521C
	int var_05220;	//  0x05220
	int var_05224;	//  0x05224
	int var_05228;	//  0x05228
	int var_0522C;	//  0x0522C
	int var_05230;	//  0x05230
	int var_05234;	//  0x05234
	int var_05238;	//  0x05238
	int var_0523C;	//  0x0523C
	int var_05240;	//  0x05240
	int var_05244;	//  0x05244
	int var_05248;	//  0x05248
	int var_0524C;	//  0x0524C
	int var_05250;	//  0x05250
	int var_05254;	//  0x05254
	int var_05258;	//  0x05258
	int var_0525C;	//  0x0525C
	int var_05260;	//  0x05260
	int var_05264;	//  0x05264
	int var_05268;	//  0x05268
	int var_0526C;	//  0x0526C
	int var_05270;	//  0x05270
	int var_05274;	//  0x05274
	int var_05278;	//  0x05278
	int var_0527C;	//  0x0527C
	int var_05280;	//  0x05280
	int var_05284;	//  0x05284
	int var_05288;	//  0x05288
	int var_0528C;	//  0x0528C
	int var_05290;	//  0x05290
	int var_05294;	//  0x05294
	int var_05298;	//  0x05298
	int var_0529C;	//  0x0529C
	int var_052A0;	//  0x052A0
	int var_052A4;	//  0x052A4
	int var_052A8;	//  0x052A8
	int var_052AC;	//  0x052AC
	int var_052B0;	//  0x052B0
	int var_052B4;	//  0x052B4
	int var_052B8;	//  0x052B8
	int var_052BC;	//  0x052BC
	int var_052C0;	//  0x052C0
	int var_052C4;	//  0x052C4
	int var_052C8;	//  0x052C8
	int var_052CC;	//  0x052CC
	int var_052D0;	//  0x052D0
	int var_052D4;	//  0x052D4
	int var_052D8;	//  0x052D8
	int var_052DC;	//  0x052DC
	int var_052E0;	//  0x052E0
	int var_052E4;	//  0x052E4
	int var_052E8;	//  0x052E8
	int var_052EC;	//  0x052EC
	int var_052F0;	//  0x052F0
	int var_052F4;	//  0x052F4
	int var_052F8;	//  0x052F8
	int var_052FC;	//  0x052FC
	int var_05300;	//  0x05300
	int var_05304;	//  0x05304
	int var_05308;	//  0x05308
	int var_0530C;	//  0x0530C
	int var_05310;	//  0x05310
	int var_05314;	//  0x05314
	int var_05318;	//  0x05318
	int var_0531C;	//  0x0531C
	int var_05320;	//  0x05320
	int var_05324;	//  0x05324
	int var_05328;	//  0x05328
	int var_0532C;	//  0x0532C
	int var_05330;	//  0x05330
	int var_05334;	//  0x05334
	int var_05338;	//  0x05338
	int var_0533C;	//  0x0533C
	int var_05340;	//  0x05340
	int var_05344;	//  0x05344
	int var_05348;	//  0x05348
	int var_0534C;	//  0x0534C
	int var_05350;	//  0x05350
	int var_05354;	//  0x05354
	int var_05358;	//  0x05358
	int var_0535C;	//  0x0535C
	int var_05360;	//  0x05360
	int var_05364;	//  0x05364
	int var_05368;	//  0x05368
	int var_0536C;	//  0x0536C
	int var_05370;	//  0x05370
	int var_05374;	//  0x05374
	int var_05378;	//  0x05378
	int var_0537C;	//  0x0537C
	int var_05380;	//  0x05380
	int var_05384;	//  0x05384
	int var_05388;	//  0x05388
	int var_0538C;	//  0x0538C
	int var_05390;	//  0x05390
	int var_05394;	//  0x05394
	int var_05398;	//  0x05398
	int var_0539C;	//  0x0539C
	int var_053A0;	//  0x053A0
	int var_053A4;	//  0x053A4
	int var_053A8;	//  0x053A8
	int var_053AC;	//  0x053AC
	int var_053B0;	//  0x053B0
	int var_053B4;	//  0x053B4
	int var_053B8;	//  0x053B8
	int var_053BC;	//  0x053BC
	int var_053C0;	//  0x053C0
	int var_053C4;	//  0x053C4
	int var_053C8;	//  0x053C8
	int var_053CC;	//  0x053CC
	int var_053D0;	//  0x053D0
	int var_053D4;	//  0x053D4
	int var_053D8;	//  0x053D8
	int var_053DC;	//  0x053DC
	int var_053E0;	//  0x053E0
	int var_053E4;	//  0x053E4
	int var_053E8;	//  0x053E8
	int var_053EC;	//  0x053EC
	int var_053F0;	//  0x053F0
	int var_053F4;	//  0x053F4
	int var_053F8;	//  0x053F8
	int var_053FC;	//  0x053FC
	int var_05400;	//  0x05400
	int var_05404;	//  0x05404
	int var_05408;	//  0x05408
	int var_0540C;	//  0x0540C
	int var_05410;	//  0x05410
	int var_05414;	//  0x05414
	int var_05418;	//  0x05418
	int var_0541C;	//  0x0541C
	int var_05420;	//  0x05420
	int var_05424;	//  0x05424
	int var_05428;	//  0x05428
	int var_0542C;	//  0x0542C
	int var_05430;	//  0x05430
	int var_05434;	//  0x05434
	int var_05438;	//  0x05438
	int var_0543C;	//  0x0543C
	int var_05440;	//  0x05440
	int var_05444;	//  0x05444
	int var_05448;	//  0x05448
	int var_0544C;	//  0x0544C
	int var_05450;	//  0x05450
	int var_05454;	//  0x05454
	int var_05458;	//  0x05458
	int var_0545C;	//  0x0545C
	int var_05460;	//  0x05460
	int var_05464;	//  0x05464
	int var_05468;	//  0x05468
	int var_0546C;	//  0x0546C
	int var_05470;	//  0x05470
	int var_05474;	//  0x05474
	int var_05478;	//  0x05478
	int var_0547C;	//  0x0547C
	int var_05480;	//  0x05480
	int var_05484;	//  0x05484
	int var_05488;	//  0x05488
	int var_0548C;	//  0x0548C
	int var_05490;	//  0x05490
	int var_05494;	//  0x05494
	int var_05498;	//  0x05498
	int var_0549C;	//  0x0549C
	int var_054A0;	//  0x054A0
	int var_054A4;	//  0x054A4
	int var_054A8;	//  0x054A8
	int var_054AC;	//  0x054AC
	int var_054B0;	//  0x054B0
	int var_054B4;	//  0x054B4
	int var_054B8;	//  0x054B8
	int var_054BC;	//  0x054BC
	int var_054C0;	//  0x054C0
	int var_054C4;	//  0x054C4
	int var_054C8;	//  0x054C8
	int var_054CC;	//  0x054CC
	int var_054D0;	//  0x054D0
	int var_054D4;	//  0x054D4
	int var_054D8;	//  0x054D8
	int var_054DC;	//  0x054DC
	int var_054E0;	//  0x054E0
	int var_054E4;	//  0x054E4
	int var_054E8;	//  0x054E8
	int var_054EC;	//  0x054EC
	int var_054F0;	//  0x054F0
	int var_054F4;	//  0x054F4
	int var_054F8;	//  0x054F8
	int var_054FC;	//  0x054FC
	int var_05500;	//  0x05500
	int var_05504;	//  0x05504
	int var_05508;	//  0x05508
	int var_0550C;	//  0x0550C
	int var_05510;	//  0x05510
	int var_05514;	//  0x05514
	int var_05518;	//  0x05518
	int var_0551C;	//  0x0551C
	int var_05520;	//  0x05520
	int var_05524;	//  0x05524
	int var_05528;	//  0x05528
	int var_0552C;	//  0x0552C
	int var_05530;	//  0x05530
	int var_05534;	//  0x05534
	int var_05538;	//  0x05538
	int var_0553C;	//  0x0553C
	int var_05540;	//  0x05540
	int var_05544;	//  0x05544
	int var_05548;	//  0x05548
	int var_0554C;	//  0x0554C
	int var_05550;	//  0x05550
	int var_05554;	//  0x05554
	int var_05558;	//  0x05558
	int var_0555C;	//  0x0555C
	int var_05560;	//  0x05560
	int var_05564;	//  0x05564
	int var_05568;	//  0x05568
	int var_0556C;	//  0x0556C
	int var_05570;	//  0x05570
	int var_05574;	//  0x05574
	int var_05578;	//  0x05578
	int var_0557C;	//  0x0557C
	int var_05580;	//  0x05580
	int var_05584;	//  0x05584
	int var_05588;	//  0x05588
	int var_0558C;	//  0x0558C
	int var_05590;	//  0x05590
	int var_05594;	//  0x05594
	int var_05598;	//  0x05598
	int var_0559C;	//  0x0559C
	int var_055A0;	//  0x055A0
	int var_055A4;	//  0x055A4
	int var_055A8;	//  0x055A8
	int var_055AC;	//  0x055AC
	int var_055B0;	//  0x055B0
	int var_055B4;	//  0x055B4
	int var_055B8;	//  0x055B8
	int var_055BC;	//  0x055BC
	int var_055C0;	//  0x055C0
	int var_055C4;	//  0x055C4
	int var_055C8;	//  0x055C8
	int var_055CC;	//  0x055CC
	int var_055D0;	//  0x055D0
	int var_055D4;	//  0x055D4
	int var_055D8;	//  0x055D8
	int var_055DC;	//  0x055DC
	int var_055E0;	//  0x055E0
	int var_055E4;	//  0x055E4
	int var_055E8;	//  0x055E8
	int var_055EC;	//  0x055EC
	int var_055F0;	//  0x055F0
	int var_055F4;	//  0x055F4
	int var_055F8;	//  0x055F8
	int var_055FC;	//  0x055FC
	int var_05600;	//  0x05600
	int var_05604;	//  0x05604
	int var_05608;	//  0x05608
	int var_0560C;	//  0x0560C
	int var_05610;	//  0x05610
	int var_05614;	//  0x05614
	int var_05618;	//  0x05618
	int var_0561C;	//  0x0561C
	int var_05620;	//  0x05620
	int var_05624;	//  0x05624
	int var_05628;	//  0x05628
	int var_0562C;	//  0x0562C
	int var_05630;	//  0x05630
	int var_05634;	//  0x05634
	int var_05638;	//  0x05638
	int var_0563C;	//  0x0563C
	int var_05640;	//  0x05640
	int var_05644;	//  0x05644
	int var_05648;	//  0x05648
	int var_0564C;	//  0x0564C
	int var_05650;	//  0x05650
	int var_05654;	//  0x05654
	int var_05658;	//  0x05658
	int var_0565C;	//  0x0565C
	int var_05660;	//  0x05660
	int var_05664;	//  0x05664
	int var_05668;	//  0x05668
	int var_0566C;	//  0x0566C
	int var_05670;	//  0x05670
	int var_05674;	//  0x05674
	int var_05678;	//  0x05678
	int var_0567C;	//  0x0567C
	int var_05680;	//  0x05680
	int var_05684;	//  0x05684
	int var_05688;	//  0x05688
	int var_0568C;	//  0x0568C
	int var_05690;	//  0x05690
	int var_05694;	//  0x05694
	int var_05698;	//  0x05698
	int var_0569C;	//  0x0569C
	int var_056A0;	//  0x056A0
	int var_056A4;	//  0x056A4
	int var_056A8;	//  0x056A8
	int var_056AC;	//  0x056AC
	int var_056B0;	//  0x056B0
	int var_056B4;	//  0x056B4
	int var_056B8;	//  0x056B8
	int var_056BC;	//  0x056BC
	int var_056C0;	//  0x056C0
	int var_056C4;	//  0x056C4
	int var_056C8;	//  0x056C8
	int var_056CC;	//  0x056CC
	int var_056D0;	//  0x056D0
	int var_056D4;	//  0x056D4
	int var_056D8;	//  0x056D8
	int var_056DC;	//  0x056DC
	int var_056E0;	//  0x056E0
	int var_056E4;	//  0x056E4
	int var_056E8;	//  0x056E8
	int var_056EC;	//  0x056EC
	int var_056F0;	//  0x056F0
	int var_056F4;	//  0x056F4
	int var_056F8;	//  0x056F8
	int var_056FC;	//  0x056FC
	int var_05700;	//  0x05700
	int var_05704;	//  0x05704
	int var_05708;	//  0x05708
	int var_0570C;	//  0x0570C
	int var_05710;	//  0x05710
	int var_05714;	//  0x05714
	int var_05718;	//  0x05718
	int var_0571C;	//  0x0571C
	int var_05720;	//  0x05720
	int var_05724;	//  0x05724
	int var_05728;	//  0x05728
	int var_0572C;	//  0x0572C
	int var_05730;	//  0x05730
	int var_05734;	//  0x05734
	int var_05738;	//  0x05738
	int var_0573C;	//  0x0573C
	int var_05740;	//  0x05740
	int var_05744;	//  0x05744
	int var_05748;	//  0x05748
	int var_0574C;	//  0x0574C
	int var_05750;	//  0x05750
	int var_05754;	//  0x05754
	int var_05758;	//  0x05758
	int var_0575C;	//  0x0575C
	int var_05760;	//  0x05760
	int var_05764;	//  0x05764
	int var_05768;	//  0x05768
	int var_0576C;	//  0x0576C
	int var_05770;	//  0x05770
	char var_05774;	//  0x05774
	char var_05775;	//  0x05774
	char var_05776;	//  0x05774
	char disableCharacterAttack;	//  0x05774
	int var_05778;	//  0x05778
	int var_0577C;	//  0x0577C
	int var_05780;	//  0x05780
	int var_05784;	//  0x05784
	int var_05788;	//  0x05788
	int var_0578C;	//  0x0578C
	int var_05790;	//  0x05790
	int var_05794;	//  0x05794
	int var_05798;	//  0x05798
	int var_0579C;	//  0x0579C
	int var_057A0;	//  0x057A0
	int var_057A4;	//  0x057A4
	int var_057A8;	//  0x057A8
	int var_057AC;	//  0x057AC
	int var_057B0;	//  0x057B0
	int var_057B4;	//  0x057B4
	int var_057B8;	//  0x057B8
	int var_057BC;	//  0x057BC
	int var_057C0;	//  0x057C0
	int var_057C4;	//  0x057C4
	int var_057C8;	//  0x057C8
	int var_057CC;	//  0x057CC
	int var_057D0;	//  0x057D0
	int var_057D4;	//  0x057D4
	int var_057D8;	//  0x057D8
	int var_057DC;	//  0x057DC
	int var_057E0;	//  0x057E0
	int var_057E4;	//  0x057E4
	int var_057E8;	//  0x057E8
	int var_057EC;	//  0x057EC
	int var_057F0;	//  0x057F0
	int var_057F4;	//  0x057F4
	int var_057F8;	//  0x057F8
	int var_057FC;	//  0x057FC
	int var_05800;	//  0x05800
	int var_05804;	//  0x05804
	int var_05808;	//  0x05808
	int var_0580C;	//  0x0580C
	int var_05810;	//  0x05810
	int var_05814;	//  0x05814
	int var_05818;	//  0x05818
	int var_0581C;	//  0x0581C
	int var_05820;	//  0x05820
	int var_05824;	//  0x05824
	int var_05828;	//  0x05828
	int var_0582C;	//  0x0582C
	int var_05830;	//  0x05830
	int var_05834;	//  0x05834
	int var_05838;	//  0x05838
	int var_0583C;	//  0x0583C
	int var_05840;	//  0x05840
	int var_05844;	//  0x05844
	int var_05848;	//  0x05848
	int var_0584C;	//  0x0584C
	int var_05850;	//  0x05850
	int var_05854;	//  0x05854
	int var_05858;	//  0x05858
	int var_0585C;	//  0x0585C
	int var_05860;	//  0x05860
	int var_05864;	//  0x05864
	int var_05868;	//  0x05868
	int var_0586C;	//  0x0586C
	int var_05870;	//  0x05870
	int var_05874;	//  0x05874
	int var_05878;	//  0x05878
	int var_0587C;	//  0x0587C
	int var_05880;	//  0x05880
	int var_05884;	//  0x05884
	int var_05888;	//  0x05888
	int var_0588C;	//  0x0588C
	int var_05890;	//  0x05890
	int var_05894;	//  0x05894
	int var_05898;	//  0x05898
	int var_0589C;	//  0x0589C
	int var_058A0;	//  0x058A0
	int var_058A4;	//  0x058A4
	int var_058A8;	//  0x058A8
	int var_058AC;	//  0x058AC
	int var_058B0;	//  0x058B0
	int var_058B4;	//  0x058B4
	int var_058B8;	//  0x058B8
	int var_058BC;	//  0x058BC
	int var_058C0;	//  0x058C0
	int var_058C4;	//  0x058C4
	int var_058C8;	//  0x058C8
	int var_058CC;	//  0x058CC
	int var_058D0;	//  0x058D0
	int var_058D4;	//  0x058D4
	int var_058D8;	//  0x058D8
	int var_058DC;	//  0x058DC
	int var_058E0;	//  0x058E0
	int var_058E4;	//  0x058E4
	int var_058E8;	//  0x058E8
	int var_058EC;	//  0x058EC
	int var_058F0;	//  0x058F0
	int var_058F4;	//  0x058F4
	int var_058F8;	//  0x058F8
	int var_058FC;	//  0x058FC
	int var_05900;	//  0x05900
	int var_05904;	//  0x05904
	int var_05908;	//  0x05908
	int var_0590C;	//  0x0590C
	int var_05910;	//  0x05910
	int var_05914;	//  0x05914
	int var_05918;	//  0x05918
	int var_0591C;	//  0x0591C
	int var_05920;	//  0x05920
	int var_05924;	//  0x05924
	int var_05928;	//  0x05928
	int var_0592C;	//  0x0592C
	int var_05930;	//  0x05930
	int var_05934;	//  0x05934
	int var_05938;	//  0x05938
	int var_0593C;	//  0x0593C
	int var_05940;	//  0x05940
	int var_05944;	//  0x05944
	int var_05948;	//  0x05948
	int var_0594C;	//  0x0594C
	int var_05950;	//  0x05950
	int var_05954;	//  0x05954
	int var_05958;	//  0x05958
	int var_0595C;	//  0x0595C
	int var_05960;	//  0x05960
	int var_05964;	//  0x05964
	int var_05968;	//  0x05968
	int var_0596C;	//  0x0596C
	int var_05970;	//  0x05970
	int var_05974;	//  0x05974
	int var_05978;	//  0x05978
	int var_0597C;	//  0x0597C
	int var_05980;	//  0x05980
	int var_05984;	//  0x05984
	int var_05988;	//  0x05988
	int var_0598C;	//  0x0598C
	int var_05990;	//  0x05990
	int var_05994;	//  0x05994
	int var_05998;	//  0x05998
	int var_0599C;	//  0x0599C
	int var_059A0;	//  0x059A0
	int var_059A4;	//  0x059A4
	int var_059A8;	//  0x059A8
	int var_059AC;	//  0x059AC
	int var_059B0;	//  0x059B0
	int var_059B4;	//  0x059B4
	int var_059B8;	//  0x059B8
	int var_059BC;	//  0x059BC
	int var_059C0;	//  0x059C0
	int var_059C4;	//  0x059C4
	int var_059C8;	//  0x059C8
	int var_059CC;	//  0x059CC
	int var_059D0;	//  0x059D0
	int var_059D4;	//  0x059D4
	int var_059D8;	//  0x059D8
	int var_059DC;	//  0x059DC
	int var_059E0;	//  0x059E0
	int var_059E4;	//  0x059E4
	int var_059E8;	//  0x059E8
	int var_059EC;	//  0x059EC
	int var_059F0;	//  0x059F0
	int var_059F4;	//  0x059F4
	int var_059F8;	//  0x059F8
	int var_059FC;	//  0x059FC
	int var_05A00;	//  0x05A00
	int var_05A04;	//  0x05A04
	int var_05A08;	//  0x05A08
	int var_05A0C;	//  0x05A0C
	int var_05A10;	//  0x05A10
	int var_05A14;	//  0x05A14
	int var_05A18;	//  0x05A18
	int var_05A1C;	//  0x05A1C
	int var_05A20;	//  0x05A20
	int var_05A24;	//  0x05A24
	int var_05A28;	//  0x05A28
	int var_05A2C;	//  0x05A2C
	int var_05A30;	//  0x05A30
	int var_05A34;	//  0x05A34
	int var_05A38;	//  0x05A38
	int var_05A3C;	//  0x05A3C
	int var_05A40;	//  0x05A40
	int var_05A44;	//  0x05A44
	int var_05A48;	//  0x05A48
	int var_05A4C;	//  0x05A4C
	int var_05A50;	//  0x05A50
	int var_05A54;	//  0x05A54
	int var_05A58;	//  0x05A58
	int var_05A5C;	//  0x05A5C
	int var_05A60;	//  0x05A60
	int var_05A64;	//  0x05A64
	int var_05A68;	//  0x05A68
	int var_05A6C;	//  0x05A6C
	int var_05A70;	//  0x05A70
	int var_05A74;	//  0x05A74
	int var_05A78;	//  0x05A78
	int var_05A7C;	//  0x05A7C
	int var_05A80;	//  0x05A80
	int var_05A84;	//  0x05A84
	int var_05A88;	//  0x05A88
	int var_05A8C;	//  0x05A8C
	int var_05A90;	//  0x05A90
	int var_05A94;	//  0x05A94
	int var_05A98;	//  0x05A98
	int var_05A9C;	//  0x05A9C
	int var_05AA0;	//  0x05AA0
	int var_05AA4;	//  0x05AA4
	int var_05AA8;	//  0x05AA8
	int var_05AAC;	//  0x05AAC
	int var_05AB0;	//  0x05AB0
	int var_05AB4;	//  0x05AB4
	int var_05AB8;	//  0x05AB8
	int var_05ABC;	//  0x05ABC
	int var_05AC0;	//  0x05AC0
	int var_05AC4;	//  0x05AC4
	int var_05AC8;	//  0x05AC8
	int var_05ACC;	//  0x05ACC
	int var_05AD0;	//  0x05AD0
	int var_05AD4;	//  0x05AD4
	int var_05AD8;	//  0x05AD8
	int var_05ADC;	//  0x05ADC
	int var_05AE0;	//  0x05AE0
	int var_05AE4;	//  0x05AE4
	int var_05AE8;	//  0x05AE8
	int var_05AEC;	//  0x05AEC
	int var_05AF0;	//  0x05AF0
	int var_05AF4;	//  0x05AF4
	int var_05AF8;	//  0x05AF8
	int var_05AFC;	//  0x05AFC
	int var_05B00;	//  0x05B00
	int var_05B04;	//  0x05B04
	int var_05B08;	//  0x05B08
	int var_05B0C;	//  0x05B0C
	int var_05B10;	//  0x05B10
	int var_05B14;	//  0x05B14
	int var_05B18;	//  0x05B18
	int var_05B1C;	//  0x05B1C
	int var_05B20;	//  0x05B20
	int var_05B24;	//  0x05B24
	int var_05B28;	//  0x05B28
	int var_05B2C;	//  0x05B2C
	int var_05B30;	//  0x05B30
	int var_05B34;	//  0x05B34
	int var_05B38;	//  0x05B38
	int var_05B3C;	//  0x05B3C
	int var_05B40;	//  0x05B40
	int var_05B44;	//  0x05B44
	int var_05B48;	//  0x05B48
	int var_05B4C;	//  0x05B4C
	int var_05B50;	//  0x05B50
	int var_05B54;	//  0x05B54
	int var_05B58;	//  0x05B58
	int var_05B5C;	//  0x05B5C
	int var_05B60;	//  0x05B60
	int var_05B64;	//  0x05B64
	int var_05B68;	//  0x05B68
	int var_05B6C;	//  0x05B6C
	int var_05B70;	//  0x05B70
	int var_05B74;	//  0x05B74
	int var_05B78;	//  0x05B78
	int var_05B7C;	//  0x05B7C
	int var_05B80;	//  0x05B80
	int var_05B84;	//  0x05B84
	int var_05B88;	//  0x05B88
	int var_05B8C;	//  0x05B8C
	int var_05B90;	//  0x05B90
	int var_05B94;	//  0x05B94
	int var_05B98;	//  0x05B98
	int var_05B9C;	//  0x05B9C
	int var_05BA0;	//  0x05BA0
	int var_05BA4;	//  0x05BA4
	int var_05BA8;	//  0x05BA8
	int var_05BAC;	//  0x05BAC
	int var_05BB0;	//  0x05BB0
	int var_05BB4;	//  0x05BB4
	int var_05BB8;	//  0x05BB8
	int var_05BBC;	//  0x05BBC
	int var_05BC0;	//  0x05BC0
	int var_05BC4;	//  0x05BC4
	int var_05BC8;	//  0x05BC8
	int var_05BCC;	//  0x05BCC
	int var_05BD0;	//  0x05BD0
	int var_05BD4;	//  0x05BD4
	int var_05BD8;	//  0x05BD8
	int var_05BDC;	//  0x05BDC
	int var_05BE0;	//  0x05BE0
	int var_05BE4;	//  0x05BE4
	int var_05BE8;	//  0x05BE8
	int var_05BEC;	//  0x05BEC
	int var_05BF0;	//  0x05BF0
	int var_05BF4;	//  0x05BF4
	int var_05BF8;	//  0x05BF8
	int var_05BFC;	//  0x05BFC
	int var_05C00;	//  0x05C00
	int var_05C04;	//  0x05C04
	int var_05C08;	//  0x05C08
	int var_05C0C;	//  0x05C0C
	int var_05C10;	//  0x05C10
	int var_05C14;	//  0x05C14
	int var_05C18;	//  0x05C18
	int var_05C1C;	//  0x05C1C
	int var_05C20;	//  0x05C20
	int var_05C24;	//  0x05C24
	int var_05C28;	//  0x05C28
	int var_05C2C;	//  0x05C2C
	int var_05C30;	//  0x05C30
	int var_05C34;	//  0x05C34
	int var_05C38;	//  0x05C38
	int var_05C3C;	//  0x05C3C
	int var_05C40;	//  0x05C40
	int var_05C44;	//  0x05C44
	int var_05C48;	//  0x05C48
	int var_05C4C;	//  0x05C4C
	int var_05C50;	//  0x05C50
	int var_05C54;	//  0x05C54
	int var_05C58;	//  0x05C58
	int var_05C5C;	//  0x05C5C
	int var_05C60;	//  0x05C60
	int var_05C64;	//  0x05C64
	int var_05C68;	//  0x05C68
	int var_05C6C;	//  0x05C6C
	int var_05C70;	//  0x05C70
	int var_05C74;	//  0x05C74
	int var_05C78;	//  0x05C78
	int var_05C7C;	//  0x05C7C
	int var_05C80;	//  0x05C80
	int var_05C84;	//  0x05C84
	int var_05C88;	//  0x05C88
	int var_05C8C;	//  0x05C8C
	int var_05C90;	//  0x05C90
	int var_05C94;	//  0x05C94
	int var_05C98;	//  0x05C98
	int var_05C9C;	//  0x05C9C
	int var_05CA0;	//  0x05CA0
	int var_05CA4;	//  0x05CA4
	int var_05CA8;	//  0x05CA8
	int var_05CAC;	//  0x05CAC
	int var_05CB0;	//  0x05CB0
	int var_05CB4;	//  0x05CB4
	int var_05CB8;	//  0x05CB8
	int var_05CBC;	//  0x05CBC
	int var_05CC0;	//  0x05CC0
	int var_05CC4;	//  0x05CC4
	int var_05CC8;	//  0x05CC8
	int var_05CCC;	//  0x05CCC
	int var_05CD0;	//  0x05CD0
	int var_05CD4;	//  0x05CD4
	int var_05CD8;	//  0x05CD8
	int var_05CDC;	//  0x05CDC
	int var_05CE0;	//  0x05CE0
	int var_05CE4;	//  0x05CE4
	int var_05CE8;	//  0x05CE8
	int var_05CEC;	//  0x05CEC
	int var_05CF0;	//  0x05CF0
	int var_05CF4;	//  0x05CF4
	int var_05CF8;	//  0x05CF8
	int var_05CFC;	//  0x05CFC
	int var_05D00;	//  0x05D00
	int var_05D04;	//  0x05D04
	int var_05D08;	//  0x05D08
	int var_05D0C;	//  0x05D0C
	int var_05D10;	//  0x05D10
	int var_05D14;	//  0x05D14
	int var_05D18;	//  0x05D18
	int var_05D1C;	//  0x05D1C
	int var_05D20;	//  0x05D20
	int var_05D24;	//  0x05D24
	int var_05D28;	//  0x05D28
	int var_05D2C;	//  0x05D2C
	int var_05D30;	//  0x05D30
	int var_05D34;	//  0x05D34
	int var_05D38;	//  0x05D38
	int var_05D3C;	//  0x05D3C
	int var_05D40;	//  0x05D40
	int var_05D44;	//  0x05D44
	int var_05D48;	//  0x05D48
	int var_05D4C;	//  0x05D4C
	int var_05D50;	//  0x05D50
	int var_05D54;	//  0x05D54
	int var_05D58;	//  0x05D58
	int var_05D5C;	//  0x05D5C
	int var_05D60;	//  0x05D60
	int var_05D64;	//  0x05D64
	int var_05D68;	//  0x05D68
	int var_05D6C;	//  0x05D6C
	int var_05D70;	//  0x05D70
	int var_05D74;	//  0x05D74
	int var_05D78;	//  0x05D78
	int var_05D7C;	//  0x05D7C
	int var_05D80;	//  0x05D80
	int var_05D84;	//  0x05D84
	int var_05D88;	//  0x05D88
	int var_05D8C;	//  0x05D8C
	int var_05D90;	//  0x05D90
	int var_05D94;	//  0x05D94
	int var_05D98;	//  0x05D98
	int var_05D9C;	//  0x05D9C
	int var_05DA0;	//  0x05DA0
	int var_05DA4;	//  0x05DA4
	int var_05DA8;	//  0x05DA8
	int var_05DAC;	//  0x05DAC
	int var_05DB0;	//  0x05DB0
	int var_05DB4;	//  0x05DB4
	int var_05DB8;	//  0x05DB8
	int var_05DBC;	//  0x05DBC
	int var_05DC0;	//  0x05DC0
	int var_05DC4;	//  0x05DC4
	int var_05DC8;	//  0x05DC8
	int var_05DCC;	//  0x05DCC
	int var_05DD0;	//  0x05DD0
	int var_05DD4;	//  0x05DD4
	int var_05DD8;	//  0x05DD8
	int var_05DDC;	//  0x05DDC
	int var_05DE0;	//  0x05DE0
	int var_05DE4;	//  0x05DE4
	int var_05DE8;	//  0x05DE8
	int var_05DEC;	//  0x05DEC
	int var_05DF0;	//  0x05DF0
	int var_05DF4;	//  0x05DF4
	int var_05DF8;	//  0x05DF8
	int var_05DFC;	//  0x05DFC
	int var_05E00;	//  0x05E00
	int var_05E04;	//  0x05E04
	int var_05E08;	//  0x05E08
	int var_05E0C;	//  0x05E0C
	int var_05E10;	//  0x05E10
	int var_05E14;	//  0x05E14
	int var_05E18;	//  0x05E18
	int var_05E1C;	//  0x05E1C
	int var_05E20;	//  0x05E20
	int var_05E24;	//  0x05E24
	int var_05E28;	//  0x05E28
	int var_05E2C;	//  0x05E2C
	int var_05E30;	//  0x05E30
	int var_05E34;	//  0x05E34
	int var_05E38;	//  0x05E38
	int var_05E3C;	//  0x05E3C
	int var_05E40;	//  0x05E40
	int var_05E44;	//  0x05E44
	int var_05E48;	//  0x05E48
	int var_05E4C;	//  0x05E4C
	int var_05E50;	//  0x05E50
	int var_05E54;	//  0x05E54
	int var_05E58;	//  0x05E58
	int var_05E5C;	//  0x05E5C
	int var_05E60;	//  0x05E60
	int var_05E64;	//  0x05E64
	int var_05E68;	//  0x05E68
	int var_05E6C;	//  0x05E6C
	int var_05E70;	//  0x05E70
	int var_05E74;	//  0x05E74
	int var_05E78;	//  0x05E78
	int var_05E7C;	//  0x05E7C
	int var_05E80;	//  0x05E80
	int var_05E84;	//  0x05E84
	int var_05E88;	//  0x05E88
	int var_05E8C;	//  0x05E8C
	int var_05E90;	//  0x05E90
	int var_05E94;	//  0x05E94
	int var_05E98;	//  0x05E98
	int var_05E9C;	//  0x05E9C
	int var_05EA0;	//  0x05EA0
	int var_05EA4;	//  0x05EA4
	int var_05EA8;	//  0x05EA8
	int var_05EAC;	//  0x05EAC
	int var_05EB0;	//  0x05EB0
	int var_05EB4;	//  0x05EB4
	int var_05EB8;	//  0x05EB8
	int var_05EBC;	//  0x05EBC
	int var_05EC0;	//  0x05EC0
	int var_05EC4;	//  0x05EC4
	int var_05EC8;	//  0x05EC8
	int var_05ECC;	//  0x05ECC
	int var_05ED0;	//  0x05ED0
	int var_05ED4;	//  0x05ED4
	int var_05ED8;	//  0x05ED8
	int var_05EDC;	//  0x05EDC
	int var_05EE0;	//  0x05EE0
	int var_05EE4;	//  0x05EE4
	int var_05EE8;	//  0x05EE8
	int var_05EEC;	//  0x05EEC
	int var_05EF0;	//  0x05EF0
	int var_05EF4;	//  0x05EF4
	int var_05EF8;	//  0x05EF8
	int var_05EFC;	//  0x05EFC
	int var_05F00;	//  0x05F00
	int var_05F04;	//  0x05F04
	int var_05F08;	//  0x05F08
	int var_05F0C;	//  0x05F0C
	int var_05F10;	//  0x05F10
	int var_05F14;	//  0x05F14
	int var_05F18;	//  0x05F18
	int var_05F1C;	//  0x05F1C
	int var_05F20;	//  0x05F20
	int var_05F24;	//  0x05F24
	int var_05F28;	//  0x05F28
	int var_05F2C;	//  0x05F2C
	int var_05F30;	//  0x05F30
	int var_05F34;	//  0x05F34
	int var_05F38;	//  0x05F38
	int var_05F3C;	//  0x05F3C
	int var_05F40;	//  0x05F40
	int var_05F44;	//  0x05F44
	int var_05F48;	//  0x05F48
	int var_05F4C;	//  0x05F4C
	int var_05F50;	//  0x05F50
	int var_05F54;	//  0x05F54
	int var_05F58;	//  0x05F58
	int var_05F5C;	//  0x05F5C
	int var_05F60;	//  0x05F60
	int var_05F64;	//  0x05F64
	int var_05F68;	//  0x05F68
	int var_05F6C;	//  0x05F6C
	int var_05F70;	//  0x05F70
	int var_05F74;	//  0x05F74
	int var_05F78;	//  0x05F78
	int var_05F7C;	//  0x05F7C
	int var_05F80;	//  0x05F80
	int var_05F84;	//  0x05F84
	int var_05F88;	//  0x05F88
	int var_05F8C;	//  0x05F8C
	int var_05F90;	//  0x05F90
	int var_05F94;	//  0x05F94
	int var_05F98;	//  0x05F98
	int var_05F9C;	//  0x05F9C
	int var_05FA0;	//  0x05FA0
	int var_05FA4;	//  0x05FA4
	int var_05FA8;	//  0x05FA8
	int var_05FAC;	//  0x05FAC
	int var_05FB0;	//  0x05FB0
	int var_05FB4;	//  0x05FB4
	int var_05FB8;	//  0x05FB8
	int var_05FBC;	//  0x05FBC
	int var_05FC0;	//  0x05FC0
	int var_05FC4;	//  0x05FC4
	int var_05FC8;	//  0x05FC8
	int var_05FCC;	//  0x05FCC
	int var_05FD0;	//  0x05FD0
	int var_05FD4;	//  0x05FD4
	int var_05FD8;	//  0x05FD8
	int var_05FDC;	//  0x05FDC
	int var_05FE0;	//  0x05FE0
	int var_05FE4;	//  0x05FE4
	int var_05FE8;	//  0x05FE8
	int var_05FEC;	//  0x05FEC
	int var_05FF0;	//  0x05FF0
	int var_05FF4;	//  0x05FF4
	int var_05FF8;	//  0x05FF8
	int var_05FFC;	//  0x05FFC
	int var_06000;	//  0x06000
	int var_06004;	//  0x06004
	int var_06008;	//  0x06008
	int var_0600C;	//  0x0600C
	int var_06010;	//  0x06010
	int var_06014;	//  0x06014
	int var_06018;	//  0x06018
	int var_0601C;	//  0x0601C
	int var_06020;	//  0x06020
	int var_06024;	//  0x06024
	int var_06028;	//  0x06028
	int var_0602C;	//  0x0602C
	int var_06030;	//  0x06030
	int var_06034;	//  0x06034
	int var_06038;	//  0x06038
	int var_0603C;	//  0x0603C
	int var_06040;	//  0x06040
	int var_06044;	//  0x06044
	int var_06048;	//  0x06048
	int var_0604C;	//  0x0604C
	int var_06050;	//  0x06050
	int var_06054;	//  0x06054
	int var_06058;	//  0x06058
	int var_0605C;	//  0x0605C
	int var_06060;	//  0x06060
	int var_06064;	//  0x06064
	int var_06068;	//  0x06068
	int var_0606C;	//  0x0606C
	int var_06070;	//  0x06070
	int var_06074;	//  0x06074
	int var_06078;	//  0x06078
	int var_0607C;	//  0x0607C
	int var_06080;	//  0x06080
	int var_06084;	//  0x06084
	int var_06088;	//  0x06088
	int var_0608C;	//  0x0608C
	int var_06090;	//  0x06090
	int var_06094;	//  0x06094
	int var_06098;	//  0x06098
	int var_0609C;	//  0x0609C
	int var_060A0;	//  0x060A0
	int var_060A4;	//  0x060A4
	int var_060A8;	//  0x060A8
	int var_060AC;	//  0x060AC
	int var_060B0;	//  0x060B0
	int var_060B4;	//  0x060B4
	int var_060B8;	//  0x060B8
	int var_060BC;	//  0x060BC
	int var_060C0;	//  0x060C0
	int var_060C4;	//  0x060C4
	int var_060C8;	//  0x060C8
	int var_060CC;	//  0x060CC
	int var_060D0;	//  0x060D0
	int var_060D4;	//  0x060D4
	int var_060D8;	//  0x060D8
	int var_060DC;	//  0x060DC
	int var_060E0;	//  0x060E0
	int var_060E4;	//  0x060E4
	int var_060E8;	//  0x060E8
	int var_060EC;	//  0x060EC
	int var_060F0;	//  0x060F0
	int var_060F4;	//  0x060F4
	int var_060F8;	//  0x060F8
	int var_060FC;	//  0x060FC
	int var_06100;	//  0x06100
	int var_06104;	//  0x06104
	int var_06108;	//  0x06108
	int var_0610C;	//  0x0610C
	int var_06110;	//  0x06110
	int var_06114;	//  0x06114
	int var_06118;	//  0x06118
	int var_0611C;	//  0x0611C
	int var_06120;	//  0x06120
	int var_06124;	//  0x06124
	int var_06128;	//  0x06128
	int var_0612C;	//  0x0612C
	int var_06130;	//  0x06130
	int var_06134;	//  0x06134
	int var_06138;	//  0x06138
	int var_0613C;	//  0x0613C
	int var_06140;	//  0x06140
	int var_06144;	//  0x06144
	int var_06148;	//  0x06148
	int var_0614C;	//  0x0614C
	int var_06150;	//  0x06150
	int var_06154;	//  0x06154
	int var_06158;	//  0x06158
	int var_0615C;	//  0x0615C
	int var_06160;	//  0x06160
	int var_06164;	//  0x06164
	int var_06168;	//  0x06168
	int var_0616C;	//  0x0616C
	int var_06170;	//  0x06170
	int var_06174;	//  0x06174
	int var_06178;	//  0x06178
	int var_0617C;	//  0x0617C
	int var_06180;	//  0x06180
	int var_06184;	//  0x06184
	int var_06188;	//  0x06188
	int var_0618C;	//  0x0618C
	int var_06190;	//  0x06190
	int var_06194;	//  0x06194
	int var_06198;	//  0x06198
	int var_0619C;	//  0x0619C
	int var_061A0;	//  0x061A0
	int var_061A4;	//  0x061A4
	int var_061A8;	//  0x061A8
	int var_061AC;	//  0x061AC
	int var_061B0;	//  0x061B0
	int var_061B4;	//  0x061B4
	int var_061B8;	//  0x061B8
	int var_061BC;	//  0x061BC
	int var_061C0;	//  0x061C0
	int var_061C4;	//  0x061C4
	int var_061C8;	//  0x061C8
	int var_061CC;	//  0x061CC
	int var_061D0;	//  0x061D0
	int var_061D4;	//  0x061D4
	int var_061D8;	//  0x061D8
	int var_061DC;	//  0x061DC
	int var_061E0;	//  0x061E0
	int var_061E4;	//  0x061E4
	int var_061E8;	//  0x061E8
	int var_061EC;	//  0x061EC
	int var_061F0;	//  0x061F0
	int var_061F4;	//  0x061F4
	int var_061F8;	//  0x061F8
	int var_061FC;	//  0x061FC
	int var_06200;	//  0x06200
	int var_06204;	//  0x06204
	int var_06208;	//  0x06208
	int var_0620C;	//  0x0620C
	int var_06210;	//  0x06210
	int var_06214;	//  0x06214
	int var_06218;	//  0x06218
	int var_0621C;	//  0x0621C
	int var_06220;	//  0x06220
	int var_06224;	//  0x06224
	int var_06228;	//  0x06228
	int var_0622C;	//  0x0622C
	int var_06230;	//  0x06230
	int var_06234;	//  0x06234
	int var_06238;	//  0x06238
	int var_0623C;	//  0x0623C
	int var_06240;	//  0x06240
	int var_06244;	//  0x06244
	int var_06248;	//  0x06248
	int var_0624C;	//  0x0624C
	int var_06250;	//  0x06250
	int var_06254;	//  0x06254
	int var_06258;	//  0x06258
	int var_0625C;	//  0x0625C
	int var_06260;	//  0x06260
	int var_06264;	//  0x06264
	int var_06268;	//  0x06268
	int var_0626C;	//  0x0626C
	int var_06270;	//  0x06270
	int var_06274;	//  0x06274
	int var_06278;	//  0x06278
	int var_0627C;	//  0x0627C
	int var_06280;	//  0x06280
	int var_06284;	//  0x06284
	int var_06288;	//  0x06288
	int var_0628C;	//  0x0628C
	int var_06290;	//  0x06290
	int var_06294;	//  0x06294
	int var_06298;	//  0x06298
	int var_0629C;	//  0x0629C
	int var_062A0;	//  0x062A0
	int var_062A4;	//  0x062A4
	int var_062A8;	//  0x062A8
	int var_062AC;	//  0x062AC
	int var_062B0;	//  0x062B0
	int var_062B4;	//  0x062B4
	int var_062B8;	//  0x062B8
	int var_062BC;	//  0x062BC
	int var_062C0;	//  0x062C0
	int var_062C4;	//  0x062C4
	int var_062C8;	//  0x062C8
	int var_062CC;	//  0x062CC
	int var_062D0;	//  0x062D0
	int var_062D4;	//  0x062D4
	int var_062D8;	//  0x062D8
	int var_062DC;	//  0x062DC
	int var_062E0;	//  0x062E0
	int var_062E4;	//  0x062E4
	int var_062E8;	//  0x062E8
	int var_062EC;	//  0x062EC
	int var_062F0;	//  0x062F0
	int var_062F4;	//  0x062F4
	int var_062F8;	//  0x062F8
	int var_062FC;	//  0x062FC
	int var_06300;	//  0x06300
	int var_06304;	//  0x06304
	int var_06308;	//  0x06308
	int var_0630C;	//  0x0630C
	int var_06310;	//  0x06310
	int var_06314;	//  0x06314
	int var_06318;	//  0x06318
	int var_0631C;	//  0x0631C
	int var_06320;	//  0x06320
	int var_06324;	//  0x06324
	int var_06328;	//  0x06328
	int var_0632C;	//  0x0632C
	int var_06330;	//  0x06330
	int var_06334;	//  0x06334
	int var_06338;	//  0x06338
	int var_0633C;	//  0x0633C
	int var_06340;	//  0x06340
	int var_06344;	//  0x06344
	int var_06348;	//  0x06348
	int var_0634C;	//  0x0634C
	int var_06350;	//  0x06350
	int var_06354;	//  0x06354
	int var_06358;	//  0x06358
	int var_0635C;	//  0x0635C
	int var_06360;	//  0x06360
	int var_06364;	//  0x06364
	int var_06368;	//  0x06368
	int var_0636C;	//  0x0636C
	int var_06370;	//  0x06370
	int var_06374;	//  0x06374
	int var_06378;	//  0x06378
	int var_0637C;	//  0x0637C
	int var_06380;	//  0x06380
	int var_06384;	//  0x06384
	int var_06388;	//  0x06388
	int var_0638C;	//  0x0638C
	int var_06390;	//  0x06390
	int var_06394;	//  0x06394
	int var_06398;	//  0x06398
	int var_0639C;	//  0x0639C
	int var_063A0;	//  0x063A0
	int var_063A4;	//  0x063A4
	int var_063A8;	//  0x063A8
	int var_063AC;	//  0x063AC
	int var_063B0;	//  0x063B0
	int var_063B4;	//  0x063B4
	int var_063B8;	//  0x063B8
	int var_063BC;	//  0x063BC
	int var_063C0;	//  0x063C0
	int var_063C4;	//  0x063C4
	int var_063C8;	//  0x063C8
	int var_063CC;	//  0x063CC
	int var_063D0;	//  0x063D0
	int var_063D4;	//  0x063D4
	int var_063D8;	//  0x063D8
	int var_063DC;	//  0x063DC
	int var_063E0;	//  0x063E0
	int var_063E4;	//  0x063E4
	int var_063E8;	//  0x063E8
	int var_063EC;	//  0x063EC
	int var_063F0;	//  0x063F0
	int var_063F4;	//  0x063F4
	int var_063F8;	//  0x063F8
	int var_063FC;	//  0x063FC
	int var_06400;	//  0x06400
	int var_06404;	//  0x06404
	int var_06408;	//  0x06408
	int var_0640C;	//  0x0640C
	int var_06410;	//  0x06410
	int var_06414;	//  0x06414
	int var_06418;	//  0x06418
	int var_0641C;	//  0x0641C
	int var_06420;	//  0x06420
	int var_06424;	//  0x06424
	int var_06428;	//  0x06428
	int var_0642C;	//  0x0642C
	int var_06430;	//  0x06430
	int var_06434;	//  0x06434
	int var_06438;	//  0x06438
	int var_0643C;	//  0x0643C
	int var_06440;	//  0x06440
	int var_06444;	//  0x06444
	int var_06448;	//  0x06448
	int var_0644C;	//  0x0644C
	int var_06450;	//  0x06450
	int var_06454;	//  0x06454
	int var_06458;	//  0x06458
	int var_0645C;	//  0x0645C
	int var_06460;	//  0x06460
	int var_06464;	//  0x06464
	int var_06468;	//  0x06468
	int var_0646C;	//  0x0646C
	int var_06470;	//  0x06470
	int var_06474;	//  0x06474
	int var_06478;	//  0x06478
	int var_0647C;	//  0x0647C
	int var_06480;	//  0x06480
	int var_06484;	//  0x06484
	int var_06488;	//  0x06488
	int var_0648C;	//  0x0648C
	int var_06490;	//  0x06490
	int var_06494;	//  0x06494
	int var_06498;	//  0x06498
	int var_0649C;	//  0x0649C
	int var_064A0;	//  0x064A0
	int var_064A4;	//  0x064A4
	int var_064A8;	//  0x064A8
	int var_064AC;	//  0x064AC
	int var_064B0;	//  0x064B0
	int var_064B4;	//  0x064B4
	int var_064B8;	//  0x064B8
	int var_064BC;	//  0x064BC
	int var_064C0;	//  0x064C0
	int var_064C4;	//  0x064C4
	int var_064C8;	//  0x064C8
	int var_064CC;	//  0x064CC
	int var_064D0;	//  0x064D0
	int var_064D4;	//  0x064D4
	int var_064D8;	//  0x064D8
	int var_064DC;	//  0x064DC
	int var_064E0;	//  0x064E0
	int var_064E4;	//  0x064E4
	int var_064E8;	//  0x064E8
	int var_064EC;	//  0x064EC
	int var_064F0;	//  0x064F0
	int var_064F4;	//  0x064F4
	int var_064F8;	//  0x064F8
	int var_064FC;	//  0x064FC
	int var_06500;	//  0x06500
	int var_06504;	//  0x06504
	int var_06508;	//  0x06508
	int var_0650C;	//  0x0650C
	int var_06510;	//  0x06510
	int var_06514;	//  0x06514
	int var_06518;	//  0x06518
	int var_0651C;	//  0x0651C
	int var_06520;	//  0x06520
	int var_06524;	//  0x06524
	int var_06528;	//  0x06528
	int var_0652C;	//  0x0652C
	int var_06530;	//  0x06530
	int var_06534;	//  0x06534
	int var_06538;	//  0x06538
	int var_0653C;	//  0x0653C
	int var_06540;	//  0x06540
	int var_06544;	//  0x06544
	int var_06548;	//  0x06548
	int var_0654C;	//  0x0654C
	int var_06550;	//  0x06550
	int var_06554;	//  0x06554
	int var_06558;	//  0x06558
	int var_0655C;	//  0x0655C
	int var_06560;	//  0x06560
	int var_06564;	//  0x06564
	int var_06568;	//  0x06568
	int var_0656C;	//  0x0656C
	int var_06570;	//  0x06570
	int var_06574;	//  0x06574
	int var_06578;	//  0x06578
	int var_0657C;	//  0x0657C
	int var_06580;	//  0x06580
	int var_06584;	//  0x06584
	int var_06588;	//  0x06588
	int var_0658C;	//  0x0658C
	int var_06590;	//  0x06590
	int var_06594;	//  0x06594
	int var_06598;	//  0x06598
	int var_0659C;	//  0x0659C
	int var_065A0;	//  0x065A0
	int var_065A4;	//  0x065A4
	int var_065A8;	//  0x065A8
	int var_065AC;	//  0x065AC
	int var_065B0;	//  0x065B0
	int var_065B4;	//  0x065B4
	int var_065B8;	//  0x065B8
	int var_065BC;	//  0x065BC
	int var_065C0;	//  0x065C0
	int var_065C4;	//  0x065C4
	int var_065C8;	//  0x065C8
	int var_065CC;	//  0x065CC
	int var_065D0;	//  0x065D0
	int var_065D4;	//  0x065D4
	int var_065D8;	//  0x065D8
	int var_065DC;	//  0x065DC
	int var_065E0;	//  0x065E0
	int var_065E4;	//  0x065E4
	int var_065E8;	//  0x065E8
	int var_065EC;	//  0x065EC
	int var_065F0;	//  0x065F0
	int var_065F4;	//  0x065F4
	int var_065F8;	//  0x065F8
	int var_065FC;	//  0x065FC
	int var_06600;	//  0x06600
	int var_06604;	//  0x06604
	int var_06608;	//  0x06608
	int var_0660C;	//  0x0660C
	int var_06610;	//  0x06610
	int var_06614;	//  0x06614
	int var_06618;	//  0x06618
	int var_0661C;	//  0x0661C
	int var_06620;	//  0x06620
	int var_06624;	//  0x06624
	int var_06628;	//  0x06628
	int var_0662C;	//  0x0662C
	int var_06630;	//  0x06630
	int var_06634;	//  0x06634
	int var_06638;	//  0x06638
	int var_0663C;	//  0x0663C
	int var_06640;	//  0x06640
	int var_06644;	//  0x06644
	int var_06648;	//  0x06648
	int var_0664C;	//  0x0664C
	int var_06650;	//  0x06650
	int var_06654;	//  0x06654
	int var_06658;	//  0x06658
	int var_0665C;	//  0x0665C
	int var_06660;	//  0x06660
	int var_06664;	//  0x06664
	int var_06668;	//  0x06668
	int var_0666C;	//  0x0666C
	int var_06670;	//  0x06670
	int var_06674;	//  0x06674
	int var_06678;	//  0x06678
	int var_0667C;	//  0x0667C
	int var_06680;	//  0x06680
	int var_06684;	//  0x06684
	int var_06688;	//  0x06688
	int var_0668C;	//  0x0668C
	int var_06690;	//  0x06690
	int var_06694;	//  0x06694
	int var_06698;	//  0x06698
	int var_0669C;	//  0x0669C
	int var_066A0;	//  0x066A0
	int var_066A4;	//  0x066A4
	int var_066A8;	//  0x066A8
	int var_066AC;	//  0x066AC
	int var_066B0;	//  0x066B0
	int var_066B4;	//  0x066B4
	int var_066B8;	//  0x066B8
	int var_066BC;	//  0x066BC
	int var_066C0;	//  0x066C0
	int var_066C4;	//  0x066C4
	int var_066C8;	//  0x066C8
	int var_066CC;	//  0x066CC
	int var_066D0;	//  0x066D0
	int var_066D4;	//  0x066D4
	int var_066D8;	//  0x066D8
	int var_066DC;	//  0x066DC
	int var_066E0;	//  0x066E0
	int var_066E4;	//  0x066E4
	int var_066E8;	//  0x066E8
	int var_066EC;	//  0x066EC
	int var_066F0;	//  0x066F0
	int var_066F4;	//  0x066F4
	int var_066F8;	//  0x066F8
	int var_066FC;	//  0x066FC
	int var_06700;	//  0x06700
	int var_06704;	//  0x06704
	int var_06708;	//  0x06708
	int var_0670C;	//  0x0670C
	int var_06710;	//  0x06710
	int var_06714;	//  0x06714
	int var_06718;	//  0x06718
	int var_0671C;	//  0x0671C
	int var_06720;	//  0x06720
	int var_06724;	//  0x06724
	int var_06728;	//  0x06728
	int var_0672C;	//  0x0672C
	int var_06730;	//  0x06730
	int var_06734;	//  0x06734
	int var_06738;	//  0x06738
	int var_0673C;	//  0x0673C
	int var_06740;	//  0x06740
	int var_06744;	//  0x06744
	int var_06748;	//  0x06748
	int var_0674C;	//  0x0674C
	int var_06750;	//  0x06750
	int var_06754;	//  0x06754
	int var_06758;	//  0x06758
	int var_0675C;	//  0x0675C
	int var_06760;	//  0x06760
	int var_06764;	//  0x06764
	int var_06768;	//  0x06768
	int var_0676C;	//  0x0676C
	int var_06770;	//  0x06770
	int var_06774;	//  0x06774
	int var_06778;	//  0x06778
	int var_0677C;	//  0x0677C
	int var_06780;	//  0x06780
	int var_06784;	//  0x06784
	int var_06788;	//  0x06788
	int var_0678C;	//  0x0678C
	int var_06790;	//  0x06790
	int var_06794;	//  0x06794
	int var_06798;	//  0x06798
	int var_0679C;	//  0x0679C
	int var_067A0;	//  0x067A0
	int var_067A4;	//  0x067A4
	int var_067A8;	//  0x067A8
	int var_067AC;	//  0x067AC
	int var_067B0;	//  0x067B0
	int var_067B4;	//  0x067B4
	int var_067B8;	//  0x067B8
	int var_067BC;	//  0x067BC
	int var_067C0;	//  0x067C0
	int var_067C4;	//  0x067C4
	int var_067C8;	//  0x067C8
	int var_067CC;	//  0x067CC
	int var_067D0;	//  0x067D0
	int var_067D4;	//  0x067D4
	int var_067D8;	//  0x067D8
	int var_067DC;	//  0x067DC
	int var_067E0;	//  0x067E0
	int var_067E4;	//  0x067E4
	int var_067E8;	//  0x067E8
	int var_067EC;	//  0x067EC
	int var_067F0;	//  0x067F0
	int var_067F4;	//  0x067F4
	int var_067F8;	//  0x067F8
	int var_067FC;	//  0x067FC
	int var_06800;	//  0x06800
	int var_06804;	//  0x06804
	int var_06808;	//  0x06808
	int var_0680C;	//  0x0680C
	int var_06810;	//  0x06810
	int var_06814;	//  0x06814
	int var_06818;	//  0x06818
	int var_0681C;	//  0x0681C
	int var_06820;	//  0x06820
	int var_06824;	//  0x06824
	int var_06828;	//  0x06828
	int var_0682C;	//  0x0682C
	int var_06830;	//  0x06830
	int var_06834;	//  0x06834
	int var_06838;	//  0x06838
	int var_0683C;	//  0x0683C
	int var_06840;	//  0x06840
	int var_06844;	//  0x06844
	int var_06848;	//  0x06848
	int var_0684C;	//  0x0684C
	int var_06850;	//  0x06850
	int var_06854;	//  0x06854
	int var_06858;	//  0x06858
	int var_0685C;	//  0x0685C
	int var_06860;	//  0x06860
	int var_06864;	//  0x06864
	int var_06868;	//  0x06868
	int var_0686C;	//  0x0686C
	int var_06870;	//  0x06870
	int var_06874;	//  0x06874
	int var_06878;	//  0x06878
	int var_0687C;	//  0x0687C
	int var_06880;	//  0x06880
	int var_06884;	//  0x06884
	int var_06888;	//  0x06888
	int var_0688C;	//  0x0688C
	int var_06890;	//  0x06890
	int var_06894;	//  0x06894
	int var_06898;	//  0x06898
	int var_0689C;	//  0x0689C
	int var_068A0;	//  0x068A0
	int var_068A4;	//  0x068A4
	int var_068A8;	//  0x068A8
	int var_068AC;	//  0x068AC
	int var_068B0;	//  0x068B0
	int var_068B4;	//  0x068B4
	int var_068B8;	//  0x068B8
	int var_068BC;	//  0x068BC
	int var_068C0;	//  0x068C0
	int var_068C4;	//  0x068C4
	int var_068C8;	//  0x068C8
	int var_068CC;	//  0x068CC
	int var_068D0;	//  0x068D0
	int var_068D4;	//  0x068D4
	int var_068D8;	//  0x068D8
	int var_068DC;	//  0x068DC
	int var_068E0;	//  0x068E0
	int var_068E4;	//  0x068E4
	int var_068E8;	//  0x068E8
	int var_068EC;	//  0x068EC
	int var_068F0;	//  0x068F0
	int var_068F4;	//  0x068F4
	int var_068F8;	//  0x068F8
	int var_068FC;	//  0x068FC
	int var_06900;	//  0x06900
	int var_06904;	//  0x06904
	int var_06908;	//  0x06908
	int var_0690C;	//  0x0690C
	int var_06910;	//  0x06910
	int var_06914;	//  0x06914
	int var_06918;	//  0x06918
	int var_0691C;	//  0x0691C
	int var_06920;	//  0x06920
	int var_06924;	//  0x06924
	int var_06928;	//  0x06928
	int var_0692C;	//  0x0692C
	int var_06930;	//  0x06930
	int var_06934;	//  0x06934
	int var_06938;	//  0x06938
	int var_0693C;	//  0x0693C
	int var_06940;	//  0x06940
	int var_06944;	//  0x06944
	int var_06948;	//  0x06948
	int var_0694C;	//  0x0694C
	int var_06950;	//  0x06950
	int var_06954;	//  0x06954
	int var_06958;	//  0x06958
	int var_0695C;	//  0x0695C
	int var_06960;	//  0x06960
	int var_06964;	//  0x06964
	int var_06968;	//  0x06968
	int var_0696C;	//  0x0696C
	int var_06970;	//  0x06970
	int var_06974;	//  0x06974
	int var_06978;	//  0x06978
	int var_0697C;	//  0x0697C
	int var_06980;	//  0x06980
	int var_06984;	//  0x06984
	int var_06988;	//  0x06988
	int var_0698C;	//  0x0698C
	int var_06990;	//  0x06990
	int var_06994;	//  0x06994
	int var_06998;	//  0x06998
	int var_0699C;	//  0x0699C
	int var_069A0;	//  0x069A0
	int var_069A4;	//  0x069A4
	int var_069A8;	//  0x069A8
	int var_069AC;	//  0x069AC
	int var_069B0;	//  0x069B0
	int var_069B4;	//  0x069B4
	int var_069B8;	//  0x069B8
	int var_069BC;	//  0x069BC
	int var_069C0;	//  0x069C0
	int var_069C4;	//  0x069C4
	int var_069C8;	//  0x069C8
	int var_069CC;	//  0x069CC
	int var_069D0;	//  0x069D0
	int var_069D4;	//  0x069D4
	int var_069D8;	//  0x069D8
	int var_069DC;	//  0x069DC
	int var_069E0;	//  0x069E0
	int var_069E4;	//  0x069E4
	int var_069E8;	//  0x069E8
	int var_069EC;	//  0x069EC
	int var_069F0;	//  0x069F0
	int var_069F4;	//  0x069F4
	int var_069F8;	//  0x069F8
	int var_069FC;	//  0x069FC
	int var_06A00;	//  0x06A00
	int var_06A04;	//  0x06A04
	int var_06A08;	//  0x06A08
	int var_06A0C;	//  0x06A0C
	int var_06A10;	//  0x06A10
	int var_06A14;	//  0x06A14
	int var_06A18;	//  0x06A18
	int var_06A1C;	//  0x06A1C
	int var_06A20;	//  0x06A20
	int var_06A24;	//  0x06A24
	int var_06A28;	//  0x06A28
	int var_06A2C;	//  0x06A2C
	int var_06A30;	//  0x06A30
	int var_06A34;	//  0x06A34
	int var_06A38;	//  0x06A38
	int var_06A3C;	//  0x06A3C
	int var_06A40;	//  0x06A40
	int var_06A44;	//  0x06A44
	int var_06A48;	//  0x06A48
	int var_06A4C;	//  0x06A4C
	int var_06A50;	//  0x06A50
	int var_06A54;	//  0x06A54
	int var_06A58;	//  0x06A58
	int var_06A5C;	//  0x06A5C
	int var_06A60;	//  0x06A60
	int var_06A64;	//  0x06A64
	int var_06A68;	//  0x06A68
	int var_06A6C;	//  0x06A6C
	int var_06A70;	//  0x06A70
	int var_06A74;	//  0x06A74
	int var_06A78;	//  0x06A78
	int var_06A7C;	//  0x06A7C
	int var_06A80;	//  0x06A80
	int var_06A84;	//  0x06A84
	int var_06A88;	//  0x06A88
	int var_06A8C;	//  0x06A8C
	int var_06A90;	//  0x06A90
	int var_06A94;	//  0x06A94
	int var_06A98;	//  0x06A98
	int var_06A9C;	//  0x06A9C
	int var_06AA0;	//  0x06AA0
	int var_06AA4;	//  0x06AA4
	int var_06AA8;	//  0x06AA8
	int var_06AAC;	//  0x06AAC
	int var_06AB0;	//  0x06AB0
	int var_06AB4;	//  0x06AB4
	int var_06AB8;	//  0x06AB8
	int var_06ABC;	//  0x06ABC
	int var_06AC0;	//  0x06AC0
	int var_06AC4;	//  0x06AC4
	int var_06AC8;	//  0x06AC8
	int var_06ACC;	//  0x06ACC
	int var_06AD0;	//  0x06AD0
	int var_06AD4;	//  0x06AD4
	int var_06AD8;	//  0x06AD8
	int var_06ADC;	//  0x06ADC
	int var_06AE0;	//  0x06AE0
	int var_06AE4;	//  0x06AE4
	int var_06AE8;	//  0x06AE8
	int var_06AEC;	//  0x06AEC
	int var_06AF0;	//  0x06AF0
	int var_06AF4;	//  0x06AF4
	int var_06AF8;	//  0x06AF8
	int var_06AFC;	//  0x06AFC
	int var_06B00;	//  0x06B00
	int var_06B04;	//  0x06B04
	int var_06B08;	//  0x06B08
	int var_06B0C;	//  0x06B0C
	int var_06B10;	//  0x06B10
	int var_06B14;	//  0x06B14
	int var_06B18;	//  0x06B18
	int var_06B1C;	//  0x06B1C
	int var_06B20;	//  0x06B20
	int var_06B24;	//  0x06B24
	int var_06B28;	//  0x06B28
	int var_06B2C;	//  0x06B2C
	int var_06B30;	//  0x06B30
	int var_06B34;	//  0x06B34
	int var_06B38;	//  0x06B38
	int var_06B3C;	//  0x06B3C
	int var_06B40;	//  0x06B40
	int var_06B44;	//  0x06B44
	int var_06B48;	//  0x06B48
	int var_06B4C;	//  0x06B4C
	int var_06B50;	//  0x06B50
	int var_06B54;	//  0x06B54
	int var_06B58;	//  0x06B58
	int var_06B5C;	//  0x06B5C
	int var_06B60;	//  0x06B60
	int var_06B64;	//  0x06B64
	int var_06B68;	//  0x06B68
	int var_06B6C;	//  0x06B6C
	int var_06B70;	//  0x06B70
	int var_06B74;	//  0x06B74
	int var_06B78;	//  0x06B78
	int var_06B7C;	//  0x06B7C
	int var_06B80;	//  0x06B80
	int var_06B84;	//  0x06B84
	int var_06B88;	//  0x06B88
	int var_06B8C;	//  0x06B8C
	int var_06B90;	//  0x06B90
	int var_06B94;	//  0x06B94
	int var_06B98;	//  0x06B98
	int var_06B9C;	//  0x06B9C
	int var_06BA0;	//  0x06BA0
	int var_06BA4;	//  0x06BA4
	int var_06BA8;	//  0x06BA8
	int var_06BAC;	//  0x06BAC
	int var_06BB0;	//  0x06BB0
	int var_06BB4;	//  0x06BB4
	int var_06BB8;	//  0x06BB8
	int var_06BBC;	//  0x06BBC
	int var_06BC0;	//  0x06BC0
	int var_06BC4;	//  0x06BC4
	int var_06BC8;	//  0x06BC8
	int var_06BCC;	//  0x06BCC
	int var_06BD0;	//  0x06BD0
	int var_06BD4;	//  0x06BD4
	int var_06BD8;	//  0x06BD8
	int var_06BDC;	//  0x06BDC
	int var_06BE0;	//  0x06BE0
	int var_06BE4;	//  0x06BE4
	int var_06BE8;	//  0x06BE8
	int var_06BEC;	//  0x06BEC
	int var_06BF0;	//  0x06BF0
	int var_06BF4;	//  0x06BF4
	int var_06BF8;	//  0x06BF8
	int var_06BFC;	//  0x06BFC
	int var_06C00;	//  0x06C00
	int var_06C04;	//  0x06C04
	int var_06C08;	//  0x06C08
	int var_06C0C;	//  0x06C0C
	int var_06C10;	//  0x06C10
	int var_06C14;	//  0x06C14
	int var_06C18;	//  0x06C18
	int var_06C1C;	//  0x06C1C
	int var_06C20;	//  0x06C20
	int var_06C24;	//  0x06C24
	int var_06C28;	//  0x06C28
	int var_06C2C;	//  0x06C2C
	int var_06C30;	//  0x06C30
	int var_06C34;	//  0x06C34
	int var_06C38;	//  0x06C38
	int var_06C3C;	//  0x06C3C
	int var_06C40;	//  0x06C40
	int var_06C44;	//  0x06C44
	int var_06C48;	//  0x06C48
	int var_06C4C;	//  0x06C4C
	int var_06C50;	//  0x06C50
	int var_06C54;	//  0x06C54
	int var_06C58;	//  0x06C58
	int var_06C5C;	//  0x06C5C
	int var_06C60;	//  0x06C60
	int var_06C64;	//  0x06C64
	int var_06C68;	//  0x06C68
	int var_06C6C;	//  0x06C6C
	int var_06C70;	//  0x06C70
	int var_06C74;	//  0x06C74
	int var_06C78;	//  0x06C78
	int var_06C7C;	//  0x06C7C
	int var_06C80;	//  0x06C80
	int var_06C84;	//  0x06C84
	int var_06C88;	//  0x06C88
	int var_06C8C;	//  0x06C8C
	int var_06C90;	//  0x06C90
	int var_06C94;	//  0x06C94
	int var_06C98;	//  0x06C98
	int var_06C9C;	//  0x06C9C
	int var_06CA0;	//  0x06CA0
	int var_06CA4;	//  0x06CA4
	int var_06CA8;	//  0x06CA8
	int var_06CAC;	//  0x06CAC
	int var_06CB0;	//  0x06CB0
	int var_06CB4;	//  0x06CB4
	int var_06CB8;	//  0x06CB8
	int var_06CBC;	//  0x06CBC
	int var_06CC0;	//  0x06CC0
	int var_06CC4;	//  0x06CC4
	int var_06CC8;	//  0x06CC8
	int var_06CCC;	//  0x06CCC
	int var_06CD0;	//  0x06CD0
	int var_06CD4;	//  0x06CD4
	int var_06CD8;	//  0x06CD8
	int var_06CDC;	//  0x06CDC
	int var_06CE0;	//  0x06CE0
	int var_06CE4;	//  0x06CE4
	int var_06CE8;	//  0x06CE8
	int var_06CEC;	//  0x06CEC
	int var_06CF0;	//  0x06CF0
	int var_06CF4;	//  0x06CF4
	int var_06CF8;	//  0x06CF8
	int var_06CFC;	//  0x06CFC
	int var_06D00;	//  0x06D00
	int var_06D04;	//  0x06D04
	int var_06D08;	//  0x06D08
	int var_06D0C;	//  0x06D0C
	int var_06D10;	//  0x06D10
	int var_06D14;	//  0x06D14
	int var_06D18;	//  0x06D18
	int var_06D1C;	//  0x06D1C
	int var_06D20;	//  0x06D20
	int var_06D24;	//  0x06D24
	int var_06D28;	//  0x06D28
	int var_06D2C;	//  0x06D2C
	int var_06D30;	//  0x06D30
	int var_06D34;	//  0x06D34
	int var_06D38;	//  0x06D38
	int var_06D3C;	//  0x06D3C
	int var_06D40;	//  0x06D40
	int var_06D44;	//  0x06D44
	int var_06D48;	//  0x06D48
	int var_06D4C;	//  0x06D4C
	int var_06D50;	//  0x06D50
	int var_06D54;	//  0x06D54
	int var_06D58;	//  0x06D58
	int var_06D5C;	//  0x06D5C
	int var_06D60;	//  0x06D60
	int var_06D64;	//  0x06D64
	int var_06D68;	//  0x06D68
	int var_06D6C;	//  0x06D6C
	int var_06D70;	//  0x06D70
	int var_06D74;	//  0x06D74
	int var_06D78;	//  0x06D78
	int var_06D7C;	//  0x06D7C
	int var_06D80;	//  0x06D80
	int var_06D84;	//  0x06D84
	int var_06D88;	//  0x06D88
	int var_06D8C;	//  0x06D8C
	int var_06D90;	//  0x06D90
	int var_06D94;	//  0x06D94
	int var_06D98;	//  0x06D98
	int var_06D9C;	//  0x06D9C
	int var_06DA0;	//  0x06DA0
	int var_06DA4;	//  0x06DA4
	int var_06DA8;	//  0x06DA8
	int var_06DAC;	//  0x06DAC
	int var_06DB0;	//  0x06DB0
	int var_06DB4;	//  0x06DB4
	int var_06DB8;	//  0x06DB8
	int var_06DBC;	//  0x06DBC
	int var_06DC0;	//  0x06DC0
	int var_06DC4;	//  0x06DC4
	int var_06DC8;	//  0x06DC8
	int var_06DCC;	//  0x06DCC
	int var_06DD0;	//  0x06DD0
	int var_06DD4;	//  0x06DD4
	int var_06DD8;	//  0x06DD8
	int var_06DDC;	//  0x06DDC
	int var_06DE0;	//  0x06DE0
	int var_06DE4;	//  0x06DE4
	int var_06DE8;	//  0x06DE8
	int var_06DEC;	//  0x06DEC
	int var_06DF0;	//  0x06DF0
	int var_06DF4;	//  0x06DF4
	int var_06DF8;	//  0x06DF8
	int var_06DFC;	//  0x06DFC
	int var_06E00;	//  0x06E00
	int var_06E04;	//  0x06E04
	int var_06E08;	//  0x06E08
	int var_06E0C;	//  0x06E0C
	int var_06E10;	//  0x06E10
	int var_06E14;	//  0x06E14
	int var_06E18;	//  0x06E18
	int var_06E1C;	//  0x06E1C
	int var_06E20;	//  0x06E20
	int var_06E24;	//  0x06E24
	int var_06E28;	//  0x06E28
	int var_06E2C;	//  0x06E2C
	int var_06E30;	//  0x06E30
	int var_06E34;	//  0x06E34
	int var_06E38;	//  0x06E38
	int var_06E3C;	//  0x06E3C
	int var_06E40;	//  0x06E40
	int var_06E44;	//  0x06E44
	int var_06E48;	//  0x06E48
	int var_06E4C;	//  0x06E4C
	int var_06E50;	//  0x06E50
	int var_06E54;	//  0x06E54
	int var_06E58;	//  0x06E58
	int var_06E5C;	//  0x06E5C
	int var_06E60;	//  0x06E60
	int var_06E64;	//  0x06E64
	int var_06E68;	//  0x06E68
	int var_06E6C;	//  0x06E6C
	int var_06E70;	//  0x06E70
	int var_06E74;	//  0x06E74
	int var_06E78;	//  0x06E78
	int var_06E7C;	//  0x06E7C
	int var_06E80;	//  0x06E80
	int var_06E84;	//  0x06E84
	int var_06E88;	//  0x06E88
	int var_06E8C;	//  0x06E8C
	int var_06E90;	//  0x06E90
	int var_06E94;	//  0x06E94
	int var_06E98;	//  0x06E98
	int var_06E9C;	//  0x06E9C
	int var_06EA0;	//  0x06EA0
	int var_06EA4;	//  0x06EA4
	int var_06EA8;	//  0x06EA8
	int var_06EAC;	//  0x06EAC
	int var_06EB0;	//  0x06EB0
	int var_06EB4;	//  0x06EB4
	int var_06EB8;	//  0x06EB8
	int var_06EBC;	//  0x06EBC
	int var_06EC0;	//  0x06EC0
	int var_06EC4;	//  0x06EC4
	int var_06EC8;	//  0x06EC8
	int var_06ECC;	//  0x06ECC
	int var_06ED0;	//  0x06ED0
	int var_06ED4;	//  0x06ED4
	int var_06ED8;	//  0x06ED8
	int var_06EDC;	//  0x06EDC
	int var_06EE0;	//  0x06EE0
	int var_06EE4;	//  0x06EE4
	int var_06EE8;	//  0x06EE8
	int var_06EEC;	//  0x06EEC
	int var_06EF0;	//  0x06EF0
	int var_06EF4;	//  0x06EF4
	int var_06EF8;	//  0x06EF8
	int var_06EFC;	//  0x06EFC
	int var_06F00;	//  0x06F00
	int var_06F04;	//  0x06F04
	int var_06F08;	//  0x06F08
	int var_06F0C;	//  0x06F0C
	int var_06F10;	//  0x06F10
	int var_06F14;	//  0x06F14
	int var_06F18;	//  0x06F18
	int var_06F1C;	//  0x06F1C
	int var_06F20;	//  0x06F20
	int var_06F24;	//  0x06F24
	int var_06F28;	//  0x06F28
	int var_06F2C;	//  0x06F2C
	int var_06F30;	//  0x06F30
	int var_06F34;	//  0x06F34
	int var_06F38;	//  0x06F38
	int var_06F3C;	//  0x06F3C
	int var_06F40;	//  0x06F40
	int var_06F44;	//  0x06F44
	int var_06F48;	//  0x06F48
	int var_06F4C;	//  0x06F4C
	int var_06F50;	//  0x06F50
	int var_06F54;	//  0x06F54
	int var_06F58;	//  0x06F58
	int var_06F5C;	//  0x06F5C
	int var_06F60;	//  0x06F60
	int var_06F64;	//  0x06F64
	int var_06F68;	//  0x06F68
	int var_06F6C;	//  0x06F6C
	int var_06F70;	//  0x06F70
	int var_06F74;	//  0x06F74
	int var_06F78;	//  0x06F78
	int var_06F7C;	//  0x06F7C
	int var_06F80;	//  0x06F80
	int var_06F84;	//  0x06F84
	int var_06F88;	//  0x06F88
	int var_06F8C;	//  0x06F8C
	int var_06F90;	//  0x06F90
	int var_06F94;	//  0x06F94
	int var_06F98;	//  0x06F98
	int var_06F9C;	//  0x06F9C
	int var_06FA0;	//  0x06FA0
	int var_06FA4;	//  0x06FA4
	int var_06FA8;	//  0x06FA8
	int var_06FAC;	//  0x06FAC
	int var_06FB0;	//  0x06FB0
	int var_06FB4;	//  0x06FB4
	int var_06FB8;	//  0x06FB8
	int var_06FBC;	//  0x06FBC
	int var_06FC0;	//  0x06FC0
	int var_06FC4;	//  0x06FC4
	int var_06FC8;	//  0x06FC8
	int var_06FCC;	//  0x06FCC
	int var_06FD0;	//  0x06FD0
	int var_06FD4;	//  0x06FD4
	int var_06FD8;	//  0x06FD8
	int var_06FDC;	//  0x06FDC
	int var_06FE0;	//  0x06FE0
	int var_06FE4;	//  0x06FE4
	int var_06FE8;	//  0x06FE8
	int var_06FEC;	//  0x06FEC
	int var_06FF0;	//  0x06FF0
	int var_06FF4;	//  0x06FF4
	int var_06FF8;	//  0x06FF8
	int var_06FFC;	//  0x06FFC
	int var_07000;	//  0x07000
	int var_07004;	//  0x07004
	int var_07008;	//  0x07008
	int var_0700C;	//  0x0700C
	int var_07010;	//  0x07010
	int var_07014;	//  0x07014
	int var_07018;	//  0x07018
	int var_0701C;	//  0x0701C
	int var_07020;	//  0x07020
	int var_07024;	//  0x07024
	int var_07028;	//  0x07028
	int var_0702C;	//  0x0702C
	int var_07030;	//  0x07030
	int var_07034;	//  0x07034
	int var_07038;	//  0x07038
	int var_0703C;	//  0x0703C
	int var_07040;	//  0x07040
	int var_07044;	//  0x07044
	int var_07048;	//  0x07048
	int var_0704C;	//  0x0704C
	int var_07050;	//  0x07050
	int var_07054;	//  0x07054
	int var_07058;	//  0x07058
	int var_0705C;	//  0x0705C
	int var_07060;	//  0x07060
	int var_07064;	//  0x07064
	int var_07068;	//  0x07068
	int var_0706C;	//  0x0706C
	int var_07070;	//  0x07070
	int var_07074;	//  0x07074
	int var_07078;	//  0x07078
	int var_0707C;	//  0x0707C
	int var_07080;	//  0x07080
	int var_07084;	//  0x07084
	int var_07088;	//  0x07088
	int var_0708C;	//  0x0708C
	int var_07090;	//  0x07090
	int var_07094;	//  0x07094
	int var_07098;	//  0x07098
	int var_0709C;	//  0x0709C
	int var_070A0;	//  0x070A0
	int var_070A4;	//  0x070A4
	int var_070A8;	//  0x070A8
	int var_070AC;	//  0x070AC
	int var_070B0;	//  0x070B0
	int var_070B4;	//  0x070B4
	int var_070B8;	//  0x070B8
	int var_070BC;	//  0x070BC
	int var_070C0;	//  0x070C0
	int var_070C4;	//  0x070C4
	int var_070C8;	//  0x070C8
	int var_070CC;	//  0x070CC
	int var_070D0;	//  0x070D0
	int var_070D4;	//  0x070D4
	int var_070D8;	//  0x070D8
	int var_070DC;	//  0x070DC
	int var_070E0;	//  0x070E0
	int var_070E4;	//  0x070E4
	int var_070E8;	//  0x070E8
	int var_070EC;	//  0x070EC
	int var_070F0;	//  0x070F0
	int var_070F4;	//  0x070F4
	int var_070F8;	//  0x070F8
	int var_070FC;	//  0x070FC
	int var_07100;	//  0x07100
	int var_07104;	//  0x07104
	int var_07108;	//  0x07108
	int var_0710C;	//  0x0710C
	int var_07110;	//  0x07110
	int var_07114;	//  0x07114
	int var_07118;	//  0x07118
	int var_0711C;	//  0x0711C
	int var_07120;	//  0x07120
	int var_07124;	//  0x07124
	int var_07128;	//  0x07128
	int var_0712C;	//  0x0712C
	int var_07130;	//  0x07130
	int var_07134;	//  0x07134
	int var_07138;	//  0x07138
	int var_0713C;	//  0x0713C
	int var_07140;	//  0x07140
	int var_07144;	//  0x07144
	int var_07148;	//  0x07148
	int var_0714C;	//  0x0714C
	int var_07150;	//  0x07150
	int var_07154;	//  0x07154
	int var_07158;	//  0x07158
	int var_0715C;	//  0x0715C
	int var_07160;	//  0x07160
	int var_07164;	//  0x07164
	int var_07168;	//  0x07168
	int var_0716C;	//  0x0716C
	int var_07170;	//  0x07170
	int var_07174;	//  0x07174
	int var_07178;	//  0x07178
	int var_0717C;	//  0x0717C
	int var_07180;	//  0x07180
	int var_07184;	//  0x07184
	int var_07188;	//  0x07188
	int var_0718C;	//  0x0718C
	int var_07190;	//  0x07190
	int var_07194;	//  0x07194
	int var_07198;	//  0x07198
	int var_0719C;	//  0x0719C
	int var_071A0;	//  0x071A0
	int var_071A4;	//  0x071A4
	int var_071A8;	//  0x071A8
	int var_071AC;	//  0x071AC
	int var_071B0;	//  0x071B0
	int var_071B4;	//  0x071B4
	int var_071B8;	//  0x071B8
	int var_071BC;	//  0x071BC
	int var_071C0;	//  0x071C0
	int var_071C4;	//  0x071C4
	int var_071C8;	//  0x071C8
	int var_071CC;	//  0x071CC
	int var_071D0;	//  0x071D0
	int var_071D4;	//  0x071D4
	int var_071D8;	//  0x071D8
	int var_071DC;	//  0x071DC
	int var_071E0;	//  0x071E0
	int var_071E4;	//  0x071E4
	int var_071E8;	//  0x071E8
	int var_071EC;	//  0x071EC
	int var_071F0;	//  0x071F0
	int var_071F4;	//  0x071F4
	int var_071F8;	//  0x071F8
	int var_071FC;	//  0x071FC
	int var_07200;	//  0x07200
	int var_07204;	//  0x07204
	int var_07208;	//  0x07208
	int var_0720C;	//  0x0720C
	int var_07210;	//  0x07210
	int var_07214;	//  0x07214
	int var_07218;	//  0x07218
	int var_0721C;	//  0x0721C
	int var_07220;	//  0x07220
	int var_07224;	//  0x07224
	int var_07228;	//  0x07228
	int var_0722C;	//  0x0722C
	int var_07230;	//  0x07230
	int var_07234;	//  0x07234
	int var_07238;	//  0x07238
	int var_0723C;	//  0x0723C
	int var_07240;	//  0x07240
	int var_07244;	//  0x07244
	int var_07248;	//  0x07248
	int var_0724C;	//  0x0724C
	int var_07250;	//  0x07250
	int var_07254;	//  0x07254
	int var_07258;	//  0x07258
	int var_0725C;	//  0x0725C
	int var_07260;	//  0x07260
	int var_07264;	//  0x07264
	int var_07268;	//  0x07268
	int var_0726C;	//  0x0726C
	int var_07270;	//  0x07270
	int var_07274;	//  0x07274
	int var_07278;	//  0x07278
	int var_0727C;	//  0x0727C
	int var_07280;	//  0x07280
	int var_07284;	//  0x07284
	int var_07288;	//  0x07288
	int var_0728C;	//  0x0728C
	int var_07290;	//  0x07290
	int var_07294;	//  0x07294
	int var_07298;	//  0x07298
	int var_0729C;	//  0x0729C
	int var_072A0;	//  0x072A0
	int var_072A4;	//  0x072A4
	int var_072A8;	//  0x072A8
	int var_072AC;	//  0x072AC
	int var_072B0;	//  0x072B0
	int var_072B4;	//  0x072B4
	int var_072B8;	//  0x072B8
	int var_072BC;	//  0x072BC
	int var_072C0;	//  0x072C0
	int var_072C4;	//  0x072C4
	int var_072C8;	//  0x072C8
	int var_072CC;	//  0x072CC
	int var_072D0;	//  0x072D0
	int var_072D4;	//  0x072D4
	int var_072D8;	//  0x072D8
	int var_072DC;	//  0x072DC
	int var_072E0;	//  0x072E0
	int var_072E4;	//  0x072E4
	int var_072E8;	//  0x072E8
	int var_072EC;	//  0x072EC
	int var_072F0;	//  0x072F0
	int var_072F4;	//  0x072F4
	int var_072F8;	//  0x072F8
	int var_072FC;	//  0x072FC
	int var_07300;	//  0x07300
	int var_07304;	//  0x07304
	int var_07308;	//  0x07308
	int var_0730C;	//  0x0730C
	int var_07310;	//  0x07310
	int var_07314;	//  0x07314
	int var_07318;	//  0x07318
	int var_0731C;	//  0x0731C
	int var_07320;	//  0x07320
	int var_07324;	//  0x07324
	int var_07328;	//  0x07328
	int var_0732C;	//  0x0732C
	int var_07330;	//  0x07330
	int var_07334;	//  0x07334
	int var_07338;	//  0x07338
	int var_0733C;	//  0x0733C
	int var_07340;	//  0x07340
	int var_07344;	//  0x07344
	int var_07348;	//  0x07348
	int var_0734C;	//  0x0734C
	int var_07350;	//  0x07350
	int var_07354;	//  0x07354
	int var_07358;	//  0x07358
	int var_0735C;	//  0x0735C
	int var_07360;	//  0x07360
	int var_07364;	//  0x07364
	int var_07368;	//  0x07368
	int var_0736C;	//  0x0736C
	int var_07370;	//  0x07370
	int var_07374;	//  0x07374
	int var_07378;	//  0x07378
	int var_0737C;	//  0x0737C
	int var_07380;	//  0x07380
	int var_07384;	//  0x07384
	int var_07388;	//  0x07388
	int var_0738C;	//  0x0738C
	int var_07390;	//  0x07390
	int var_07394;	//  0x07394
	int var_07398;	//  0x07398
	int var_0739C;	//  0x0739C
	int var_073A0;	//  0x073A0
	int var_073A4;	//  0x073A4
	int var_073A8;	//  0x073A8
	int var_073AC;	//  0x073AC
	int var_073B0;	//  0x073B0
	int var_073B4;	//  0x073B4
	int var_073B8;	//  0x073B8
	int var_073BC;	//  0x073BC
	int var_073C0;	//  0x073C0
	int var_073C4;	//  0x073C4
	int var_073C8;	//  0x073C8
	int var_073CC;	//  0x073CC
	int var_073D0;	//  0x073D0
	int var_073D4;	//  0x073D4
	int var_073D8;	//  0x073D8
	int var_073DC;	//  0x073DC
	int var_073E0;	//  0x073E0
	int var_073E4;	//  0x073E4
	int var_073E8;	//  0x073E8
	int var_073EC;	//  0x073EC
	int var_073F0;	//  0x073F0
	int var_073F4;	//  0x073F4
	int var_073F8;	//  0x073F8
	int var_073FC;	//  0x073FC
	int var_07400;	//  0x07400
	int var_07404;	//  0x07404
	int var_07408;	//  0x07408
	int var_0740C;	//  0x0740C
	int var_07410;	//  0x07410
	int var_07414;	//  0x07414
	int var_07418;	//  0x07418
	int var_0741C;	//  0x0741C
	int var_07420;	//  0x07420
	int var_07424;	//  0x07424
	int var_07428;	//  0x07428
	int var_0742C;	//  0x0742C
	int var_07430;	//  0x07430
	int var_07434;	//  0x07434
	int var_07438;	//  0x07438
	int var_0743C;	//  0x0743C
	int var_07440;	//  0x07440
	int var_07444;	//  0x07444
	int var_07448;	//  0x07448
	int var_0744C;	//  0x0744C
	int var_07450;	//  0x07450
	int var_07454;	//  0x07454
	int var_07458;	//  0x07458
	int var_0745C;	//  0x0745C
	int var_07460;	//  0x07460
	int var_07464;	//  0x07464
	int var_07468;	//  0x07468
	int var_0746C;	//  0x0746C
	int var_07470;	//  0x07470
	int var_07474;	//  0x07474
	int var_07478;	//  0x07478
	int var_0747C;	//  0x0747C
	int var_07480;	//  0x07480
	int var_07484;	//  0x07484
	int var_07488;	//  0x07488
	int var_0748C;	//  0x0748C
	int var_07490;	//  0x07490
	int var_07494;	//  0x07494
	int var_07498;	//  0x07498
	int var_0749C;	//  0x0749C
	int var_074A0;	//  0x074A0
	int var_074A4;	//  0x074A4
	int var_074A8;	//  0x074A8
	int var_074AC;	//  0x074AC
	int var_074B0;	//  0x074B0
	int var_074B4;	//  0x074B4
	int var_074B8;	//  0x074B8
	int var_074BC;	//  0x074BC
	int var_074C0;	//  0x074C0
	int var_074C4;	//  0x074C4
	int var_074C8;	//  0x074C8
	int var_074CC;	//  0x074CC
	int var_074D0;	//  0x074D0
	int var_074D4;	//  0x074D4
	int var_074D8;	//  0x074D8
	int var_074DC;	//  0x074DC
	int var_074E0;	//  0x074E0
	int var_074E4;	//  0x074E4
	int var_074E8;	//  0x074E8
	int var_074EC;	//  0x074EC
	int var_074F0;	//  0x074F0
	int var_074F4;	//  0x074F4
	int var_074F8;	//  0x074F8
	int var_074FC;	//  0x074FC
	int var_07500;	//  0x07500
	int var_07504;	//  0x07504
	int var_07508;	//  0x07508
	int var_0750C;	//  0x0750C
	int var_07510;	//  0x07510
	int var_07514;	//  0x07514
	int var_07518;	//  0x07518
	int var_0751C;	//  0x0751C
	int var_07520;	//  0x07520
	int var_07524;	//  0x07524
	int var_07528;	//  0x07528
	int var_0752C;	//  0x0752C
	int var_07530;	//  0x07530
	int var_07534;	//  0x07534
	int var_07538;	//  0x07538
	int var_0753C;	//  0x0753C
	int var_07540;	//  0x07540
	int var_07544;	//  0x07544
	int var_07548;	//  0x07548
	int var_0754C;	//  0x0754C
	int var_07550;	//  0x07550
	int var_07554;	//  0x07554
	int var_07558;	//  0x07558
	int var_0755C;	//  0x0755C
	int var_07560;	//  0x07560
	int var_07564;	//  0x07564
	int var_07568;	//  0x07568
	int var_0756C;	//  0x0756C
	int var_07570;	//  0x07570
	int var_07574;	//  0x07574
	int var_07578;	//  0x07578
	int var_0757C;	//  0x0757C
	int var_07580;	//  0x07580
	int var_07584;	//  0x07584
	int var_07588;	//  0x07588
	int var_0758C;	//  0x0758C
	int var_07590;	//  0x07590
	int var_07594;	//  0x07594
	int var_07598;	//  0x07598
	int var_0759C;	//  0x0759C
	int var_075A0;	//  0x075A0
	int var_075A4;	//  0x075A4
	int var_075A8;	//  0x075A8
	int var_075AC;	//  0x075AC
	int var_075B0;	//  0x075B0
	int var_075B4;	//  0x075B4
	int var_075B8;	//  0x075B8
	int var_075BC;	//  0x075BC
	int var_075C0;	//  0x075C0
	int var_075C4;	//  0x075C4
	int var_075C8;	//  0x075C8
	int var_075CC;	//  0x075CC
	int var_075D0;	//  0x075D0
	int var_075D4;	//  0x075D4
	int var_075D8;	//  0x075D8
	int var_075DC;	//  0x075DC
	int var_075E0;	//  0x075E0
	int var_075E4;	//  0x075E4
	int var_075E8;	//  0x075E8
	int var_075EC;	//  0x075EC
	int var_075F0;	//  0x075F0
	int var_075F4;	//  0x075F4
	int var_075F8;	//  0x075F8
	int var_075FC;	//  0x075FC
	int var_07600;	//  0x07600
	int var_07604;	//  0x07604
	int var_07608;	//  0x07608
	int var_0760C;	//  0x0760C
	int var_07610;	//  0x07610
	int var_07614;	//  0x07614
	int var_07618;	//  0x07618
	int var_0761C;	//  0x0761C
	int var_07620;	//  0x07620
	int var_07624;	//  0x07624
	int var_07628;	//  0x07628
	int var_0762C;	//  0x0762C
	int var_07630;	//  0x07630
	int var_07634;	//  0x07634
	int var_07638;	//  0x07638
	int var_0763C;	//  0x0763C
	int var_07640;	//  0x07640
	int var_07644;	//  0x07644
	int var_07648;	//  0x07648
	int var_0764C;	//  0x0764C
	int var_07650;	//  0x07650
	int var_07654;	//  0x07654
	int var_07658;	//  0x07658
	int var_0765C;	//  0x0765C
	int var_07660;	//  0x07660
	int var_07664;	//  0x07664
	int var_07668;	//  0x07668
	int var_0766C;	//  0x0766C
	int var_07670;	//  0x07670
	int var_07674;	//  0x07674
	int var_07678;	//  0x07678
	int var_0767C;	//  0x0767C
	int var_07680;	//  0x07680
	int var_07684;	//  0x07684
	int var_07688;	//  0x07688
	int var_0768C;	//  0x0768C
	int var_07690;	//  0x07690
	int var_07694;	//  0x07694
	int var_07698;	//  0x07698
	int var_0769C;	//  0x0769C
	int var_076A0;	//  0x076A0
	int var_076A4;	//  0x076A4
	int var_076A8;	//  0x076A8
	int var_076AC;	//  0x076AC
	int var_076B0;	//  0x076B0
	int var_076B4;	//  0x076B4
	int var_076B8;	//  0x076B8
	int var_076BC;	//  0x076BC
	int var_076C0;	//  0x076C0
	int var_076C4;	//  0x076C4
	int var_076C8;	//  0x076C8
	int var_076CC;	//  0x076CC
	int var_076D0;	//  0x076D0
	int var_076D4;	//  0x076D4
	int var_076D8;	//  0x076D8
	int var_076DC;	//  0x076DC
	int var_076E0;	//  0x076E0
	int var_076E4;	//  0x076E4
	int var_076E8;	//  0x076E8
	int var_076EC;	//  0x076EC
	int var_076F0;	//  0x076F0
	int var_076F4;	//  0x076F4
	int var_076F8;	//  0x076F8
	int var_076FC;	//  0x076FC
	int var_07700;	//  0x07700
	int var_07704;	//  0x07704
	int var_07708;	//  0x07708
	int var_0770C;	//  0x0770C
	int var_07710;	//  0x07710
	int var_07714;	//  0x07714
	int var_07718;	//  0x07718
	int var_0771C;	//  0x0771C
	int var_07720;	//  0x07720
	int var_07724;	//  0x07724
	int var_07728;	//  0x07728
	int var_0772C;	//  0x0772C
	int var_07730;	//  0x07730
	int var_07734;	//  0x07734
	int var_07738;	//  0x07738
	int var_0773C;	//  0x0773C
	int var_07740;	//  0x07740
	int var_07744;	//  0x07744
	int var_07748;	//  0x07748
	int var_0774C;	//  0x0774C
	int var_07750;	//  0x07750
	int var_07754;	//  0x07754
	int var_07758;	//  0x07758
	int var_0775C;	//  0x0775C
	int var_07760;	//  0x07760
	int var_07764;	//  0x07764
	int var_07768;	//  0x07768
	int var_0776C;	//  0x0776C
	int var_07770;	//  0x07770
	int var_07774;	//  0x07774
	int var_07778;	//  0x07778
	int var_0777C;	//  0x0777C
	int var_07780;	//  0x07780
	int var_07784;	//  0x07784
	int var_07788;	//  0x07788
	int var_0778C;	//  0x0778C
	int var_07790;	//  0x07790
	int var_07794;	//  0x07794
	int var_07798;	//  0x07798
	int var_0779C;	//  0x0779C
	int var_077A0;	//  0x077A0
	int var_077A4;	//  0x077A4
	int var_077A8;	//  0x077A8
	int var_077AC;	//  0x077AC
	int var_077B0;	//  0x077B0
	int var_077B4;	//  0x077B4
	int var_077B8;	//  0x077B8
	int var_077BC;	//  0x077BC
	int var_077C0;	//  0x077C0
	int var_077C4;	//  0x077C4
	int var_077C8;	//  0x077C8
	int var_077CC;	//  0x077CC
	int var_077D0;	//  0x077D0
	int var_077D4;	//  0x077D4
	int var_077D8;	//  0x077D8
	int var_077DC;	//  0x077DC
	int var_077E0;	//  0x077E0
	int var_077E4;	//  0x077E4
	int var_077E8;	//  0x077E8
	int var_077EC;	//  0x077EC
	int var_077F0;	//  0x077F0
	int var_077F4;	//  0x077F4
	int var_077F8;	//  0x077F8
	int var_077FC;	//  0x077FC
	int var_07800;	//  0x07800
	int var_07804;	//  0x07804
	int var_07808;	//  0x07808
	int var_0780C;	//  0x0780C
	int var_07810;	//  0x07810
	int var_07814;	//  0x07814
	int var_07818;	//  0x07818
	int var_0781C;	//  0x0781C
	int var_07820;	//  0x07820
	int var_07824;	//  0x07824
	int var_07828;	//  0x07828
	int var_0782C;	//  0x0782C
	int var_07830;	//  0x07830
	int var_07834;	//  0x07834
	int var_07838;	//  0x07838
	int var_0783C;	//  0x0783C
	int var_07840;	//  0x07840
	int var_07844;	//  0x07844
	int var_07848;	//  0x07848
	int var_0784C;	//  0x0784C
	int var_07850;	//  0x07850
	int var_07854;	//  0x07854
	int var_07858;	//  0x07858
	int var_0785C;	//  0x0785C
	int var_07860;	//  0x07860
	int var_07864;	//  0x07864
	int var_07868;	//  0x07868
	int var_0786C;	//  0x0786C
	int var_07870;	//  0x07870
	int var_07874;	//  0x07874
	int var_07878;	//  0x07878
	int var_0787C;	//  0x0787C
	int var_07880;	//  0x07880
	int var_07884;	//  0x07884
	int var_07888;	//  0x07888
	int var_0788C;	//  0x0788C
	int var_07890;	//  0x07890
	int var_07894;	//  0x07894
	int var_07898;	//  0x07898
	int var_0789C;	//  0x0789C
	int var_078A0;	//  0x078A0
	int var_078A4;	//  0x078A4
	int var_078A8;	//  0x078A8
	int var_078AC;	//  0x078AC
	int var_078B0;	//  0x078B0
	int var_078B4;	//  0x078B4
	int var_078B8;	//  0x078B8
	int var_078BC;	//  0x078BC
	int var_078C0;	//  0x078C0
	int var_078C4;	//  0x078C4
	int var_078C8;	//  0x078C8
	int var_078CC;	//  0x078CC
	int var_078D0;	//  0x078D0
	int var_078D4;	//  0x078D4
	int var_078D8;	//  0x078D8
	int var_078DC;	//  0x078DC
	int var_078E0;	//  0x078E0
	int var_078E4;	//  0x078E4
	int var_078E8;	//  0x078E8
	int var_078EC;	//  0x078EC
	int var_078F0;	//  0x078F0
	int var_078F4;	//  0x078F4
	int var_078F8;	//  0x078F8
	int var_078FC;	//  0x078FC
	int var_07900;	//  0x07900
	int var_07904;	//  0x07904
	int var_07908;	//  0x07908
	int var_0790C;	//  0x0790C
	int var_07910;	//  0x07910
	int var_07914;	//  0x07914
	int var_07918;	//  0x07918
	int var_0791C;	//  0x0791C
	int var_07920;	//  0x07920
	int var_07924;	//  0x07924
	int var_07928;	//  0x07928
	int var_0792C;	//  0x0792C
	int var_07930;	//  0x07930
	int var_07934;	//  0x07934
	int var_07938;	//  0x07938
	int var_0793C;	//  0x0793C
	int var_07940;	//  0x07940
	int var_07944;	//  0x07944
	int var_07948;	//  0x07948
	int var_0794C;	//  0x0794C
	int var_07950;	//  0x07950
	int var_07954;	//  0x07954
	int var_07958;	//  0x07958
	int var_0795C;	//  0x0795C
	int var_07960;	//  0x07960
	int var_07964;	//  0x07964
	int var_07968;	//  0x07968
	int var_0796C;	//  0x0796C
	int var_07970;	//  0x07970
	int var_07974;	//  0x07974
	int var_07978;	//  0x07978
	int var_0797C;	//  0x0797C
	int var_07980;	//  0x07980
	int var_07984;	//  0x07984
	int var_07988;	//  0x07988
	int var_0798C;	//  0x0798C
	int var_07990;	//  0x07990
	int var_07994;	//  0x07994
	int var_07998;	//  0x07998
	int var_0799C;	//  0x0799C
	int var_079A0;	//  0x079A0
	int var_079A4;	//  0x079A4
	int var_079A8;	//  0x079A8
	int var_079AC;	//  0x079AC
	int var_079B0;	//  0x079B0
	int var_079B4;	//  0x079B4
	int var_079B8;	//  0x079B8
	int var_079BC;	//  0x079BC
	int var_079C0;	//  0x079C0
	int var_079C4;	//  0x079C4
	int var_079C8;	//  0x079C8
	int var_079CC;	//  0x079CC
	int var_079D0;	//  0x079D0
	int var_079D4;	//  0x079D4
	int var_079D8;	//  0x079D8
	int var_079DC;	//  0x079DC
	int var_079E0;	//  0x079E0
	int var_079E4;	//  0x079E4
	int var_079E8;	//  0x079E8
	int var_079EC;	//  0x079EC
	int var_079F0;	//  0x079F0
	int var_079F4;	//  0x079F4
	int var_079F8;	//  0x079F8
	int var_079FC;	//  0x079FC
	int var_07A00;	//  0x07A00
	int var_07A04;	//  0x07A04
	int var_07A08;	//  0x07A08
	int var_07A0C;	//  0x07A0C
	int var_07A10;	//  0x07A10
	int var_07A14;	//  0x07A14
	int var_07A18;	//  0x07A18
	int var_07A1C;	//  0x07A1C
	int var_07A20;	//  0x07A20
	int var_07A24;	//  0x07A24
	int var_07A28;	//  0x07A28
	int var_07A2C;	//  0x07A2C
	int var_07A30;	//  0x07A30
	int var_07A34;	//  0x07A34
	int var_07A38;	//  0x07A38
	int var_07A3C;	//  0x07A3C
	int var_07A40;	//  0x07A40
	int var_07A44;	//  0x07A44
	int var_07A48;	//  0x07A48
	int var_07A4C;	//  0x07A4C
	int var_07A50;	//  0x07A50
	int var_07A54;	//  0x07A54
	int var_07A58;	//  0x07A58
	int var_07A5C;	//  0x07A5C
	int var_07A60;	//  0x07A60
	int var_07A64;	//  0x07A64
	int var_07A68;	//  0x07A68
	int var_07A6C;	//  0x07A6C
	int var_07A70;	//  0x07A70
	int var_07A74;	//  0x07A74
	int var_07A78;	//  0x07A78
	int var_07A7C;	//  0x07A7C
	int var_07A80;	//  0x07A80
	int var_07A84;	//  0x07A84
	int var_07A88;	//  0x07A88
	int var_07A8C;	//  0x07A8C
	int var_07A90;	//  0x07A90
	int var_07A94;	//  0x07A94
	int var_07A98;	//  0x07A98
	int var_07A9C;	//  0x07A9C
	int var_07AA0;	//  0x07AA0
	int var_07AA4;	//  0x07AA4
	int var_07AA8;	//  0x07AA8
	int var_07AAC;	//  0x07AAC
	int var_07AB0;	//  0x07AB0
	int var_07AB4;	//  0x07AB4
	int var_07AB8;	//  0x07AB8
	int var_07ABC;	//  0x07ABC
	int var_07AC0;	//  0x07AC0
	int var_07AC4;	//  0x07AC4
	int var_07AC8;	//  0x07AC8
	int var_07ACC;	//  0x07ACC
	int var_07AD0;	//  0x07AD0
	int var_07AD4;	//  0x07AD4
	int var_07AD8;	//  0x07AD8
	int var_07ADC;	//  0x07ADC
	int var_07AE0;	//  0x07AE0
	int var_07AE4;	//  0x07AE4
	int var_07AE8;	//  0x07AE8
	int var_07AEC;	//  0x07AEC
	int var_07AF0;	//  0x07AF0
	int var_07AF4;	//  0x07AF4
	int var_07AF8;	//  0x07AF8
	int var_07AFC;	//  0x07AFC
	int var_07B00;	//  0x07B00
	int var_07B04;	//  0x07B04
	int var_07B08;	//  0x07B08
	int var_07B0C;	//  0x07B0C
	int var_07B10;	//  0x07B10
	int var_07B14;	//  0x07B14
	int var_07B18;	//  0x07B18
	int var_07B1C;	//  0x07B1C
	int var_07B20;	//  0x07B20
	int var_07B24;	//  0x07B24
	int var_07B28;	//  0x07B28
	int var_07B2C;	//  0x07B2C
	int var_07B30;	//  0x07B30
	int var_07B34;	//  0x07B34
	int var_07B38;	//  0x07B38
	int var_07B3C;	//  0x07B3C
	int var_07B40;	//  0x07B40
	int var_07B44;	//  0x07B44
	int var_07B48;	//  0x07B48
	int var_07B4C;	//  0x07B4C
	int var_07B50;	//  0x07B50
	int var_07B54;	//  0x07B54
	int var_07B58;	//  0x07B58
	int var_07B5C;	//  0x07B5C
	int var_07B60;	//  0x07B60
	int var_07B64;	//  0x07B64
	int var_07B68;	//  0x07B68
	int var_07B6C;	//  0x07B6C
	int var_07B70;	//  0x07B70
	int var_07B74;	//  0x07B74
	int var_07B78;	//  0x07B78
	int var_07B7C;	//  0x07B7C
	int var_07B80;	//  0x07B80
	int var_07B84;	//  0x07B84
	int var_07B88;	//  0x07B88
	int var_07B8C;	//  0x07B8C
	int var_07B90;	//  0x07B90
	int var_07B94;	//  0x07B94
	int var_07B98;	//  0x07B98
	int var_07B9C;	//  0x07B9C
	int var_07BA0;	//  0x07BA0
	int var_07BA4;	//  0x07BA4
	int var_07BA8;	//  0x07BA8
	int var_07BAC;	//  0x07BAC
	int var_07BB0;	//  0x07BB0
	int var_07BB4;	//  0x07BB4
	int var_07BB8;	//  0x07BB8
	int var_07BBC;	//  0x07BBC
	int var_07BC0;	//  0x07BC0
	int var_07BC4;	//  0x07BC4
	int var_07BC8;	//  0x07BC8
	int var_07BCC;	//  0x07BCC
	int var_07BD0;	//  0x07BD0
	int var_07BD4;	//  0x07BD4
	int var_07BD8;	//  0x07BD8
	int var_07BDC;	//  0x07BDC
	int var_07BE0;	//  0x07BE0
	int var_07BE4;	//  0x07BE4
	int var_07BE8;	//  0x07BE8
	int var_07BEC;	//  0x07BEC
	int var_07BF0;	//  0x07BF0
	int var_07BF4;	//  0x07BF4
	int var_07BF8;	//  0x07BF8
	int var_07BFC;	//  0x07BFC
	int var_07C00;	//  0x07C00
	int var_07C04;	//  0x07C04
	int var_07C08;	//  0x07C08
	int var_07C0C;	//  0x07C0C
	int var_07C10;	//  0x07C10
	int var_07C14;	//  0x07C14
	int var_07C18;	//  0x07C18
	int var_07C1C;	//  0x07C1C
	int var_07C20;	//  0x07C20
	int var_07C24;	//  0x07C24
	int var_07C28;	//  0x07C28
	int var_07C2C;	//  0x07C2C
	int var_07C30;	//  0x07C30
	int var_07C34;	//  0x07C34
	int var_07C38;	//  0x07C38
	int var_07C3C;	//  0x07C3C
	int var_07C40;	//  0x07C40
	int var_07C44;	//  0x07C44
	int var_07C48;	//  0x07C48
	int var_07C4C;	//  0x07C4C
	int var_07C50;	//  0x07C50
	int var_07C54;	//  0x07C54
	int var_07C58;	//  0x07C58
	int var_07C5C;	//  0x07C5C
	int var_07C60;	//  0x07C60
	int var_07C64;	//  0x07C64
	int var_07C68;	//  0x07C68
	int var_07C6C;	//  0x07C6C
	int var_07C70;	//  0x07C70
	int var_07C74;	//  0x07C74
	int var_07C78;	//  0x07C78
	int var_07C7C;	//  0x07C7C
	int var_07C80;	//  0x07C80
	int var_07C84;	//  0x07C84
	int var_07C88;	//  0x07C88
	int var_07C8C;	//  0x07C8C
	int var_07C90;	//  0x07C90
	int var_07C94;	//  0x07C94
	int var_07C98;	//  0x07C98
	int var_07C9C;	//  0x07C9C
	int var_07CA0;	//  0x07CA0
	int var_07CA4;	//  0x07CA4
	int var_07CA8;	//  0x07CA8
	int var_07CAC;	//  0x07CAC
	int var_07CB0;	//  0x07CB0
	int var_07CB4;	//  0x07CB4
	int var_07CB8;	//  0x07CB8
	int var_07CBC;	//  0x07CBC
	int var_07CC0;	//  0x07CC0
	int var_07CC4;	//  0x07CC4
	int var_07CC8;	//  0x07CC8
	int var_07CCC;	//  0x07CCC
	int var_07CD0;	//  0x07CD0
	int var_07CD4;	//  0x07CD4
	int var_07CD8;	//  0x07CD8
	int var_07CDC;	//  0x07CDC
	int var_07CE0;	//  0x07CE0
	int var_07CE4;	//  0x07CE4
	int var_07CE8;	//  0x07CE8
	int var_07CEC;	//  0x07CEC
	int var_07CF0;	//  0x07CF0
	int var_07CF4;	//  0x07CF4
	int var_07CF8;	//  0x07CF8
	int var_07CFC;	//  0x07CFC
	int var_07D00;	//  0x07D00
	int var_07D04;	//  0x07D04
	int var_07D08;	//  0x07D08
	int var_07D0C;	//  0x07D0C
	int var_07D10;	//  0x07D10
	int var_07D14;	//  0x07D14
	int var_07D18;	//  0x07D18
	int var_07D1C;	//  0x07D1C
	int var_07D20;	//  0x07D20
	int var_07D24;	//  0x07D24
	int var_07D28;	//  0x07D28
	int var_07D2C;	//  0x07D2C
	int var_07D30;	//  0x07D30
	int var_07D34;	//  0x07D34
	int var_07D38;	//  0x07D38
	int var_07D3C;	//  0x07D3C
	int var_07D40;	//  0x07D40
	int var_07D44;	//  0x07D44
	int var_07D48;	//  0x07D48
	int var_07D4C;	//  0x07D4C
	int var_07D50;	//  0x07D50
	int var_07D54;	//  0x07D54
	int var_07D58;	//  0x07D58
	int var_07D5C;	//  0x07D5C
	int var_07D60;	//  0x07D60
	int var_07D64;	//  0x07D64
	int var_07D68;	//  0x07D68
	int var_07D6C;	//  0x07D6C
	int var_07D70;	//  0x07D70
	int var_07D74;	//  0x07D74
	int var_07D78;	//  0x07D78
	int var_07D7C;	//  0x07D7C
	int var_07D80;	//  0x07D80
	int var_07D84;	//  0x07D84
	int var_07D88;	//  0x07D88
	int var_07D8C;	//  0x07D8C
	int var_07D90;	//  0x07D90
	int var_07D94;	//  0x07D94
	int var_07D98;	//  0x07D98
	int var_07D9C;	//  0x07D9C
	int var_07DA0;	//  0x07DA0
	int var_07DA4;	//  0x07DA4
	int var_07DA8;	//  0x07DA8
	int var_07DAC;	//  0x07DAC
	int var_07DB0;	//  0x07DB0
	int var_07DB4;	//  0x07DB4
	int var_07DB8;	//  0x07DB8
	int var_07DBC;	//  0x07DBC
	int var_07DC0;	//  0x07DC0
	int var_07DC4;	//  0x07DC4
	int var_07DC8;	//  0x07DC8
	int var_07DCC;	//  0x07DCC
	int var_07DD0;	//  0x07DD0
	int var_07DD4;	//  0x07DD4
	int var_07DD8;	//  0x07DD8
	int var_07DDC;	//  0x07DDC
	int var_07DE0;	//  0x07DE0
	int var_07DE4;	//  0x07DE4
	int var_07DE8;	//  0x07DE8
	int var_07DEC;	//  0x07DEC
	int var_07DF0;	//  0x07DF0
	int var_07DF4;	//  0x07DF4
	int var_07DF8;	//  0x07DF8
	int var_07DFC;	//  0x07DFC
	int var_07E00;	//  0x07E00
	int var_07E04;	//  0x07E04
	int var_07E08;	//  0x07E08
	int var_07E0C;	//  0x07E0C
	int var_07E10;	//  0x07E10
	int var_07E14;	//  0x07E14
	int var_07E18;	//  0x07E18
	int var_07E1C;	//  0x07E1C
	int var_07E20;	//  0x07E20
	int var_07E24;	//  0x07E24
	int var_07E28;	//  0x07E28
	int var_07E2C;	//  0x07E2C
	int var_07E30;	//  0x07E30
	int var_07E34;	//  0x07E34
	int var_07E38;	//  0x07E38
	int var_07E3C;	//  0x07E3C
	int var_07E40;	//  0x07E40
	int var_07E44;	//  0x07E44
	int var_07E48;	//  0x07E48
	int var_07E4C;	//  0x07E4C
	int var_07E50;	//  0x07E50
	int var_07E54;	//  0x07E54
	int var_07E58;	//  0x07E58
	int var_07E5C;	//  0x07E5C
	int var_07E60;	//  0x07E60
	int var_07E64;	//  0x07E64
	int var_07E68;	//  0x07E68
	int var_07E6C;	//  0x07E6C
	int var_07E70;	//  0x07E70
	int var_07E74;	//  0x07E74
	int var_07E78;	//  0x07E78
	int var_07E7C;	//  0x07E7C
	int var_07E80;	//  0x07E80
	int var_07E84;	//  0x07E84
	int var_07E88;	//  0x07E88
	int var_07E8C;	//  0x07E8C
	int var_07E90;	//  0x07E90
	int var_07E94;	//  0x07E94
	int var_07E98;	//  0x07E98
	int var_07E9C;	//  0x07E9C
	int var_07EA0;	//  0x07EA0
	int var_07EA4;	//  0x07EA4
	int var_07EA8;	//  0x07EA8
	int var_07EAC;	//  0x07EAC
	int var_07EB0;	//  0x07EB0
	int var_07EB4;	//  0x07EB4
	int var_07EB8;	//  0x07EB8
	int var_07EBC;	//  0x07EBC
	int var_07EC0;	//  0x07EC0
	int var_07EC4;	//  0x07EC4
	int var_07EC8;	//  0x07EC8
	int var_07ECC;	//  0x07ECC
	int var_07ED0;	//  0x07ED0
	int var_07ED4;	//  0x07ED4
	int var_07ED8;	//  0x07ED8
	int var_07EDC;	//  0x07EDC
	int var_07EE0;	//  0x07EE0
	int var_07EE4;	//  0x07EE4
	int var_07EE8;	//  0x07EE8
	int var_07EEC;	//  0x07EEC
	int var_07EF0;	//  0x07EF0
	int var_07EF4;	//  0x07EF4
	int var_07EF8;	//  0x07EF8
	int var_07EFC;	//  0x07EFC
	int var_07F00;	//  0x07F00
	int var_07F04;	//  0x07F04
	int var_07F08;	//  0x07F08
	int var_07F0C;	//  0x07F0C
	int var_07F10;	//  0x07F10
	int var_07F14;	//  0x07F14
	int var_07F18;	//  0x07F18
	int var_07F1C;	//  0x07F1C
	int var_07F20;	//  0x07F20
	int var_07F24;	//  0x07F24
	int var_07F28;	//  0x07F28
	int var_07F2C;	//  0x07F2C
	int var_07F30;	//  0x07F30
	int var_07F34;	//  0x07F34
	int var_07F38;	//  0x07F38
	int var_07F3C;	//  0x07F3C
	int var_07F40;	//  0x07F40
	int var_07F44;	//  0x07F44
	int var_07F48;	//  0x07F48
	int var_07F4C;	//  0x07F4C
	int var_07F50;	//  0x07F50
	int var_07F54;	//  0x07F54
	int var_07F58;	//  0x07F58
	int var_07F5C;	//  0x07F5C
	int var_07F60;	//  0x07F60
	int var_07F64;	//  0x07F64
	int var_07F68;	//  0x07F68
	int var_07F6C;	//  0x07F6C
	int var_07F70;	//  0x07F70
	int var_07F74;	//  0x07F74
	int var_07F78;	//  0x07F78
	int var_07F7C;	//  0x07F7C
	int var_07F80;	//  0x07F80
	int var_07F84;	//  0x07F84
	int var_07F88;	//  0x07F88
	int var_07F8C;	//  0x07F8C
	int var_07F90;	//  0x07F90
	int var_07F94;	//  0x07F94
	int var_07F98;	//  0x07F98
	int var_07F9C;	//  0x07F9C
	int var_07FA0;	//  0x07FA0
	int var_07FA4;	//  0x07FA4
	int var_07FA8;	//  0x07FA8
	int var_07FAC;	//  0x07FAC
	int var_07FB0;	//  0x07FB0
	int var_07FB4;	//  0x07FB4
	int var_07FB8;	//  0x07FB8
	int var_07FBC;	//  0x07FBC
	int var_07FC0;	//  0x07FC0
	int var_07FC4;	//  0x07FC4
	int var_07FC8;	//  0x07FC8
	int var_07FCC;	//  0x07FCC
	int var_07FD0;	//  0x07FD0
	int var_07FD4;	//  0x07FD4
	int var_07FD8;	//  0x07FD8
	int var_07FDC;	//  0x07FDC
	int var_07FE0;	//  0x07FE0
	int var_07FE4;	//  0x07FE4
	int var_07FE8;	//  0x07FE8
	int var_07FEC;	//  0x07FEC
	int var_07FF0;	//  0x07FF0
	int var_07FF4;	//  0x07FF4
	int var_07FF8;	//  0x07FF8
	int var_07FFC;	//  0x07FFC
	int var_08000;	//  0x08000
	int var_08004;	//  0x08004
	int var_08008;	//  0x08008
	int var_0800C;	//  0x0800C
	int var_08010;	//  0x08010
	int var_08014;	//  0x08014
	int var_08018;	//  0x08018
	int var_0801C;	//  0x0801C
	int var_08020;	//  0x08020
	int var_08024;	//  0x08024
	int var_08028;	//  0x08028
	int var_0802C;	//  0x0802C
	int var_08030;	//  0x08030
	int var_08034;	//  0x08034
	int var_08038;	//  0x08038
	int var_0803C;	//  0x0803C
	int var_08040;	//  0x08040
	int var_08044;	//  0x08044
	int var_08048;	//  0x08048
	int var_0804C;	//  0x0804C
	int var_08050;	//  0x08050
	int var_08054;	//  0x08054
	int var_08058;	//  0x08058
	int var_0805C;	//  0x0805C
	int var_08060;	//  0x08060
	int var_08064;	//  0x08064
	int var_08068;	//  0x08068
	int var_0806C;	//  0x0806C
	int var_08070;	//  0x08070
	int var_08074;	//  0x08074
	int var_08078;	//  0x08078
	int var_0807C;	//  0x0807C
	int var_08080;	//  0x08080
	int var_08084;	//  0x08084
	int var_08088;	//  0x08088
	int var_0808C;	//  0x0808C
	int var_08090;	//  0x08090
	int var_08094;	//  0x08094
	int var_08098;	//  0x08098
	int var_0809C;	//  0x0809C
	int var_080A0;	//  0x080A0
	int var_080A4;	//  0x080A4
	int var_080A8;	//  0x080A8
	int var_080AC;	//  0x080AC
	int var_080B0;	//  0x080B0
	int var_080B4;	//  0x080B4
	int var_080B8;	//  0x080B8
	int var_080BC;	//  0x080BC
	int var_080C0;	//  0x080C0
	int var_080C4;	//  0x080C4
	int var_080C8;	//  0x080C8
	int var_080CC;	//  0x080CC
	int var_080D0;	//  0x080D0
	int var_080D4;	//  0x080D4
	int var_080D8;	//  0x080D8
	int var_080DC;	//  0x080DC
	int var_080E0;	//  0x080E0
	int var_080E4;	//  0x080E4
	int var_080E8;	//  0x080E8
	int var_080EC;	//  0x080EC
	int var_080F0;	//  0x080F0
	int var_080F4;	//  0x080F4
	int var_080F8;	//  0x080F8
	int var_080FC;	//  0x080FC
	int var_08100;	//  0x08100
	int var_08104;	//  0x08104
	int var_08108;	//  0x08108
	int var_0810C;	//  0x0810C
	int var_08110;	//  0x08110
	int var_08114;	//  0x08114
	int var_08118;	//  0x08118
	int var_0811C;	//  0x0811C
	int var_08120;	//  0x08120
	int var_08124;	//  0x08124
	int var_08128;	//  0x08128
	int var_0812C;	//  0x0812C
	int var_08130;	//  0x08130
	int var_08134;	//  0x08134
	int var_08138;	//  0x08138
	int var_0813C;	//  0x0813C
	int var_08140;	//  0x08140
	int var_08144;	//  0x08144
	int var_08148;	//  0x08148
	int var_0814C;	//  0x0814C
	int var_08150;	//  0x08150
	int var_08154;	//  0x08154
	int var_08158;	//  0x08158
	int var_0815C;	//  0x0815C
	int var_08160;	//  0x08160
	int var_08164;	//  0x08164
	int var_08168;	//  0x08168
	int var_0816C;	//  0x0816C
	int var_08170;	//  0x08170
	int var_08174;	//  0x08174
	int var_08178;	//  0x08178
	int var_0817C;	//  0x0817C
	int var_08180;	//  0x08180
	int var_08184;	//  0x08184
	int var_08188;	//  0x08188
	int var_0818C;	//  0x0818C
	int var_08190;	//  0x08190
	int var_08194;	//  0x08194
	int var_08198;	//  0x08198
	int var_0819C;	//  0x0819C
	int var_081A0;	//  0x081A0
	int var_081A4;	//  0x081A4
	int var_081A8;	//  0x081A8
	int var_081AC;	//  0x081AC
	int var_081B0;	//  0x081B0
	int var_081B4;	//  0x081B4
	int var_081B8;	//  0x081B8
	int var_081BC;	//  0x081BC
	int var_081C0;	//  0x081C0
	int var_081C4;	//  0x081C4
	int var_081C8;	//  0x081C8
	int var_081CC;	//  0x081CC
	int var_081D0;	//  0x081D0
	int var_081D4;	//  0x081D4
	int var_081D8;	//  0x081D8
	int var_081DC;	//  0x081DC
	int var_081E0;	//  0x081E0
	int var_081E4;	//  0x081E4
	int var_081E8;	//  0x081E8
	int var_081EC;	//  0x081EC
	int var_081F0;	//  0x081F0
	int var_081F4;	//  0x081F4
	int var_081F8;	//  0x081F8
	int var_081FC;	//  0x081FC
	int var_08200;	//  0x08200
	int var_08204;	//  0x08204
	int var_08208;	//  0x08208
	int var_0820C;	//  0x0820C
	int var_08210;	//  0x08210
	int var_08214;	//  0x08214
	int var_08218;	//  0x08218
	int var_0821C;	//  0x0821C
	int var_08220;	//  0x08220
	int var_08224;	//  0x08224
	int var_08228;	//  0x08228
	int var_0822C;	//  0x0822C
	int var_08230;	//  0x08230
	int var_08234;	//  0x08234
	int var_08238;	//  0x08238
	int var_0823C;	//  0x0823C
	int var_08240;	//  0x08240
	int var_08244;	//  0x08244
	int var_08248;	//  0x08248
	int var_0824C;	//  0x0824C
	int var_08250;	//  0x08250
	int var_08254;	//  0x08254
	int var_08258;	//  0x08258
	int var_0825C;	//  0x0825C
	int var_08260;	//  0x08260
	int var_08264;	//  0x08264
	int var_08268;	//  0x08268
	int var_0826C;	//  0x0826C
	int var_08270;	//  0x08270
	int var_08274;	//  0x08274
	int var_08278;	//  0x08278
	int var_0827C;	//  0x0827C
	int var_08280;	//  0x08280
	int var_08284;	//  0x08284
	int var_08288;	//  0x08288
	int var_0828C;	//  0x0828C
	int var_08290;	//  0x08290
	int var_08294;	//  0x08294
	int var_08298;	//  0x08298
	int var_0829C;	//  0x0829C
	int var_082A0;	//  0x082A0
	int var_082A4;	//  0x082A4
	int var_082A8;	//  0x082A8
	int var_082AC;	//  0x082AC
	int var_082B0;	//  0x082B0
	int var_082B4;	//  0x082B4
	int var_082B8;	//  0x082B8
	int var_082BC;	//  0x082BC
	int var_082C0;	//  0x082C0
	int var_082C4;	//  0x082C4
	int var_082C8;	//  0x082C8
	int var_082CC;	//  0x082CC
	int var_082D0;	//  0x082D0
	int var_082D4;	//  0x082D4
	int var_082D8;	//  0x082D8
	int var_082DC;	//  0x082DC
	int var_082E0;	//  0x082E0
	int var_082E4;	//  0x082E4
	int var_082E8;	//  0x082E8
	int var_082EC;	//  0x082EC
	int var_082F0;	//  0x082F0
	int var_082F4;	//  0x082F4
	int var_082F8;	//  0x082F8
	int var_082FC;	//  0x082FC
	int var_08300;	//  0x08300
	int var_08304;	//  0x08304
	int var_08308;	//  0x08308
	int var_0830C;	//  0x0830C
	int var_08310;	//  0x08310
	int var_08314;	//  0x08314
	int var_08318;	//  0x08318
	int var_0831C;	//  0x0831C
	int var_08320;	//  0x08320
	int var_08324;	//  0x08324
	int var_08328;	//  0x08328
	int var_0832C;	//  0x0832C
	int var_08330;	//  0x08330
	int var_08334;	//  0x08334
	int var_08338;	//  0x08338
	int var_0833C;	//  0x0833C
	int var_08340;	//  0x08340
	int var_08344;	//  0x08344
	int var_08348;	//  0x08348
	int var_0834C;	//  0x0834C
	int var_08350;	//  0x08350
	int var_08354;	//  0x08354
	int var_08358;	//  0x08358
	int var_0835C;	//  0x0835C
	int var_08360;	//  0x08360
	int var_08364;	//  0x08364
	int var_08368;	//  0x08368
	int var_0836C;	//  0x0836C
	int var_08370;	//  0x08370
	int var_08374;	//  0x08374
	int var_08378;	//  0x08378
	int var_0837C;	//  0x0837C
	int var_08380;	//  0x08380
	int var_08384;	//  0x08384
	int var_08388;	//  0x08388
	int var_0838C;	//  0x0838C
	int var_08390;	//  0x08390
	int var_08394;	//  0x08394
	int var_08398;	//  0x08398
	int var_0839C;	//  0x0839C
	int var_083A0;	//  0x083A0
	int var_083A4;	//  0x083A4
	int var_083A8;	//  0x083A8
	int var_083AC;	//  0x083AC
	int var_083B0;	//  0x083B0
	int var_083B4;	//  0x083B4
	int var_083B8;	//  0x083B8
	int var_083BC;	//  0x083BC
	int var_083C0;	//  0x083C0
	int var_083C4;	//  0x083C4
	int var_083C8;	//  0x083C8
	int var_083CC;	//  0x083CC
	int var_083D0;	//  0x083D0
	int var_083D4;	//  0x083D4
	int var_083D8;	//  0x083D8
	int var_083DC;	//  0x083DC
	int var_083E0;	//  0x083E0
	int var_083E4;	//  0x083E4
	int var_083E8;	//  0x083E8
	int var_083EC;	//  0x083EC
	int var_083F0;	//  0x083F0
	int var_083F4;	//  0x083F4
	int var_083F8;	//  0x083F8
	int var_083FC;	//  0x083FC
	int var_08400;	//  0x08400
	int var_08404;	//  0x08404
	int var_08408;	//  0x08408
	int var_0840C;	//  0x0840C
	int var_08410;	//  0x08410
	int var_08414;	//  0x08414
	int var_08418;	//  0x08418
	int var_0841C;	//  0x0841C
	int var_08420;	//  0x08420
	int var_08424;	//  0x08424
	int var_08428;	//  0x08428
	int var_0842C;	//  0x0842C
	int var_08430;	//  0x08430
	int var_08434;	//  0x08434
	int var_08438;	//  0x08438
	int var_0843C;	//  0x0843C
	int var_08440;	//  0x08440
	int var_08444;	//  0x08444
	int var_08448;	//  0x08448
	int var_0844C;	//  0x0844C
	int var_08450;	//  0x08450
	int var_08454;	//  0x08454
	int var_08458;	//  0x08458
	int var_0845C;	//  0x0845C
	int var_08460;	//  0x08460
	int var_08464;	//  0x08464
	int var_08468;	//  0x08468
	int var_0846C;	//  0x0846C
	int var_08470;	//  0x08470
	int var_08474;	//  0x08474
	int var_08478;	//  0x08478
	int var_0847C;	//  0x0847C
	int var_08480;	//  0x08480
	int var_08484;	//  0x08484
	int var_08488;	//  0x08488
	int var_0848C;	//  0x0848C
	int var_08490;	//  0x08490
	int var_08494;	//  0x08494
	int var_08498;	//  0x08498
	int var_0849C;	//  0x0849C
	int var_084A0;	//  0x084A0
	int var_084A4;	//  0x084A4
	int var_084A8;	//  0x084A8
	int var_084AC;	//  0x084AC
	int var_084B0;	//  0x084B0
	int var_084B4;	//  0x084B4
	int var_084B8;	//  0x084B8
	int var_084BC;	//  0x084BC
	int var_084C0;	//  0x084C0
	int var_084C4;	//  0x084C4
	int var_084C8;	//  0x084C8
	int var_084CC;	//  0x084CC
	int var_084D0;	//  0x084D0
	int var_084D4;	//  0x084D4
	int var_084D8;	//  0x084D8
	int var_084DC;	//  0x084DC
	int var_084E0;	//  0x084E0
	int var_084E4;	//  0x084E4
	int var_084E8;	//  0x084E8
	int var_084EC;	//  0x084EC
	int var_084F0;	//  0x084F0
	int var_084F4;	//  0x084F4
	int var_084F8;	//  0x084F8
	int var_084FC;	//  0x084FC
	int var_08500;	//  0x08500
	int var_08504;	//  0x08504
	int var_08508;	//  0x08508
	int var_0850C;	//  0x0850C
	int var_08510;	//  0x08510
	int var_08514;	//  0x08514
	int var_08518;	//  0x08518
	int var_0851C;	//  0x0851C
	int var_08520;	//  0x08520
	int var_08524;	//  0x08524
	int var_08528;	//  0x08528
	int var_0852C;	//  0x0852C
	int var_08530;	//  0x08530
	int var_08534;	//  0x08534
	int var_08538;	//  0x08538
	int var_0853C;	//  0x0853C
	int var_08540;	//  0x08540
	int var_08544;	//  0x08544
	int var_08548;	//  0x08548
	int var_0854C;	//  0x0854C
	int var_08550;	//  0x08550
	int var_08554;	//  0x08554
	int var_08558;	//  0x08558
	int var_0855C;	//  0x0855C
	int var_08560;	//  0x08560
	int var_08564;	//  0x08564
	int var_08568;	//  0x08568
	int var_0856C;	//  0x0856C
	int var_08570;	//  0x08570
	int var_08574;	//  0x08574
	int var_08578;	//  0x08578
	int var_0857C;	//  0x0857C
	int var_08580;	//  0x08580
	int var_08584;	//  0x08584
	int var_08588;	//  0x08588
	int var_0858C;	//  0x0858C
	int var_08590;	//  0x08590
	int var_08594;	//  0x08594
	int var_08598;	//  0x08598
	int var_0859C;	//  0x0859C
	int var_085A0;	//  0x085A0
	int var_085A4;	//  0x085A4
	int var_085A8;	//  0x085A8
	int var_085AC;	//  0x085AC
	int var_085B0;	//  0x085B0
	int var_085B4;	//  0x085B4
	int var_085B8;	//  0x085B8
	int var_085BC;	//  0x085BC
	int var_085C0;	//  0x085C0
	int var_085C4;	//  0x085C4
	int var_085C8;	//  0x085C8
	int var_085CC;	//  0x085CC
	int var_085D0;	//  0x085D0
	int var_085D4;	//  0x085D4
	int var_085D8;	//  0x085D8
	int var_085DC;	//  0x085DC
	int var_085E0;	//  0x085E0
	int var_085E4;	//  0x085E4
	int var_085E8;	//  0x085E8
	int var_085EC;	//  0x085EC
	int var_085F0;	//  0x085F0
	int var_085F4;	//  0x085F4
	int var_085F8;	//  0x085F8
	int var_085FC;	//  0x085FC
	int var_08600;	//  0x08600
	int var_08604;	//  0x08604
	int var_08608;	//  0x08608
	int var_0860C;	//  0x0860C
	int var_08610;	//  0x08610
	int var_08614;	//  0x08614
	int var_08618;	//  0x08618
	int var_0861C;	//  0x0861C
	int var_08620;	//  0x08620
	int var_08624;	//  0x08624
	int var_08628;	//  0x08628
	int var_0862C;	//  0x0862C
	int var_08630;	//  0x08630
	int var_08634;	//  0x08634
	int var_08638;	//  0x08638
	int var_0863C;	//  0x0863C
	int var_08640;	//  0x08640
	int var_08644;	//  0x08644
	int var_08648;	//  0x08648
	int var_0864C;	//  0x0864C
	int var_08650;	//  0x08650
	int var_08654;	//  0x08654
	int var_08658;	//  0x08658
	int var_0865C;	//  0x0865C
	int var_08660;	//  0x08660
	int var_08664;	//  0x08664
	int var_08668;	//  0x08668
	int var_0866C;	//  0x0866C
	int var_08670;	//  0x08670
	int var_08674;	//  0x08674
	int var_08678;	//  0x08678
	int var_0867C;	//  0x0867C
	int var_08680;	//  0x08680
	int var_08684;	//  0x08684
	int var_08688;	//  0x08688
	int var_0868C;	//  0x0868C
	int var_08690;	//  0x08690
	int var_08694;	//  0x08694
	int var_08698;	//  0x08698
	int var_0869C;	//  0x0869C
	int var_086A0;	//  0x086A0
	int var_086A4;	//  0x086A4
	int var_086A8;	//  0x086A8
	int var_086AC;	//  0x086AC
	int var_086B0;	//  0x086B0
	int var_086B4;	//  0x086B4
	int var_086B8;	//  0x086B8
	int var_086BC;	//  0x086BC
	int var_086C0;	//  0x086C0
	int var_086C4;	//  0x086C4
	int var_086C8;	//  0x086C8
	int var_086CC;	//  0x086CC
	int var_086D0;	//  0x086D0
	int var_086D4;	//  0x086D4
	int var_086D8;	//  0x086D8
	int var_086DC;	//  0x086DC
	int var_086E0;	//  0x086E0
	int var_086E4;	//  0x086E4
	int var_086E8;	//  0x086E8
	int var_086EC;	//  0x086EC
	int var_086F0;	//  0x086F0
	int var_086F4;	//  0x086F4
	int var_086F8;	//  0x086F8
	int var_086FC;	//  0x086FC
	int var_08700;	//  0x08700
	int var_08704;	//  0x08704
	int var_08708;	//  0x08708
	int var_0870C;	//  0x0870C
	int var_08710;	//  0x08710
	int var_08714;	//  0x08714
	int var_08718;	//  0x08718
	int var_0871C;	//  0x0871C
	int var_08720;	//  0x08720
	int var_08724;	//  0x08724
	int var_08728;	//  0x08728
	int var_0872C;	//  0x0872C
	int var_08730;	//  0x08730
	int var_08734;	//  0x08734
	int var_08738;	//  0x08738
	int var_0873C;	//  0x0873C
	int var_08740;	//  0x08740
	int var_08744;	//  0x08744
	int var_08748;	//  0x08748
	int var_0874C;	//  0x0874C
	int var_08750;	//  0x08750
	int var_08754;	//  0x08754
	int var_08758;	//  0x08758
	int var_0875C;	//  0x0875C
	int var_08760;	//  0x08760
	int var_08764;	//  0x08764
	int var_08768;	//  0x08768
	int var_0876C;	//  0x0876C
	int var_08770;	//  0x08770
	int var_08774;	//  0x08774
	int var_08778;	//  0x08778
	int var_0877C;	//  0x0877C
	int var_08780;	//  0x08780
	int var_08784;	//  0x08784
	int var_08788;	//  0x08788
	int var_0878C;	//  0x0878C
	int var_08790;	//  0x08790
	int var_08794;	//  0x08794
	int var_08798;	//  0x08798
	int var_0879C;	//  0x0879C
	int var_087A0;	//  0x087A0
	int var_087A4;	//  0x087A4
	int var_087A8;	//  0x087A8
	int var_087AC;	//  0x087AC
	int var_087B0;	//  0x087B0
	int var_087B4;	//  0x087B4
	int var_087B8;	//  0x087B8
	int var_087BC;	//  0x087BC
	int var_087C0;	//  0x087C0
	int var_087C4;	//  0x087C4
	int var_087C8;	//  0x087C8
	int var_087CC;	//  0x087CC
	int var_087D0;	//  0x087D0
	int var_087D4;	//  0x087D4
	int var_087D8;	//  0x087D8
	int var_087DC;	//  0x087DC
	int var_087E0;	//  0x087E0
	int var_087E4;	//  0x087E4
	int var_087E8;	//  0x087E8
	int var_087EC;	//  0x087EC
	int var_087F0;	//  0x087F0
	int var_087F4;	//  0x087F4
	int var_087F8;	//  0x087F8
	int var_087FC;	//  0x087FC
	int var_08800;	//  0x08800
	int var_08804;	//  0x08804
	int var_08808;	//  0x08808
	int var_0880C;	//  0x0880C
	int var_08810;	//  0x08810
	int var_08814;	//  0x08814
	int var_08818;	//  0x08818
	int var_0881C;	//  0x0881C
	int var_08820;	//  0x08820
	int var_08824;	//  0x08824
	int var_08828;	//  0x08828
	int var_0882C;	//  0x0882C
	int var_08830;	//  0x08830
	int var_08834;	//  0x08834
	int var_08838;	//  0x08838
	int var_0883C;	//  0x0883C
	int var_08840;	//  0x08840
	int var_08844;	//  0x08844
	int var_08848;	//  0x08848
	int var_0884C;	//  0x0884C
	int var_08850;	//  0x08850
	int var_08854;	//  0x08854
	int var_08858;	//  0x08858
	int var_0885C;	//  0x0885C
	int var_08860;	//  0x08860
	int var_08864;	//  0x08864
	int var_08868;	//  0x08868
	int var_0886C;	//  0x0886C
	int var_08870;	//  0x08870
	int var_08874;	//  0x08874
	int var_08878;	//  0x08878
	int var_0887C;	//  0x0887C
	int var_08880;	//  0x08880
	int var_08884;	//  0x08884
	int var_08888;	//  0x08888
	int var_0888C;	//  0x0888C
	int var_08890;	//  0x08890
	int var_08894;	//  0x08894
	int var_08898;	//  0x08898
	int var_0889C;	//  0x0889C
	int var_088A0;	//  0x088A0
	int var_088A4;	//  0x088A4
	int var_088A8;	//  0x088A8
	int var_088AC;	//  0x088AC
	int var_088B0;	//  0x088B0
	int var_088B4;	//  0x088B4
	int var_088B8;	//  0x088B8
	int var_088BC;	//  0x088BC
	int var_088C0;	//  0x088C0
	int var_088C4;	//  0x088C4
	int var_088C8;	//  0x088C8
	int var_088CC;	//  0x088CC
	int var_088D0;	//  0x088D0
	int var_088D4;	//  0x088D4
	int var_088D8;	//  0x088D8
	int var_088DC;	//  0x088DC
	int var_088E0;	//  0x088E0
	int var_088E4;	//  0x088E4
	int var_088E8;	//  0x088E8
	int var_088EC;	//  0x088EC
	int var_088F0;	//  0x088F0
	int var_088F4;	//  0x088F4
	int var_088F8;	//  0x088F8
	int var_088FC;	//  0x088FC
	int var_08900;	//  0x08900
	int var_08904;	//  0x08904
	int var_08908;	//  0x08908
	int var_0890C;	//  0x0890C
	int var_08910;	//  0x08910
	int var_08914;	//  0x08914
	int var_08918;	//  0x08918
	int var_0891C;	//  0x0891C
	int var_08920;	//  0x08920
	int var_08924;	//  0x08924
	int var_08928;	//  0x08928
	int var_0892C;	//  0x0892C
	int var_08930;	//  0x08930
	int var_08934;	//  0x08934
	int var_08938;	//  0x08938
	int var_0893C;	//  0x0893C
	int var_08940;	//  0x08940
	int var_08944;	//  0x08944
	int var_08948;	//  0x08948
	int var_0894C;	//  0x0894C
	int var_08950;	//  0x08950
	int var_08954;	//  0x08954
	int var_08958;	//  0x08958
	int var_0895C;	//  0x0895C
	int var_08960;	//  0x08960
	int var_08964;	//  0x08964
	int var_08968;	//  0x08968
	int var_0896C;	//  0x0896C
	int var_08970;	//  0x08970
	int var_08974;	//  0x08974
	int var_08978;	//  0x08978
	int var_0897C;	//  0x0897C
	int var_08980;	//  0x08980
	int var_08984;	//  0x08984
	int var_08988;	//  0x08988
	int var_0898C;	//  0x0898C
	int var_08990;	//  0x08990
	int var_08994;	//  0x08994
	int var_08998;	//  0x08998
	int var_0899C;	//  0x0899C
	int var_089A0;	//  0x089A0
	int var_089A4;	//  0x089A4
	int var_089A8;	//  0x089A8
	int var_089AC;	//  0x089AC
	int var_089B0;	//  0x089B0
	int var_089B4;	//  0x089B4
	int var_089B8;	//  0x089B8
	int var_089BC;	//  0x089BC
	int var_089C0;	//  0x089C0
	int var_089C4;	//  0x089C4
	int var_089C8;	//  0x089C8
	int var_089CC;	//  0x089CC
	int var_089D0;	//  0x089D0
	int var_089D4;	//  0x089D4
	int var_089D8;	//  0x089D8
	int var_089DC;	//  0x089DC
	int var_089E0;	//  0x089E0
	int var_089E4;	//  0x089E4
	int var_089E8;	//  0x089E8
	int var_089EC;	//  0x089EC
	int var_089F0;	//  0x089F0
	int var_089F4;	//  0x089F4
	int var_089F8;	//  0x089F8
	int var_089FC;	//  0x089FC
	int var_08A00;	//  0x08A00
	int var_08A04;	//  0x08A04
	int var_08A08;	//  0x08A08
	int var_08A0C;	//  0x08A0C
	int var_08A10;	//  0x08A10
	int var_08A14;	//  0x08A14
	int var_08A18;	//  0x08A18
	int var_08A1C;	//  0x08A1C
	int var_08A20;	//  0x08A20
	int var_08A24;	//  0x08A24
	int var_08A28;	//  0x08A28
	int var_08A2C;	//  0x08A2C
	int var_08A30;	//  0x08A30
	int var_08A34;	//  0x08A34
	int var_08A38;	//  0x08A38
	int var_08A3C;	//  0x08A3C
	int var_08A40;	//  0x08A40
	int var_08A44;	//  0x08A44
	int var_08A48;	//  0x08A48
	int var_08A4C;	//  0x08A4C
	int var_08A50;	//  0x08A50
	int var_08A54;	//  0x08A54
	int var_08A58;	//  0x08A58
	int var_08A5C;	//  0x08A5C
	int var_08A60;	//  0x08A60
	int var_08A64;	//  0x08A64
	int var_08A68;	//  0x08A68
	int var_08A6C;	//  0x08A6C
	int var_08A70;	//  0x08A70
	int var_08A74;	//  0x08A74
	int var_08A78;	//  0x08A78
	int var_08A7C;	//  0x08A7C
	int var_08A80;	//  0x08A80
	int var_08A84;	//  0x08A84
	int var_08A88;	//  0x08A88
	int var_08A8C;	//  0x08A8C
	int var_08A90;	//  0x08A90
	int var_08A94;	//  0x08A94
	int var_08A98;	//  0x08A98
	int var_08A9C;	//  0x08A9C
	int var_08AA0;	//  0x08AA0
	int var_08AA4;	//  0x08AA4
	int var_08AA8;	//  0x08AA8
	int var_08AAC;	//  0x08AAC
	int var_08AB0;	//  0x08AB0
	int var_08AB4;	//  0x08AB4
	int var_08AB8;	//  0x08AB8
	int var_08ABC;	//  0x08ABC
	int var_08AC0;	//  0x08AC0
	int var_08AC4;	//  0x08AC4
	int var_08AC8;	//  0x08AC8
	int var_08ACC;	//  0x08ACC
	int var_08AD0;	//  0x08AD0
	int var_08AD4;	//  0x08AD4
	int var_08AD8;	//  0x08AD8
	int var_08ADC;	//  0x08ADC
	int var_08AE0;	//  0x08AE0
	int var_08AE4;	//  0x08AE4
	int var_08AE8;	//  0x08AE8
	int var_08AEC;	//  0x08AEC
	int var_08AF0;	//  0x08AF0
	int var_08AF4;	//  0x08AF4
	int var_08AF8;	//  0x08AF8
	int var_08AFC;	//  0x08AFC
	int var_08B00;	//  0x08B00
	int var_08B04;	//  0x08B04
	int var_08B08;	//  0x08B08
	int var_08B0C;	//  0x08B0C
	int var_08B10;	//  0x08B10
	int var_08B14;	//  0x08B14
	int var_08B18;	//  0x08B18
	int var_08B1C;	//  0x08B1C
	int var_08B20;	//  0x08B20
	int var_08B24;	//  0x08B24
	int var_08B28;	//  0x08B28
	int var_08B2C;	//  0x08B2C
	int var_08B30;	//  0x08B30
	int var_08B34;	//  0x08B34
	int var_08B38;	//  0x08B38
	int var_08B3C;	//  0x08B3C
	int var_08B40;	//  0x08B40
	int var_08B44;	//  0x08B44
	int var_08B48;	//  0x08B48
	int var_08B4C;	//  0x08B4C
	int var_08B50;	//  0x08B50
	int var_08B54;	//  0x08B54
	int var_08B58;	//  0x08B58
	int var_08B5C;	//  0x08B5C
	int var_08B60;	//  0x08B60
	int var_08B64;	//  0x08B64
	int var_08B68;	//  0x08B68
	int var_08B6C;	//  0x08B6C
	int var_08B70;	//  0x08B70
	int var_08B74;	//  0x08B74
	int var_08B78;	//  0x08B78
	int var_08B7C;	//  0x08B7C
	int var_08B80;	//  0x08B80
	int var_08B84;	//  0x08B84
	int var_08B88;	//  0x08B88
	int var_08B8C;	//  0x08B8C
	int var_08B90;	//  0x08B90
	int var_08B94;	//  0x08B94
	int var_08B98;	//  0x08B98
	int var_08B9C;	//  0x08B9C
	int var_08BA0;	//  0x08BA0
	int var_08BA4;	//  0x08BA4
	int var_08BA8;	//  0x08BA8
	int var_08BAC;	//  0x08BAC
	int var_08BB0;	//  0x08BB0
	int var_08BB4;	//  0x08BB4
	int var_08BB8;	//  0x08BB8
	int var_08BBC;	//  0x08BBC
	int var_08BC0;	//  0x08BC0
	int var_08BC4;	//  0x08BC4
	int var_08BC8;	//  0x08BC8
	int var_08BCC;	//  0x08BCC
	int var_08BD0;	//  0x08BD0
	int var_08BD4;	//  0x08BD4
	int var_08BD8;	//  0x08BD8
	int var_08BDC;	//  0x08BDC
	int var_08BE0;	//  0x08BE0
	int var_08BE4;	//  0x08BE4
	int var_08BE8;	//  0x08BE8
	int var_08BEC;	//  0x08BEC
	int var_08BF0;	//  0x08BF0
	int var_08BF4;	//  0x08BF4
	int var_08BF8;	//  0x08BF8
	int var_08BFC;	//  0x08BFC
	int var_08C00;	//  0x08C00
	int var_08C04;	//  0x08C04
	int var_08C08;	//  0x08C08
	int var_08C0C;	//  0x08C0C
	int var_08C10;	//  0x08C10
	int var_08C14;	//  0x08C14
	int var_08C18;	//  0x08C18
	int var_08C1C;	//  0x08C1C
	int var_08C20;	//  0x08C20
	int var_08C24;	//  0x08C24
	int var_08C28;	//  0x08C28
	int var_08C2C;	//  0x08C2C
	int var_08C30;	//  0x08C30
	int var_08C34;	//  0x08C34
	int var_08C38;	//  0x08C38
	int var_08C3C;	//  0x08C3C
	int var_08C40;	//  0x08C40
	int var_08C44;	//  0x08C44
	int var_08C48;	//  0x08C48
	int var_08C4C;	//  0x08C4C
	int var_08C50;	//  0x08C50
	int var_08C54;	//  0x08C54
	int var_08C58;	//  0x08C58
	int var_08C5C;	//  0x08C5C
	int var_08C60;	//  0x08C60
	int var_08C64;	//  0x08C64
	int var_08C68;	//  0x08C68
	int var_08C6C;	//  0x08C6C
	int var_08C70;	//  0x08C70
	int var_08C74;	//  0x08C74
	int var_08C78;	//  0x08C78
	int var_08C7C;	//  0x08C7C
	int var_08C80;	//  0x08C80
	int var_08C84;	//  0x08C84
	int var_08C88;	//  0x08C88
	int var_08C8C;	//  0x08C8C
	int var_08C90;	//  0x08C90
	int var_08C94;	//  0x08C94
	int var_08C98;	//  0x08C98
	int var_08C9C;	//  0x08C9C
	int var_08CA0;	//  0x08CA0
	int var_08CA4;	//  0x08CA4
	int var_08CA8;	//  0x08CA8
	int var_08CAC;	//  0x08CAC
	int var_08CB0;	//  0x08CB0
	int var_08CB4;	//  0x08CB4
	int var_08CB8;	//  0x08CB8
	int var_08CBC;	//  0x08CBC
	int var_08CC0;	//  0x08CC0
	int var_08CC4;	//  0x08CC4
	int var_08CC8;	//  0x08CC8
	int var_08CCC;	//  0x08CCC
	int var_08CD0;	//  0x08CD0
	int var_08CD4;	//  0x08CD4
	int var_08CD8;	//  0x08CD8
	int var_08CDC;	//  0x08CDC
	int var_08CE0;	//  0x08CE0
	int var_08CE4;	//  0x08CE4
	int var_08CE8;	//  0x08CE8
	int var_08CEC;	//  0x08CEC
	int var_08CF0;	//  0x08CF0
	int var_08CF4;	//  0x08CF4
	int var_08CF8;	//  0x08CF8
	int var_08CFC;	//  0x08CFC
	int var_08D00;	//  0x08D00
	int var_08D04;	//  0x08D04
	int var_08D08;	//  0x08D08
	int var_08D0C;	//  0x08D0C
	int var_08D10;	//  0x08D10
	int var_08D14;	//  0x08D14
	int var_08D18;	//  0x08D18
	int var_08D1C;	//  0x08D1C
	int var_08D20;	//  0x08D20
	int var_08D24;	//  0x08D24
	int var_08D28;	//  0x08D28
	int var_08D2C;	//  0x08D2C
	int var_08D30;	//  0x08D30
	int var_08D34;	//  0x08D34
	int var_08D38;	//  0x08D38
	int var_08D3C;	//  0x08D3C
	int var_08D40;	//  0x08D40
	int var_08D44;	//  0x08D44
	int var_08D48;	//  0x08D48
	int var_08D4C;	//  0x08D4C
	int var_08D50;	//  0x08D50
	int var_08D54;	//  0x08D54
	int var_08D58;	//  0x08D58
	int var_08D5C;	//  0x08D5C
	int var_08D60;	//  0x08D60
	int var_08D64;	//  0x08D64
	int var_08D68;	//  0x08D68
	int var_08D6C;	//  0x08D6C
	int var_08D70;	//  0x08D70
	int var_08D74;	//  0x08D74
	int var_08D78;	//  0x08D78
	int var_08D7C;	//  0x08D7C
	int var_08D80;	//  0x08D80
	int var_08D84;	//  0x08D84
	int var_08D88;	//  0x08D88
	int var_08D8C;	//  0x08D8C
	int var_08D90;	//  0x08D90
	int var_08D94;	//  0x08D94
	int var_08D98;	//  0x08D98
	int var_08D9C;	//  0x08D9C
	int var_08DA0;	//  0x08DA0
	int var_08DA4;	//  0x08DA4
	int var_08DA8;	//  0x08DA8
	int var_08DAC;	//  0x08DAC
	int var_08DB0;	//  0x08DB0
	int var_08DB4;	//  0x08DB4
	int var_08DB8;	//  0x08DB8
	int var_08DBC;	//  0x08DBC
	int var_08DC0;	//  0x08DC0
	int var_08DC4;	//  0x08DC4
	int var_08DC8;	//  0x08DC8
	int var_08DCC;	//  0x08DCC
	int var_08DD0;	//  0x08DD0
	int var_08DD4;	//  0x08DD4
	int var_08DD8;	//  0x08DD8
	int var_08DDC;	//  0x08DDC
	int var_08DE0;	//  0x08DE0
	int var_08DE4;	//  0x08DE4
	int var_08DE8;	//  0x08DE8
	int var_08DEC;	//  0x08DEC
	int var_08DF0;	//  0x08DF0
	int var_08DF4;	//  0x08DF4
	int var_08DF8;	//  0x08DF8
	int var_08DFC;	//  0x08DFC
	int var_08E00;	//  0x08E00
	int var_08E04;	//  0x08E04
	int var_08E08;	//  0x08E08
	int var_08E0C;	//  0x08E0C
	int var_08E10;	//  0x08E10
	int var_08E14;	//  0x08E14
	int var_08E18;	//  0x08E18
	int var_08E1C;	//  0x08E1C
	int var_08E20;	//  0x08E20
	int var_08E24;	//  0x08E24
	int var_08E28;	//  0x08E28
	int var_08E2C;	//  0x08E2C
	int var_08E30;	//  0x08E30
	int var_08E34;	//  0x08E34
	int var_08E38;	//  0x08E38
	int var_08E3C;	//  0x08E3C
	int var_08E40;	//  0x08E40
	int var_08E44;	//  0x08E44
	int var_08E48;	//  0x08E48
	int var_08E4C;	//  0x08E4C
	int var_08E50;	//  0x08E50
	int var_08E54;	//  0x08E54
	int var_08E58;	//  0x08E58
	int var_08E5C;	//  0x08E5C
	int var_08E60;	//  0x08E60
	int var_08E64;	//  0x08E64
	int var_08E68;	//  0x08E68
	int var_08E6C;	//  0x08E6C
	int var_08E70;	//  0x08E70
	int var_08E74;	//  0x08E74
	int var_08E78;	//  0x08E78
	int var_08E7C;	//  0x08E7C
	int var_08E80;	//  0x08E80
	int var_08E84;	//  0x08E84
	int var_08E88;	//  0x08E88
	int var_08E8C;	//  0x08E8C
	int var_08E90;	//  0x08E90
	int var_08E94;	//  0x08E94
	int var_08E98;	//  0x08E98
	int var_08E9C;	//  0x08E9C
	int var_08EA0;	//  0x08EA0
	int var_08EA4;	//  0x08EA4
	int var_08EA8;	//  0x08EA8
	int var_08EAC;	//  0x08EAC
	int var_08EB0;	//  0x08EB0
	int var_08EB4;	//  0x08EB4
	int var_08EB8;	//  0x08EB8
	int var_08EBC;	//  0x08EBC
	int var_08EC0;	//  0x08EC0
	int var_08EC4;	//  0x08EC4
	int var_08EC8;	//  0x08EC8
	int var_08ECC;	//  0x08ECC
	int var_08ED0;	//  0x08ED0
	int var_08ED4;	//  0x08ED4
	int var_08ED8;	//  0x08ED8
	int var_08EDC;	//  0x08EDC
	int var_08EE0;	//  0x08EE0
	int var_08EE4;	//  0x08EE4
	int var_08EE8;	//  0x08EE8
	int var_08EEC;	//  0x08EEC
	int var_08EF0;	//  0x08EF0
	int var_08EF4;	//  0x08EF4
	int var_08EF8;	//  0x08EF8
	int var_08EFC;	//  0x08EFC
	int var_08F00;	//  0x08F00
	int var_08F04;	//  0x08F04
	int var_08F08;	//  0x08F08
	int var_08F0C;	//  0x08F0C
	int var_08F10;	//  0x08F10
	int var_08F14;	//  0x08F14
	int var_08F18;	//  0x08F18
	int var_08F1C;	//  0x08F1C
	int var_08F20;	//  0x08F20
	int var_08F24;	//  0x08F24
	int var_08F28;	//  0x08F28
	int var_08F2C;	//  0x08F2C
	int var_08F30;	//  0x08F30
	int var_08F34;	//  0x08F34
	int var_08F38;	//  0x08F38
	int var_08F3C;	//  0x08F3C
	int var_08F40;	//  0x08F40
	int var_08F44;	//  0x08F44
	int var_08F48;	//  0x08F48
	int var_08F4C;	//  0x08F4C
	int var_08F50;	//  0x08F50
	int var_08F54;	//  0x08F54
	int var_08F58;	//  0x08F58
	int var_08F5C;	//  0x08F5C
	int var_08F60;	//  0x08F60
	int var_08F64;	//  0x08F64
	int var_08F68;	//  0x08F68
	int var_08F6C;	//  0x08F6C
	int var_08F70;	//  0x08F70
	int var_08F74;	//  0x08F74
	int var_08F78;	//  0x08F78
	int var_08F7C;	//  0x08F7C
	int var_08F80;	//  0x08F80
	int var_08F84;	//  0x08F84
	int var_08F88;	//  0x08F88
	int var_08F8C;	//  0x08F8C
	int var_08F90;	//  0x08F90
	int var_08F94;	//  0x08F94
	int var_08F98;	//  0x08F98
	int var_08F9C;	//  0x08F9C
	int var_08FA0;	//  0x08FA0
	int var_08FA4;	//  0x08FA4
	int var_08FA8;	//  0x08FA8
	int var_08FAC;	//  0x08FAC
	int var_08FB0;	//  0x08FB0
	int var_08FB4;	//  0x08FB4
	int var_08FB8;	//  0x08FB8
	int var_08FBC;	//  0x08FBC
	int var_08FC0;	//  0x08FC0
	int var_08FC4;	//  0x08FC4
	int var_08FC8;	//  0x08FC8
	int var_08FCC;	//  0x08FCC
	int var_08FD0;	//  0x08FD0
	int var_08FD4;	//  0x08FD4
	int var_08FD8;	//  0x08FD8
	int var_08FDC;	//  0x08FDC
	int var_08FE0;	//  0x08FE0
	int var_08FE4;	//  0x08FE4
	int var_08FE8;	//  0x08FE8
	int var_08FEC;	//  0x08FEC
	int var_08FF0;	//  0x08FF0
	int var_08FF4;	//  0x08FF4
	int var_08FF8;	//  0x08FF8
	int var_08FFC;	//  0x08FFC
	int var_09000;	//  0x09000
	int var_09004;	//  0x09004
	int var_09008;	//  0x09008
	int var_0900C;	//  0x0900C
	int var_09010;	//  0x09010
	int var_09014;	//  0x09014
	int var_09018;	//  0x09018
	int var_0901C;	//  0x0901C
	int var_09020;	//  0x09020
	int var_09024;	//  0x09024
	int var_09028;	//  0x09028
	int var_0902C;	//  0x0902C
	int var_09030;	//  0x09030
	int var_09034;	//  0x09034
	int var_09038;	//  0x09038
	int var_0903C;	//  0x0903C
	int var_09040;	//  0x09040
	int var_09044;	//  0x09044
	int var_09048;	//  0x09048
	int var_0904C;	//  0x0904C
	int var_09050;	//  0x09050
	int var_09054;	//  0x09054
	int var_09058;	//  0x09058
	int var_0905C;	//  0x0905C
	int var_09060;	//  0x09060
	int var_09064;	//  0x09064
	int var_09068;	//  0x09068
	int var_0906C;	//  0x0906C
	int var_09070;	//  0x09070
	int var_09074;	//  0x09074
	int var_09078;	//  0x09078
	int var_0907C;	//  0x0907C
	int var_09080;	//  0x09080
	int var_09084;	//  0x09084
	int var_09088;	//  0x09088
	int var_0908C;	//  0x0908C
	int var_09090;	//  0x09090
	int var_09094;	//  0x09094
	int var_09098;	//  0x09098
	int var_0909C;	//  0x0909C
	int var_090A0;	//  0x090A0
	int var_090A4;	//  0x090A4
	int var_090A8;	//  0x090A8
	int var_090AC;	//  0x090AC
	int var_090B0;	//  0x090B0
	int var_090B4;	//  0x090B4
	int var_090B8;	//  0x090B8
	int var_090BC;	//  0x090BC
	int var_090C0;	//  0x090C0
	int var_090C4;	//  0x090C4
	int var_090C8;	//  0x090C8
	int var_090CC;	//  0x090CC
	int var_090D0;	//  0x090D0
	int var_090D4;	//  0x090D4
	int var_090D8;	//  0x090D8
	int var_090DC;	//  0x090DC
	int var_090E0;	//  0x090E0
	int var_090E4;	//  0x090E4
	int var_090E8;	//  0x090E8
	int var_090EC;	//  0x090EC
	int var_090F0;	//  0x090F0
	int var_090F4;	//  0x090F4
	int var_090F8;	//  0x090F8
	int var_090FC;	//  0x090FC
	int var_09100;	//  0x09100
	int var_09104;	//  0x09104
	int var_09108;	//  0x09108
	int var_0910C;	//  0x0910C
	int var_09110;	//  0x09110
	int var_09114;	//  0x09114
	int var_09118;	//  0x09118
	int var_0911C;	//  0x0911C
	int var_09120;	//  0x09120
	int var_09124;	//  0x09124
	int var_09128;	//  0x09128
	int var_0912C;	//  0x0912C
	int var_09130;	//  0x09130
	int var_09134;	//  0x09134
	int var_09138;	//  0x09138
	int var_0913C;	//  0x0913C
	int var_09140;	//  0x09140
	int var_09144;	//  0x09144
	int var_09148;	//  0x09148
	int var_0914C;	//  0x0914C
	int var_09150;	//  0x09150
	int var_09154;	//  0x09154
	int var_09158;	//  0x09158
	int var_0915C;	//  0x0915C
	int var_09160;	//  0x09160
	int var_09164;	//  0x09164
	int var_09168;	//  0x09168
	int var_0916C;	//  0x0916C
	int var_09170;	//  0x09170
	int var_09174;	//  0x09174
	int var_09178;	//  0x09178
	int var_0917C;	//  0x0917C
	int var_09180;	//  0x09180
	int var_09184;	//  0x09184
	int var_09188;	//  0x09188
	int var_0918C;	//  0x0918C
	int var_09190;	//  0x09190
	int var_09194;	//  0x09194
	int var_09198;	//  0x09198
	int var_0919C;	//  0x0919C
	int var_091A0;	//  0x091A0
	int var_091A4;	//  0x091A4
	int var_091A8;	//  0x091A8
	int var_091AC;	//  0x091AC
	int var_091B0;	//  0x091B0
	int var_091B4;	//  0x091B4
	int var_091B8;	//  0x091B8
	int var_091BC;	//  0x091BC
	int var_091C0;	//  0x091C0
	int var_091C4;	//  0x091C4
	int var_091C8;	//  0x091C8
	int var_091CC;	//  0x091CC
	int var_091D0;	//  0x091D0
	int var_091D4;	//  0x091D4
	int var_091D8;	//  0x091D8
	int var_091DC;	//  0x091DC
	int var_091E0;	//  0x091E0
	int var_091E4;	//  0x091E4
	int var_091E8;	//  0x091E8
	int var_091EC;	//  0x091EC
	int var_091F0;	//  0x091F0
	int var_091F4;	//  0x091F4
	int var_091F8;	//  0x091F8
	int var_091FC;	//  0x091FC
	int var_09200;	//  0x09200
	int var_09204;	//  0x09204
	int var_09208;	//  0x09208
	int var_0920C;	//  0x0920C
	int var_09210;	//  0x09210
	int var_09214;	//  0x09214
	int var_09218;	//  0x09218
	int var_0921C;	//  0x0921C
	int var_09220;	//  0x09220
	int var_09224;	//  0x09224
	int var_09228;	//  0x09228
	int var_0922C;	//  0x0922C
	int var_09230;	//  0x09230
	int var_09234;	//  0x09234
	int var_09238;	//  0x09238
	int var_0923C;	//  0x0923C
	int var_09240;	//  0x09240
	int var_09244;	//  0x09244
	int var_09248;	//  0x09248
	int var_0924C;	//  0x0924C
	int var_09250;	//  0x09250
	int var_09254;	//  0x09254
	int var_09258;	//  0x09258
	int var_0925C;	//  0x0925C
	int var_09260;	//  0x09260
	int var_09264;	//  0x09264
	int var_09268;	//  0x09268
	int var_0926C;	//  0x0926C
	int var_09270;	//  0x09270
	int var_09274;	//  0x09274
	int var_09278;	//  0x09278
	int var_0927C;	//  0x0927C
	int var_09280;	//  0x09280
	int var_09284;	//  0x09284
	int var_09288;	//  0x09288
	int var_0928C;	//  0x0928C
	int var_09290;	//  0x09290
	int var_09294;	//  0x09294
	int var_09298;	//  0x09298
	int var_0929C;	//  0x0929C
	int var_092A0;	//  0x092A0
	int var_092A4;	//  0x092A4
	int var_092A8;	//  0x092A8
	int var_092AC;	//  0x092AC
	int var_092B0;	//  0x092B0
	int var_092B4;	//  0x092B4
	int var_092B8;	//  0x092B8
	int var_092BC;	//  0x092BC
	int var_092C0;	//  0x092C0
	int var_092C4;	//  0x092C4
	int var_092C8;	//  0x092C8
	int var_092CC;	//  0x092CC
	int var_092D0;	//  0x092D0
	int var_092D4;	//  0x092D4
	int var_092D8;	//  0x092D8
	int var_092DC;	//  0x092DC
	int var_092E0;	//  0x092E0
	int var_092E4;	//  0x092E4
	int var_092E8;	//  0x092E8
	int var_092EC;	//  0x092EC
	int var_092F0;	//  0x092F0
	int var_092F4;	//  0x092F4
	int var_092F8;	//  0x092F8
	int var_092FC;	//  0x092FC
	int var_09300;	//  0x09300
	int var_09304;	//  0x09304
	int var_09308;	//  0x09308
	int var_0930C;	//  0x0930C
	int var_09310;	//  0x09310
	int var_09314;	//  0x09314
	int var_09318;	//  0x09318
	int var_0931C;	//  0x0931C
	int var_09320;	//  0x09320
	int var_09324;	//  0x09324
	int var_09328;	//  0x09328
	int var_0932C;	//  0x0932C
	int var_09330;	//  0x09330
	int var_09334;	//  0x09334
	int var_09338;	//  0x09338
	int var_0933C;	//  0x0933C
	int var_09340;	//  0x09340
	int var_09344;	//  0x09344
	int var_09348;	//  0x09348
	int var_0934C;	//  0x0934C
	int var_09350;	//  0x09350
	int var_09354;	//  0x09354
	int var_09358;	//  0x09358
	int var_0935C;	//  0x0935C
	int var_09360;	//  0x09360
	int var_09364;	//  0x09364
	int var_09368;	//  0x09368
	int var_0936C;	//  0x0936C
	int var_09370;	//  0x09370
	int var_09374;	//  0x09374
	int var_09378;	//  0x09378
	int var_0937C;	//  0x0937C
	int var_09380;	//  0x09380
	int var_09384;	//  0x09384
	int var_09388;	//  0x09388
	int var_0938C;	//  0x0938C
	int var_09390;	//  0x09390
	int var_09394;	//  0x09394
	int var_09398;	//  0x09398
	int var_0939C;	//  0x0939C
	int var_093A0;	//  0x093A0
	int var_093A4;	//  0x093A4
	int var_093A8;	//  0x093A8
	int var_093AC;	//  0x093AC
	int var_093B0;	//  0x093B0
	int var_093B4;	//  0x093B4
	int var_093B8;	//  0x093B8
	int var_093BC;	//  0x093BC
	int var_093C0;	//  0x093C0
	int var_093C4;	//  0x093C4
	int var_093C8;	//  0x093C8
	int var_093CC;	//  0x093CC
	int var_093D0;	//  0x093D0
	int var_093D4;	//  0x093D4
	int var_093D8;	//  0x093D8
	int var_093DC;	//  0x093DC
	int var_093E0;	//  0x093E0
	int var_093E4;	//  0x093E4
	int var_093E8;	//  0x093E8
	int var_093EC;	//  0x093EC
	int var_093F0;	//  0x093F0
	int var_093F4;	//  0x093F4
	int var_093F8;	//  0x093F8
	int var_093FC;	//  0x093FC
	int var_09400;	//  0x09400
	int var_09404;	//  0x09404
	int var_09408;	//  0x09408
	int var_0940C;	//  0x0940C
	int var_09410;	//  0x09410
	int var_09414;	//  0x09414
	int var_09418;	//  0x09418
	int var_0941C;	//  0x0941C
	int var_09420;	//  0x09420
	int var_09424;	//  0x09424
	int var_09428;	//  0x09428
	int var_0942C;	//  0x0942C
	int var_09430;	//  0x09430
	int var_09434;	//  0x09434
	int var_09438;	//  0x09438
	int var_0943C;	//  0x0943C
	int var_09440;	//  0x09440
	int var_09444;	//  0x09444
	int var_09448;	//  0x09448
	int var_0944C;	//  0x0944C
	int var_09450;	//  0x09450
	int var_09454;	//  0x09454
	int var_09458;	//  0x09458
	int var_0945C;	//  0x0945C
	int var_09460;	//  0x09460
	int var_09464;	//  0x09464
	int var_09468;	//  0x09468
	int var_0946C;	//  0x0946C
	int var_09470;	//  0x09470
	int var_09474;	//  0x09474
	int var_09478;	//  0x09478
	int var_0947C;	//  0x0947C
	int var_09480;	//  0x09480
	int var_09484;	//  0x09484
	int var_09488;	//  0x09488
	int var_0948C;	//  0x0948C
	int var_09490;	//  0x09490
	int var_09494;	//  0x09494
	int var_09498;	//  0x09498
	int var_0949C;	//  0x0949C
	int var_094A0;	//  0x094A0
	int var_094A4;	//  0x094A4
	int var_094A8;	//  0x094A8
	int var_094AC;	//  0x094AC
	int var_094B0;	//  0x094B0
	int var_094B4;	//  0x094B4
	int var_094B8;	//  0x094B8
	int var_094BC;	//  0x094BC
	int var_094C0;	//  0x094C0
	int var_094C4;	//  0x094C4
	int var_094C8;	//  0x094C8
	int var_094CC;	//  0x094CC
	int var_094D0;	//  0x094D0
	int var_094D4;	//  0x094D4
	int var_094D8;	//  0x094D8
	int var_094DC;	//  0x094DC
	int var_094E0;	//  0x094E0
	int var_094E4;	//  0x094E4
	int var_094E8;	//  0x094E8
	int var_094EC;	//  0x094EC
	int var_094F0;	//  0x094F0
	int var_094F4;	//  0x094F4
	int var_094F8;	//  0x094F8
	int var_094FC;	//  0x094FC
	int var_09500;	//  0x09500
	int var_09504;	//  0x09504
	int var_09508;	//  0x09508
	int var_0950C;	//  0x0950C
	int var_09510;	//  0x09510
	int var_09514;	//  0x09514
	int var_09518;	//  0x09518
	int var_0951C;	//  0x0951C
	int var_09520;	//  0x09520
	int var_09524;	//  0x09524
	int var_09528;	//  0x09528
	int var_0952C;	//  0x0952C
	int var_09530;	//  0x09530
	int var_09534;	//  0x09534
	int var_09538;	//  0x09538
	int var_0953C;	//  0x0953C
	int var_09540;	//  0x09540
	int var_09544;	//  0x09544
	int var_09548;	//  0x09548
	int var_0954C;	//  0x0954C
	int var_09550;	//  0x09550
	int var_09554;	//  0x09554
	int var_09558;	//  0x09558
	int var_0955C;	//  0x0955C
	int var_09560;	//  0x09560
	int var_09564;	//  0x09564
	int var_09568;	//  0x09568
	int var_0956C;	//  0x0956C
	int var_09570;	//  0x09570
	int var_09574;	//  0x09574
	int var_09578;	//  0x09578
	int var_0957C;	//  0x0957C
	int var_09580;	//  0x09580
	int var_09584;	//  0x09584
	int var_09588;	//  0x09588
	int var_0958C;	//  0x0958C
	int var_09590;	//  0x09590
	int var_09594;	//  0x09594
	int var_09598;	//  0x09598
	int var_0959C;	//  0x0959C
	int var_095A0;	//  0x095A0
	int var_095A4;	//  0x095A4
	int var_095A8;	//  0x095A8
	int var_095AC;	//  0x095AC
	int var_095B0;	//  0x095B0
	int var_095B4;	//  0x095B4
	int var_095B8;	//  0x095B8
	int var_095BC;	//  0x095BC
	int var_095C0;	//  0x095C0
	int var_095C4;	//  0x095C4
	int var_095C8;	//  0x095C8
	int var_095CC;	//  0x095CC
	int var_095D0;	//  0x095D0
	int var_095D4;	//  0x095D4
	int var_095D8;	//  0x095D8
	int var_095DC;	//  0x095DC
	int var_095E0;	//  0x095E0
	int var_095E4;	//  0x095E4
	int var_095E8;	//  0x095E8
	int var_095EC;	//  0x095EC
	int var_095F0;	//  0x095F0
	int var_095F4;	//  0x095F4
	int var_095F8;	//  0x095F8
	int var_095FC;	//  0x095FC
	int var_09600;	//  0x09600
	int var_09604;	//  0x09604
	int var_09608;	//  0x09608
	int var_0960C;	//  0x0960C
	int var_09610;	//  0x09610
	int var_09614;	//  0x09614
	int var_09618;	//  0x09618
	int var_0961C;	//  0x0961C
	int var_09620;	//  0x09620
	int var_09624;	//  0x09624
	int var_09628;	//  0x09628
	int var_0962C;	//  0x0962C
	int var_09630;	//  0x09630
	int var_09634;	//  0x09634
	int var_09638;	//  0x09638
	int var_0963C;	//  0x0963C
	int var_09640;	//  0x09640
	int var_09644;	//  0x09644
	int var_09648;	//  0x09648
	int var_0964C;	//  0x0964C
	int var_09650;	//  0x09650
	int var_09654;	//  0x09654
	int var_09658;	//  0x09658
	int var_0965C;	//  0x0965C
	int var_09660;	//  0x09660
	int var_09664;	//  0x09664
	int var_09668;	//  0x09668
	int var_0966C;	//  0x0966C
	int var_09670;	//  0x09670
	int var_09674;	//  0x09674
	int var_09678;	//  0x09678
	int var_0967C;	//  0x0967C
	int var_09680;	//  0x09680
	int var_09684;	//  0x09684
	int var_09688;	//  0x09688
	int var_0968C;	//  0x0968C
	int var_09690;	//  0x09690
	int var_09694;	//  0x09694
	int var_09698;	//  0x09698
	int var_0969C;	//  0x0969C
	int var_096A0;	//  0x096A0
	int var_096A4;	//  0x096A4
	int var_096A8;	//  0x096A8
	int var_096AC;	//  0x096AC
	int var_096B0;	//  0x096B0
	int var_096B4;	//  0x096B4
	int var_096B8;	//  0x096B8
	int var_096BC;	//  0x096BC
	int var_096C0;	//  0x096C0
	int var_096C4;	//  0x096C4
	int var_096C8;	//  0x096C8
	int var_096CC;	//  0x096CC
	int var_096D0;	//  0x096D0
	int var_096D4;	//  0x096D4
	int var_096D8;	//  0x096D8
	int var_096DC;	//  0x096DC
	int var_096E0;	//  0x096E0
	int var_096E4;	//  0x096E4
	int var_096E8;	//  0x096E8
	int var_096EC;	//  0x096EC
	int var_096F0;	//  0x096F0
	int var_096F4;	//  0x096F4
	int var_096F8;	//  0x096F8
	int var_096FC;	//  0x096FC
	int var_09700;	//  0x09700
	int var_09704;	//  0x09704
	int var_09708;	//  0x09708
	int var_0970C;	//  0x0970C
	int var_09710;	//  0x09710
	int var_09714;	//  0x09714
	int var_09718;	//  0x09718
	int var_0971C;	//  0x0971C
	int var_09720;	//  0x09720
	int var_09724;	//  0x09724
	int var_09728;	//  0x09728
	int var_0972C;	//  0x0972C
	int var_09730;	//  0x09730
	int var_09734;	//  0x09734
	int var_09738;	//  0x09738
	int var_0973C;	//  0x0973C
	int var_09740;	//  0x09740
	int var_09744;	//  0x09744
	int var_09748;	//  0x09748
	int var_0974C;	//  0x0974C
	int var_09750;	//  0x09750
	int var_09754;	//  0x09754
	int var_09758;	//  0x09758
	int var_0975C;	//  0x0975C
	int var_09760;	//  0x09760
	int var_09764;	//  0x09764
	int var_09768;	//  0x09768
	int var_0976C;	//  0x0976C
	int var_09770;	//  0x09770
	int var_09774;	//  0x09774
	int var_09778;	//  0x09778
	int var_0977C;	//  0x0977C
	int var_09780;	//  0x09780
	int var_09784;	//  0x09784
	int var_09788;	//  0x09788
	int var_0978C;	//  0x0978C
	int var_09790;	//  0x09790
	int var_09794;	//  0x09794
	int var_09798;	//  0x09798
	int var_0979C;	//  0x0979C
	int var_097A0;	//  0x097A0
	int var_097A4;	//  0x097A4
	int var_097A8;	//  0x097A8
	int var_097AC;	//  0x097AC
	int var_097B0;	//  0x097B0
	int var_097B4;	//  0x097B4
	int var_097B8;	//  0x097B8
	int var_097BC;	//  0x097BC
	int var_097C0;	//  0x097C0
	int var_097C4;	//  0x097C4
	int var_097C8;	//  0x097C8
	int var_097CC;	//  0x097CC
	int var_097D0;	//  0x097D0
	int var_097D4;	//  0x097D4
	int var_097D8;	//  0x097D8
	int var_097DC;	//  0x097DC
	int var_097E0;	//  0x097E0
	int var_097E4;	//  0x097E4
	int var_097E8;	//  0x097E8
	int var_097EC;	//  0x097EC
	int var_097F0;	//  0x097F0
	int var_097F4;	//  0x097F4
	int var_097F8;	//  0x097F8
	int var_097FC;	//  0x097FC
	int var_09800;	//  0x09800
	int var_09804;	//  0x09804
	int var_09808;	//  0x09808
	int var_0980C;	//  0x0980C
	int var_09810;	//  0x09810
	int var_09814;	//  0x09814
	int var_09818;	//  0x09818
	int var_0981C;	//  0x0981C
	int var_09820;	//  0x09820
	int var_09824;	//  0x09824
	int var_09828;	//  0x09828
	int var_0982C;	//  0x0982C
	int var_09830;	//  0x09830
	int var_09834;	//  0x09834
	int var_09838;	//  0x09838
	int var_0983C;	//  0x0983C
	int var_09840;	//  0x09840
	int var_09844;	//  0x09844
	int var_09848;	//  0x09848
	int var_0984C;	//  0x0984C
	int var_09850;	//  0x09850
	int var_09854;	//  0x09854
	int var_09858;	//  0x09858
	int var_0985C;	//  0x0985C
	int var_09860;	//  0x09860
	int var_09864;	//  0x09864
	int var_09868;	//  0x09868
	int var_0986C;	//  0x0986C
	int var_09870;	//  0x09870
	int var_09874;	//  0x09874
	int var_09878;	//  0x09878
	int var_0987C;	//  0x0987C
	int var_09880;	//  0x09880
	int var_09884;	//  0x09884
	int var_09888;	//  0x09888
	int var_0988C;	//  0x0988C
	int var_09890;	//  0x09890
	int var_09894;	//  0x09894
	int var_09898;	//  0x09898
	int var_0989C;	//  0x0989C
	int var_098A0;	//  0x098A0
	int var_098A4;	//  0x098A4
	int var_098A8;	//  0x098A8
	int var_098AC;	//  0x098AC
	int var_098B0;	//  0x098B0
	int var_098B4;	//  0x098B4
	int var_098B8;	//  0x098B8
	int var_098BC;	//  0x098BC
	int var_098C0;	//  0x098C0
	int var_098C4;	//  0x098C4
	int var_098C8;	//  0x098C8
	int var_098CC;	//  0x098CC
	int var_098D0;	//  0x098D0
	int var_098D4;	//  0x098D4
	int var_098D8;	//  0x098D8
	int var_098DC;	//  0x098DC
	int var_098E0;	//  0x098E0
	int var_098E4;	//  0x098E4
	int var_098E8;	//  0x098E8
	int var_098EC;	//  0x098EC
	int var_098F0;	//  0x098F0
	int var_098F4;	//  0x098F4
	int var_098F8;	//  0x098F8
	int var_098FC;	//  0x098FC
	int var_09900;	//  0x09900
	int var_09904;	//  0x09904
	int var_09908;	//  0x09908
	int var_0990C;	//  0x0990C
	int var_09910;	//  0x09910
	int var_09914;	//  0x09914
	int var_09918;	//  0x09918
	int var_0991C;	//  0x0991C
	int var_09920;	//  0x09920
	int var_09924;	//  0x09924
	int var_09928;	//  0x09928
	int var_0992C;	//  0x0992C
	int var_09930;	//  0x09930
	int var_09934;	//  0x09934
	int var_09938;	//  0x09938
	int var_0993C;	//  0x0993C
	int var_09940;	//  0x09940
	int var_09944;	//  0x09944
	int var_09948;	//  0x09948
	int var_0994C;	//  0x0994C
	int var_09950;	//  0x09950
	int var_09954;	//  0x09954
	int var_09958;	//  0x09958
	int var_0995C;	//  0x0995C
	int var_09960;	//  0x09960
	int var_09964;	//  0x09964
	int var_09968;	//  0x09968
	int var_0996C;	//  0x0996C
	int var_09970;	//  0x09970
	int var_09974;	//  0x09974
	int var_09978;	//  0x09978
	int var_0997C;	//  0x0997C
	int var_09980;	//  0x09980
	int var_09984;	//  0x09984
	int var_09988;	//  0x09988
	int var_0998C;	//  0x0998C
	int var_09990;	//  0x09990
	int var_09994;	//  0x09994
	int var_09998;	//  0x09998
	int var_0999C;	//  0x0999C
	int var_099A0;	//  0x099A0
	int var_099A4;	//  0x099A4
	int var_099A8;	//  0x099A8
	int var_099AC;	//  0x099AC
	int var_099B0;	//  0x099B0
	int var_099B4;	//  0x099B4
	int var_099B8;	//  0x099B8
	int var_099BC;	//  0x099BC
	int var_099C0;	//  0x099C0
	int var_099C4;	//  0x099C4
	int var_099C8;	//  0x099C8
	int var_099CC;	//  0x099CC
	int var_099D0;	//  0x099D0
	int var_099D4;	//  0x099D4
	int var_099D8;	//  0x099D8
	int var_099DC;	//  0x099DC
	int var_099E0;	//  0x099E0
	int var_099E4;	//  0x099E4
	int var_099E8;	//  0x099E8
	int var_099EC;	//  0x099EC
	int var_099F0;	//  0x099F0
	int var_099F4;	//  0x099F4
	int var_099F8;	//  0x099F8
	int var_099FC;	//  0x099FC
	int var_09A00;	//  0x09A00
	int var_09A04;	//  0x09A04
	int var_09A08;	//  0x09A08
	int var_09A0C;	//  0x09A0C
	int var_09A10;	//  0x09A10
	int var_09A14;	//  0x09A14
	int var_09A18;	//  0x09A18
	int var_09A1C;	//  0x09A1C
	int var_09A20;	//  0x09A20
	int var_09A24;	//  0x09A24
	int var_09A28;	//  0x09A28
	int var_09A2C;	//  0x09A2C
	int var_09A30;	//  0x09A30
	int var_09A34;	//  0x09A34
	int var_09A38;	//  0x09A38
	int var_09A3C;	//  0x09A3C
	int var_09A40;	//  0x09A40
	int var_09A44;	//  0x09A44
	int var_09A48;	//  0x09A48
	int var_09A4C;	//  0x09A4C
	int var_09A50;	//  0x09A50
	int var_09A54;	//  0x09A54
	int var_09A58;	//  0x09A58
	int var_09A5C;	//  0x09A5C
	int var_09A60;	//  0x09A60
	int var_09A64;	//  0x09A64
	int var_09A68;	//  0x09A68
	int var_09A6C;	//  0x09A6C
	int var_09A70;	//  0x09A70
	int var_09A74;	//  0x09A74
	int var_09A78;	//  0x09A78
	int var_09A7C;	//  0x09A7C
	int var_09A80;	//  0x09A80
	int var_09A84;	//  0x09A84
	int var_09A88;	//  0x09A88
	int var_09A8C;	//  0x09A8C
	int var_09A90;	//  0x09A90
	int var_09A94;	//  0x09A94
	int var_09A98;	//  0x09A98
	int var_09A9C;	//  0x09A9C
	int var_09AA0;	//  0x09AA0
	int var_09AA4;	//  0x09AA4
	int var_09AA8;	//  0x09AA8
	int var_09AAC;	//  0x09AAC
	int var_09AB0;	//  0x09AB0
	int var_09AB4;	//  0x09AB4
	int var_09AB8;	//  0x09AB8
	int var_09ABC;	//  0x09ABC
	int var_09AC0;	//  0x09AC0
	int var_09AC4;	//  0x09AC4
	int var_09AC8;	//  0x09AC8
	int var_09ACC;	//  0x09ACC
	int var_09AD0;	//  0x09AD0
	int var_09AD4;	//  0x09AD4
	int var_09AD8;	//  0x09AD8
	int var_09ADC;	//  0x09ADC
	int var_09AE0;	//  0x09AE0
	int var_09AE4;	//  0x09AE4
	int var_09AE8;	//  0x09AE8
	int var_09AEC;	//  0x09AEC
	int var_09AF0;	//  0x09AF0
	int var_09AF4;	//  0x09AF4
	int var_09AF8;	//  0x09AF8
	int var_09AFC;	//  0x09AFC
	int var_09B00;	//  0x09B00
	int var_09B04;	//  0x09B04
	int var_09B08;	//  0x09B08
	int var_09B0C;	//  0x09B0C
	int var_09B10;	//  0x09B10
	int var_09B14;	//  0x09B14
	int var_09B18;	//  0x09B18
	int var_09B1C;	//  0x09B1C
	int var_09B20;	//  0x09B20
	int var_09B24;	//  0x09B24
	int var_09B28;	//  0x09B28
	int var_09B2C;	//  0x09B2C
	int var_09B30;	//  0x09B30
	int var_09B34;	//  0x09B34
	int var_09B38;	//  0x09B38
	int var_09B3C;	//  0x09B3C
	int var_09B40;	//  0x09B40
	int var_09B44;	//  0x09B44
	int var_09B48;	//  0x09B48
	int var_09B4C;	//  0x09B4C
	int var_09B50;	//  0x09B50
	int var_09B54;	//  0x09B54
	int var_09B58;	//  0x09B58
	int var_09B5C;	//  0x09B5C
	int var_09B60;	//  0x09B60
	int var_09B64;	//  0x09B64
	int var_09B68;	//  0x09B68
	int var_09B6C;	//  0x09B6C
	int var_09B70;	//  0x09B70
	int var_09B74;	//  0x09B74
	int var_09B78;	//  0x09B78
	int var_09B7C;	//  0x09B7C
	int var_09B80;	//  0x09B80
	int var_09B84;	//  0x09B84
	int var_09B88;	//  0x09B88
	int var_09B8C;	//  0x09B8C
	int var_09B90;	//  0x09B90
	int var_09B94;	//  0x09B94
	int var_09B98;	//  0x09B98
	int var_09B9C;	//  0x09B9C
	int var_09BA0;	//  0x09BA0
	int var_09BA4;	//  0x09BA4
	int var_09BA8;	//  0x09BA8
	int var_09BAC;	//  0x09BAC
	int var_09BB0;	//  0x09BB0
	int var_09BB4;	//  0x09BB4
	int var_09BB8;	//  0x09BB8
	int var_09BBC;	//  0x09BBC
	int var_09BC0;	//  0x09BC0
	int var_09BC4;	//  0x09BC4
	int var_09BC8;	//  0x09BC8
	int var_09BCC;	//  0x09BCC
	int var_09BD0;	//  0x09BD0
	int var_09BD4;	//  0x09BD4
	int var_09BD8;	//  0x09BD8
	int var_09BDC;	//  0x09BDC
	int var_09BE0;	//  0x09BE0
	int var_09BE4;	//  0x09BE4
	int var_09BE8;	//  0x09BE8
	int var_09BEC;	//  0x09BEC
	int var_09BF0;	//  0x09BF0
	int var_09BF4;	//  0x09BF4
	int var_09BF8;	//  0x09BF8
	int var_09BFC;	//  0x09BFC
	int var_09C00;	//  0x09C00
	int var_09C04;	//  0x09C04
	int var_09C08;	//  0x09C08
	int var_09C0C;	//  0x09C0C
	int var_09C10;	//  0x09C10
	int var_09C14;	//  0x09C14
	int var_09C18;	//  0x09C18
	int var_09C1C;	//  0x09C1C
	int var_09C20;	//  0x09C20
	int var_09C24;	//  0x09C24
	int var_09C28;	//  0x09C28
	int var_09C2C;	//  0x09C2C
	int var_09C30;	//  0x09C30
	int var_09C34;	//  0x09C34
	int var_09C38;	//  0x09C38
	int var_09C3C;	//  0x09C3C
	int var_09C40;	//  0x09C40
	int var_09C44;	//  0x09C44
	int var_09C48;	//  0x09C48
	int var_09C4C;	//  0x09C4C
	int var_09C50;	//  0x09C50
	int var_09C54;	//  0x09C54
	int var_09C58;	//  0x09C58
	int var_09C5C;	//  0x09C5C
	int var_09C60;	//  0x09C60
	int var_09C64;	//  0x09C64
	int var_09C68;	//  0x09C68
	int var_09C6C;	//  0x09C6C
	int var_09C70;	//  0x09C70
	int var_09C74;	//  0x09C74
	int var_09C78;	//  0x09C78
	int var_09C7C;	//  0x09C7C
	int var_09C80;	//  0x09C80
	int var_09C84;	//  0x09C84
	int var_09C88;	//  0x09C88
	int var_09C8C;	//  0x09C8C
	int var_09C90;	//  0x09C90
	int var_09C94;	//  0x09C94
	int var_09C98;	//  0x09C98
	int var_09C9C;	//  0x09C9C
	int var_09CA0;	//  0x09CA0
	int var_09CA4;	//  0x09CA4
	int var_09CA8;	//  0x09CA8
	int var_09CAC;	//  0x09CAC
	int var_09CB0;	//  0x09CB0
	int var_09CB4;	//  0x09CB4
	int var_09CB8;	//  0x09CB8
	int var_09CBC;	//  0x09CBC
	int var_09CC0;	//  0x09CC0
	int var_09CC4;	//  0x09CC4
	int var_09CC8;	//  0x09CC8
	int var_09CCC;	//  0x09CCC
	int var_09CD0;	//  0x09CD0
	int var_09CD4;	//  0x09CD4
	int var_09CD8;	//  0x09CD8
	int var_09CDC;	//  0x09CDC
	int var_09CE0;	//  0x09CE0
	int var_09CE4;	//  0x09CE4
	int var_09CE8;	//  0x09CE8
	int var_09CEC;	//  0x09CEC
	int var_09CF0;	//  0x09CF0
	int var_09CF4;	//  0x09CF4
	int var_09CF8;	//  0x09CF8
	int var_09CFC;	//  0x09CFC
	int var_09D00;	//  0x09D00
	int var_09D04;	//  0x09D04
	int var_09D08;	//  0x09D08
	int var_09D0C;	//  0x09D0C
	int var_09D10;	//  0x09D10
	int var_09D14;	//  0x09D14
	int var_09D18;	//  0x09D18
	int var_09D1C;	//  0x09D1C
	int var_09D20;	//  0x09D20
	int var_09D24;	//  0x09D24
	int var_09D28;	//  0x09D28
	int var_09D2C;	//  0x09D2C
	int var_09D30;	//  0x09D30
	int var_09D34;	//  0x09D34
	int var_09D38;	//  0x09D38
	int var_09D3C;	//  0x09D3C
	int var_09D40;	//  0x09D40
	int var_09D44;	//  0x09D44
	int var_09D48;	//  0x09D48
	int var_09D4C;	//  0x09D4C
	int var_09D50;	//  0x09D50
	int var_09D54;	//  0x09D54
	int var_09D58;	//  0x09D58
	int var_09D5C;	//  0x09D5C
	int var_09D60;	//  0x09D60
	int var_09D64;	//  0x09D64
	int var_09D68;	//  0x09D68
	int var_09D6C;	//  0x09D6C
	int var_09D70;	//  0x09D70
	int var_09D74;	//  0x09D74
	int var_09D78;	//  0x09D78
	int var_09D7C;	//  0x09D7C
	int var_09D80;	//  0x09D80
	int var_09D84;	//  0x09D84
	int var_09D88;	//  0x09D88
	int var_09D8C;	//  0x09D8C
	int var_09D90;	//  0x09D90
	int var_09D94;	//  0x09D94
	int var_09D98;	//  0x09D98
	int var_09D9C;	//  0x09D9C
	int var_09DA0;	//  0x09DA0
	int var_09DA4;	//  0x09DA4
	int var_09DA8;	//  0x09DA8
	int var_09DAC;	//  0x09DAC
	int var_09DB0;	//  0x09DB0
	int var_09DB4;	//  0x09DB4
	int var_09DB8;	//  0x09DB8
	int var_09DBC;	//  0x09DBC
	int var_09DC0;	//  0x09DC0
	int var_09DC4;	//  0x09DC4
	int var_09DC8;	//  0x09DC8
	int var_09DCC;	//  0x09DCC
	int var_09DD0;	//  0x09DD0
	int var_09DD4;	//  0x09DD4
	int var_09DD8;	//  0x09DD8
	int var_09DDC;	//  0x09DDC
	int var_09DE0;	//  0x09DE0
	int var_09DE4;	//  0x09DE4
	int var_09DE8;	//  0x09DE8
	int var_09DEC;	//  0x09DEC
	int var_09DF0;	//  0x09DF0
	int var_09DF4;	//  0x09DF4
	int var_09DF8;	//  0x09DF8
	int var_09DFC;	//  0x09DFC
	int var_09E00;	//  0x09E00
	int var_09E04;	//  0x09E04
	int var_09E08;	//  0x09E08
	int var_09E0C;	//  0x09E0C
	int var_09E10;	//  0x09E10
	int var_09E14;	//  0x09E14
	int var_09E18;	//  0x09E18
	int var_09E1C;	//  0x09E1C
	int var_09E20;	//  0x09E20
	int var_09E24;	//  0x09E24
	int var_09E28;	//  0x09E28
	int var_09E2C;	//  0x09E2C
	int var_09E30;	//  0x09E30
	int var_09E34;	//  0x09E34
	int var_09E38;	//  0x09E38
	int var_09E3C;	//  0x09E3C
	int var_09E40;	//  0x09E40
	int var_09E44;	//  0x09E44
	int var_09E48;	//  0x09E48
	int var_09E4C;	//  0x09E4C
	int var_09E50;	//  0x09E50
	int var_09E54;	//  0x09E54
	int var_09E58;	//  0x09E58
	int var_09E5C;	//  0x09E5C
	int var_09E60;	//  0x09E60
	int var_09E64;	//  0x09E64
	int var_09E68;	//  0x09E68
	int var_09E6C;	//  0x09E6C
	int var_09E70;	//  0x09E70
	int var_09E74;	//  0x09E74
	int var_09E78;	//  0x09E78
	int var_09E7C;	//  0x09E7C
	int var_09E80;	//  0x09E80
	int var_09E84;	//  0x09E84
	int var_09E88;	//  0x09E88
	int var_09E8C;	//  0x09E8C
	int var_09E90;	//  0x09E90
	int var_09E94;	//  0x09E94
	int var_09E98;	//  0x09E98
	int var_09E9C;	//  0x09E9C
	int var_09EA0;	//  0x09EA0
	int var_09EA4;	//  0x09EA4
	int var_09EA8;	//  0x09EA8
	int var_09EAC;	//  0x09EAC
	int var_09EB0;	//  0x09EB0
	int var_09EB4;	//  0x09EB4
	int var_09EB8;	//  0x09EB8
	int var_09EBC;	//  0x09EBC
	int var_09EC0;	//  0x09EC0
	int var_09EC4;	//  0x09EC4
	int var_09EC8;	//  0x09EC8
	int var_09ECC;	//  0x09ECC
	int var_09ED0;	//  0x09ED0
	int var_09ED4;	//  0x09ED4
	int var_09ED8;	//  0x09ED8
	int var_09EDC;	//  0x09EDC
	int var_09EE0;	//  0x09EE0
	int var_09EE4;	//  0x09EE4
	int var_09EE8;	//  0x09EE8
	int var_09EEC;	//  0x09EEC
	int var_09EF0;	//  0x09EF0
	int var_09EF4;	//  0x09EF4
	int var_09EF8;	//  0x09EF8
	int var_09EFC;	//  0x09EFC
	int var_09F00;	//  0x09F00
	int var_09F04;	//  0x09F04
	int var_09F08;	//  0x09F08
	int var_09F0C;	//  0x09F0C
	int var_09F10;	//  0x09F10
	int var_09F14;	//  0x09F14
	int var_09F18;	//  0x09F18
	int var_09F1C;	//  0x09F1C
	int var_09F20;	//  0x09F20
	int var_09F24;	//  0x09F24
	int var_09F28;	//  0x09F28
	int var_09F2C;	//  0x09F2C
	int var_09F30;	//  0x09F30
	int var_09F34;	//  0x09F34
	int var_09F38;	//  0x09F38
	int var_09F3C;	//  0x09F3C
	int var_09F40;	//  0x09F40
	int var_09F44;	//  0x09F44
	int var_09F48;	//  0x09F48
	int var_09F4C;	//  0x09F4C
	int var_09F50;	//  0x09F50
	int var_09F54;	//  0x09F54
	int var_09F58;	//  0x09F58
	int var_09F5C;	//  0x09F5C
	int var_09F60;	//  0x09F60
	int var_09F64;	//  0x09F64
	int var_09F68;	//  0x09F68
	int var_09F6C;	//  0x09F6C
	int var_09F70;	//  0x09F70
	int var_09F74;	//  0x09F74
	int var_09F78;	//  0x09F78
	int var_09F7C;	//  0x09F7C
	int var_09F80;	//  0x09F80
	int var_09F84;	//  0x09F84
	int var_09F88;	//  0x09F88
	int var_09F8C;	//  0x09F8C
	int var_09F90;	//  0x09F90
	int var_09F94;	//  0x09F94
	int var_09F98;	//  0x09F98
	int var_09F9C;	//  0x09F9C
	int var_09FA0;	//  0x09FA0
	int var_09FA4;	//  0x09FA4
	int var_09FA8;	//  0x09FA8
	int var_09FAC;	//  0x09FAC
	int var_09FB0;	//  0x09FB0
	int var_09FB4;	//  0x09FB4
	int var_09FB8;	//  0x09FB8
	int var_09FBC;	//  0x09FBC
	int var_09FC0;	//  0x09FC0
	int var_09FC4;	//  0x09FC4
	int var_09FC8;	//  0x09FC8
	int var_09FCC;	//  0x09FCC
	int var_09FD0;	//  0x09FD0
	int var_09FD4;	//  0x09FD4
	int var_09FD8;	//  0x09FD8
	int var_09FDC;	//  0x09FDC
	int var_09FE0;	//  0x09FE0
	int var_09FE4;	//  0x09FE4
	int var_09FE8;	//  0x09FE8
	int var_09FEC;	//  0x09FEC
	int var_09FF0;	//  0x09FF0
	int var_09FF4;	//  0x09FF4
	int var_09FF8;	//  0x09FF8
	int var_09FFC;	//  0x09FFC
	int var_0A000;	//  0x0A000
	int var_0A004;	//  0x0A004
	int var_0A008;	//  0x0A008
	int var_0A00C;	//  0x0A00C
	int var_0A010;	//  0x0A010
	int var_0A014;	//  0x0A014
	int var_0A018;	//  0x0A018
	int var_0A01C;	//  0x0A01C
	int var_0A020;	//  0x0A020
	int var_0A024;	//  0x0A024
	int var_0A028;	//  0x0A028
	int var_0A02C;	//  0x0A02C
	int var_0A030;	//  0x0A030
	int var_0A034;	//  0x0A034
	int var_0A038;	//  0x0A038
	int var_0A03C;	//  0x0A03C
	int var_0A040;	//  0x0A040
	int var_0A044;	//  0x0A044
	int var_0A048;	//  0x0A048
	int var_0A04C;	//  0x0A04C
	int var_0A050;	//  0x0A050
	int var_0A054;	//  0x0A054
	int var_0A058;	//  0x0A058
	int var_0A05C;	//  0x0A05C
	int var_0A060;	//  0x0A060
	int var_0A064;	//  0x0A064
	int var_0A068;	//  0x0A068
	int var_0A06C;	//  0x0A06C
	int var_0A070;	//  0x0A070
	int var_0A074;	//  0x0A074
	int var_0A078;	//  0x0A078
	int var_0A07C;	//  0x0A07C
	int var_0A080;	//  0x0A080
	int var_0A084;	//  0x0A084
	int var_0A088;	//  0x0A088
	int var_0A08C;	//  0x0A08C
	int var_0A090;	//  0x0A090
	int var_0A094;	//  0x0A094
	int var_0A098;	//  0x0A098
	int var_0A09C;	//  0x0A09C
	int var_0A0A0;	//  0x0A0A0
	int var_0A0A4;	//  0x0A0A4
	int var_0A0A8;	//  0x0A0A8
	int var_0A0AC;	//  0x0A0AC
	int var_0A0B0;	//  0x0A0B0
	int var_0A0B4;	//  0x0A0B4
	int var_0A0B8;	//  0x0A0B8
	int var_0A0BC;	//  0x0A0BC
	int var_0A0C0;	//  0x0A0C0
	int var_0A0C4;	//  0x0A0C4
	int var_0A0C8;	//  0x0A0C8
	int var_0A0CC;	//  0x0A0CC
	int var_0A0D0;	//  0x0A0D0
	int var_0A0D4;	//  0x0A0D4
	int var_0A0D8;	//  0x0A0D8
	int var_0A0DC;	//  0x0A0DC
	int var_0A0E0;	//  0x0A0E0
	int var_0A0E4;	//  0x0A0E4
	int var_0A0E8;	//  0x0A0E8
	int var_0A0EC;	//  0x0A0EC
	int var_0A0F0;	//  0x0A0F0
	int var_0A0F4;	//  0x0A0F4
	int var_0A0F8;	//  0x0A0F8
	int var_0A0FC;	//  0x0A0FC
	int var_0A100;	//  0x0A100
	int var_0A104;	//  0x0A104
	int var_0A108;	//  0x0A108
	int var_0A10C;	//  0x0A10C
	int var_0A110;	//  0x0A110
	int var_0A114;	//  0x0A114
	int var_0A118;	//  0x0A118
	int var_0A11C;	//  0x0A11C
	int var_0A120;	//  0x0A120
	int var_0A124;	//  0x0A124
	int var_0A128;	//  0x0A128
	int var_0A12C;	//  0x0A12C
	int var_0A130;	//  0x0A130
	int var_0A134;	//  0x0A134
	int var_0A138;	//  0x0A138
	int var_0A13C;	//  0x0A13C
	int var_0A140;	//  0x0A140
	int var_0A144;	//  0x0A144
